{"County": {"Kerry": {"summary": "County Kerry (Irish: Contae Chiarraí) is a county in Ireland. It is located in the South-West Region and forms part of the province of Munster. It is named after the Ciarraige who lived in part of the present county. The population of the county was 147,707 at the 2016 census.", "image": "Kerry.jpg"}, "Galway": {"summary": "County Galway ( GAWL-way; Irish: Contae na Gaillimhe) is a county in Ireland. It is located in the West of Ireland, part of the province of Connacht.\nThere are several Irish-speaking areas in the west of the county. The traditional county includes, and is named for, the city of Galway, but the city and county now have separate local authorities: Galway City Council administers the urban area, while the rest of the county is administered by Galway County Council.\nThe population of the county was 258,058 at the 2016 census.", "image": "Galway.jpg"}, "Clare": {"summary": "County Clare (Irish: Contae an Chláir) is a county in Ireland, in the Mid-West Region and the province of Munster, bordered on the west by the Atlantic Ocean.  Clare County Council is the local authority. The county had a population of 118,817 at the 2016 census. The county town and largest settlement is Ennis.", "image": "Clare.jpg"}, "Dublin": {"summary": "County Dublin (Irish: Contae Bhaile Átha Cliath or Contae Átha Cliath) is one of the thirty-two traditional counties of Ireland. Prior to 1994 it was also an administrative county covering the whole county outside of Dublin City Council. In 1994, as part of a reorganisation of local government within Dublin the boundaries of Dublin City were redrawn, Dublin County Council was abolished and three new administrative county councils were established: Dún Laoghaire–Rathdown, Fingal and South Dublin.\nWhile it is no longer used as an administrative division for local government, it retains a strong identity in popular culture. It is in the province of Leinster, and is named after the city of Dublin, the capital city of Ireland. County Dublin was one of the first parts of Ireland to be shired by John, King of England following the Norman invasion of Ireland. \nAccording to the 2016 census, the total population of County Dublin was 1,345,402, approximately 27% of the Republic of Ireland's population. The county is a NUTS 3 region, and is part of the NUTS 2 region of Eastern and Midland.", "image": "Dublin.jpg"}, "Longford": {"summary": "County Longford (Irish: Contae an Longfoirt) is a county in Ireland. It is in the province of Leinster. It is named after the town of Longford. Longford County Council is the local authority for the county. The population of the county was 40,873 at the 2016 census. The county is based on the historic Gaelic territory of Annaly (Anghaile), formerly known as Teffia (Teathbha).", "image": "Longford.jpg"}, "Limerick": {"summary": "County Limerick (Irish: Contae Luimnigh) is a county in Ireland. It is located in the province of Munster, and is also part of the Mid-West Region. It is named after the city of Limerick. Limerick City and County Council is the local council for the county. The county's population at the 2016 census was 194,899 of whom 94,192 lived in Limerick City, the county capital.", "image": "Limerick.jpg"}, "Cavan": {"summary": "County Cavan (KAV-ən; Irish: Contae an Chabháin) is a county in Ireland. It is in the province of Ulster and is part of the Border Region. It is named after the town of Cavan and is based on the historic Gaelic territory of East Breffny (Bréifne). Cavan County Council is the local authority for the county, which had a population of 76,176 at the 2016 census.", "image": "Cavan.png"}, "Waterford": {"summary": "County Waterford (Irish: Contae Phort Láirge) is a county in Ireland. It is in the province of Munster and is part of the South-East Region. It is named after the city of Waterford. Waterford City and County Council is the local authority for the county. The population of the county at large, including the city, was 116,176 according to the 2016 census. The county is based on the historic Gaelic territory of the Déise. There is an Irish-speaking area, Gaeltacht na nDéise, in the south-west of the county.", "image": "Waterford.jpg"}, "Carlow": {"summary": "County Carlow (Irish: Contae Cheatharlach)  is a county in Ireland, part of the South-East Region and the province of Leinster. It is named after the town of Carlow, which lies on the River Barrow. Carlow County Council is the local authority. The population was 56,932 at the 2016 census.", "image": "Carlow.png"}, "Donegal": {"summary": "County Donegal ( DUN-ig-AWL, DON-, -⁠awl; Irish: Contae Dhún na nGall) is a county of Ireland in the province of Ulster. It is named after the town of Donegal (Dún na nGall, meaning 'fort of the foreigners') in the south of the county. It has also been known as County Tyrconnell (Tír Chonaill, meaning 'Land of Conall'), after the historic territory of the same name, on which it was based. Donegal County Council is the local council and Lifford the county town.\nThe population was 159,192 at the 2016 census.", "image": "Donegal.png"}, "Kilkenny": {"summary": "County Kilkenny (Irish: Contae Chill Chainnigh) is a county in Ireland. It is in the province of Leinster and is part of the South-East Region. It is named after the city of Kilkenny. Kilkenny County Council is the local authority for the county. As of the 2016 census the population of the county was 99,232. The county was based on the historic Gaelic kingdom of Ossory (Osraighe), which was co-terminus with the Diocese of Ossory.", "image": "Kilkenny.jpg"}, "Cork": {"summary": "County Cork (Irish: Contae Chorcaí) is a county in Ireland. It is the largest and southernmost county of Ireland, situated in the province of Munster and named after the city of Cork, Ireland's second-largest city. The Cork County Council is the local authority for the county. Its largest market towns are Mallow, Macroom, Midleton, and Skibbereen. In 2016, the county's population was 542,868, making it the third-most populous county in Ireland. Notable Corkonians include Michael Collins, Jack Lynch, and Sonia O'Sullivan.\nCork borders four other counties: Kerry to the west, Limerick to the north, Tipperary to the north-east and Waterford to the east. The county contains a section of the Golden Vale pastureland that stretches from Kanturk in the north to Allihies in the south. The south-west region, including West Cork, is one of Ireland's main tourist destinations, known for its rugged coast and megalithic monuments and as the starting point for the Wild Atlantic Way.\nThe county is known as the \"Rebel county\", a name given to them by King Henry VII of England for its support of a man claiming to be Richard, Duke of York in a futile attempt at a rebellion. The main third-level educator is University College Cork, founded in 1845, and with a current undergraduate population around 15,000. Significant local industry and employers include technology company Dell EMC, the European headquarters of Apple, and Dairygold, which own milk-processing factories in Mitchelstown and Mallow.", "image": "Cork.jpg"}, "Wexford": {"summary": "County Wexford (Irish: Contae Loch Garman) is a county in Ireland. It is in the province of Leinster and is part of the South-East Region. Named after the town of Wexford, it was based on the historic Gaelic territory of Hy Kinsella (Uí Ceinnsealaigh), whose capital was Ferns. Wexford County Council is the local authority for the county. The population of the county was 149,722 at the 2016 census.", "image": "Wexford.jpg"}, "Monaghan": {"summary": "County Monaghan (; Irish: Contae Mhuineacháin) is a county in Ireland. It is part of the Border Region and is in the province of Ulster. It is named after the town of Monaghan. Monaghan County Council is the local authority for the county. The population of the county was 61,386 according to the 2016 census.The county has existed since 1585, when the Mac Mathghamhna rulers of Airgíalla agreed to join the Kingdom of Ireland. Following the 20th-century Irish War of Independence and the signing of the Anglo-Irish Treaty, Monaghan was one of three Ulster counties to join the Irish Free State rather than Northern Ireland.", "image": "Monaghan.png"}, "Kildare": {"summary": "County Kildare (Irish: Contae Chill Dara) is a county in Ireland. It is located in the province of Leinster and is part of the Mid-East Region. It is named after the town of Kildare. Kildare County Council is the local authority for the county which has a population of 222,504.", "image": "Kildare.png"}, "Leitrim": {"summary": "County Leitrim ( LEE-trəm; Irish: Contae Liatroma) is a county in the Republic of Ireland. It is in the province of Connacht and is part of the Border Region. It is named after the village of Leitrim. Leitrim County Council is the local authority for the county, which had a population of 32,044 according to the 2016 census. The county encompasses the historic Gaelic territory of West Breffny (Bréifne) corresponding to the northern part of the county, and Muintir Eolais or Conmaicne Réin, corresponding to the southern part.", "image": "Leitrim.png"}, "Sligo": {"summary": "County Sligo ( SLY-goh, Irish: Contae Shligigh) is a county in Ireland. It is located in the Border Region and is part of the province of Connacht. Sligo is the administrative capital and largest town in the county. Sligo County Council is the local authority for the county. The population of the county was 65,535 at the 2016 census. It is noted for Benbulben Mountain, one of Ireland's most distinctive natural landmarks.", "image": "Sligo.png"}, "Louth": {"summary": "County Louth ( Irish: Contae Lú) is a county in the Republic of Ireland. It is in the province of Leinster and is part of the Mid-East Region. It is named after the village of Louth. Louth County Council is the local authority for the county. According to the 2016 census, the population of the county was 128,884.", "image": "Louth.png"}, "Laois": {"summary": "County Laois ( LEESH; Irish: Contae Laoise) is a county in Ireland. It is located in the south of the Midlands Region and is also located in the province of Leinster, and was formerly known as \"Queen's County.\" The modern county takes its name from Loígis, a medieval kingdom. It has also been known as County Leix.\nLaois County Council is the local authority for the county. At the 2016 census, the population of the county was 84,697, an increase of 26% since the 2006 census.", "image": "Laois.png"}, "Tipperary": {"summary": "County Tipperary (Irish: Contae Thiobraid Árann) is a county in Ireland. It is located in the province of Munster. The county is named after the town of Tipperary, and was established in the early thirteenth century, shortly after the Norman invasion of Ireland. The population of the county was 159,553 at the 2016 census. The largest towns are Clonmel, Nenagh and Thurles.\nTipperary County Council is the local government authority for the county. Between 1838 and 2014, County Tipperary was divided into two ridings/counties, North Tipperary and South Tipperary, which were unified under the Local Government Reform Act 2014, which came into effect following the 2014 local elections on 3 June 2014.", "image": "Tipperary.png"}, "Westmeath": {"summary": "County Westmeath (; Irish: Contae na hIarmhí or simply An Iarmhí) is a county in Ireland. It is in the province of Leinster and is part of the Midlands Region. It originally formed part of the historic Kingdom of Meath (Midhe 'middle'). It was named Mide because the kingdom was located in the geographical centre of Ireland (the word Mide meant 'middle'). Westmeath County Council is the administrative body for the county, and the county town is Mullingar. At the 2016 census, the population of the county was 88,770.", "image": "Westmeath.png"}, "Roscommon": {"summary": "County Roscommon (Irish: Contae Ros Comáin) is a county in Ireland. In the western region, it is part of the province of Connacht. It is the 11th largest Irish county by area and 27th most populous. Its county town and largest town is Roscommon. Roscommon County Council is the local authority for the county. The population of the county was 64,544 at to the 2016 census.", "image": "Roscommon.png"}, "Wicklow": {"summary": "County Wicklow ( WIK-loh; Irish: Contae Chill Mhantáin [ˈkɔnˠt̪ˠeː ˈçɪl̠ʲ ˈwanˠt̪ˠaːnʲ]) is a county in Ireland.  The last of the traditional 32 counties to be formed, as late as 1606, it is part of the  Mid-East Region and also part of the traditional province of Leinster. It is named after the town of Wicklow, which derives from the Old Norse name Víkingaló,  meaning \"Vikings' Meadow\". Wicklow County Council is the local authority for the county. The county had a population of 142,425 at the 2016 census.\nWicklow, colloquially known as \"the Garden of Ireland\", is the 17th-largest of Ireland's 32 counties by area and 16th-largest by population. It is the fourth-largest of Leinster's twelve counties by size and the fifth-largest in terms of population. The adjoining counties are  Wexford to the south,  Carlow to the south-west,  Kildare to the west and  Dublin to the north.", "image": "Wicklow.png"}, "Mayo": {"summary": "County Mayo (Irish: Contae Mhaigh Eo, meaning \"Plain of the yew trees\") is a county in Ireland. In the West of Ireland, in the province of Connacht, it is named after the village of Mayo, now generally known as Mayo Abbey. Mayo County Council is the local authority. The population was 130,507 at the 2016 census. The boundaries of the county, which was formed in 1585, reflect the Mac William Íochtar lordship at that time.", "image": "Mayo.png"}, "Offaly": {"summary": "County Offaly (; Irish: Contae Uíbh Fhailí) is a county in Ireland. It is part of the Midlands Region and is also located in the province of Leinster. It is named after the ancient Kingdom of Uí Failghe and was formerly known as King's County. Offaly County Council is the local authority for the county. The county population was 77,961 at the 2016 census.", "image": "Offaly.png"}, "Meath": {"summary": "County Meath (; Irish: Contae na Mí or simply an Mhí) is a county in Ireland. It is in the province of Leinster and is part of the Mid-East Region. It is named after the historic Kingdom of Meath (from Midhe meaning \"middle\" or \"centre\"). Meath County Council is the local authority for the county. At the 2016 census, the population of the county was 195,044. The county town of Meath is Navan. Other towns in the county include Trim, Kells, Laytown, Ashbourne, Dunboyne, and Slane.\nIt is one of only two counties outside the west of Ireland to have an official Gaeltacht (the other being County Waterford, which has the Gaeltacht Ring) and the only county in Leinster to have an official Gaeltacht.", "image": "Meath.png"}}, "PostCode": {"Dublin 1": {"summary": "Dublin 1 includes most of the north inner city, including Abbey Street, Amiens Street, Capel Street, Dorset Street, Henry Street and Mary Street, Mountjoy Square, Marlborough Street, North Wall, O'Connell Street, Parnell Square, and Talbot Street. This area include the General Post Office, from which distances are measured.", "image": "Dublin.jpg"}, "Dublin 2": {"summary": "Dublin 2 encompasses most of the city centre south of the River Liffey and takes in areas around Merrion Square, Trinity College, Temple Bar, Grafton Street, St Stephen's Green, Dame Street, and Leeson Street. Dublin 2 is the location of a number of government departments and addresses such as Leinster House, Government Buildings, and the Mansion House. The borders of Dublin 2 are the Liffey in the north, the Grand Canal to the south and east and Aungier, Wexford and Camden Streets to the west.", "image": "Dublin.jpg"}, "Dublin 3": {"summary": "Dublin 3 encompasses areas such as Ballybough, North Strand, Clonliffe, Clontarf, Dollymount, East Wall (including East Point), Fairview, most of Killester, and Marino.", "image": "Dublin.jpg"}, "Dublin 4": {"summary": "Dublin 4 includes Ballsbridge, Belfield, Donnybrook, Irishtown, Merrion, Pembroke, Ringsend and Sandymount and contains the RDS grounds, Lansdowne Road stadium, and many embassies.  \"D4\" has acquired its own socio-economic identity.", "image": "Dublin.jpg"}, "Dublin 5": {"summary": "Dublin 5 includes most of Artane, central Coolock, Harmonstown, Kilbarrack, and Raheny.", "image": "Dublin.jpg"}, "Dublin 6": {"summary": "Dublin 6 includes Milltown, Ranelagh, parts of Terenure, Rathmines (including Dartry), and Rathgar.", "image": "Dublin.jpg"}, "Dublin 6W": {"summary": "Dublin 6W includes Harold's Cross, Templeogue, Kimmage and Terenure.", "image": "Dublin.jpg"}, "Dublin 7": {"summary": "Dublin 7 includes Arbour Hill, some parts of Ashtown, Broadstone, Cabra, Grangegorman, Oxmantown, Phibsboro, Smithfield, Stoneybatter.", "image": "Dublin.jpg"}, "Dublin 8": {"summary": "Dublin 8 includes Dolphin's Barn, Inchicore, Islandbridge, Kilmainham, Merchants Quay, Portobello, South Circular Road, the Phoenix Park and the Liberties. Notable buildings include Christchurch Cathedral and St. Patrick's Cathedral. It is one of only two postal districts to span the Liffey.", "image": "Dublin.jpg"}, "Dublin 9": {"summary": "Dublin 9 includes parts of Ballymun east of Ballymun Road (Shangan and Coultry), Beaumont, Donnycarney, Drumcondra, Elm Mount, Griffith Avenue, parts of Glasnevin (St Mobhi, Botanic Gardens and Met Éireann), Santry, and Whitehall.", "image": "Dublin.jpg"}, "Dublin 10": {"summary": "Dublin 10 includes Ballyfermot and Cherry Orchard.", "image": "Dublin.jpg"}, "Dublin 11": {"summary": "Dublin 11 includes most of Ballymun west of Ballymun Road (Sillogue, Balcurris, Balbutcher, Poppintree, Sandyhill and Wadelai), Dubber Cross, Finglas (including Ballygall and Cappagh), most of Glasnevin (Cremore, Addison, Violet Hill, Finglas Road, Old Finglas Road and Glasnevin Cemetery), Kilshane Cross, The Ward and Coolquay.", "image": "Dublin.jpg"}, "Dublin 12": {"summary": "Dublin 12 includes Bluebell, Crumlin, Drimnagh, Greenhills, Perrystown and Walkinstown.", "image": "Dublin.jpg"}, "Dublin 13": {"summary": "Dublin 13 Baldoyle, Bayside, Donaghmede, Clongriffin, Sutton, Howth and Ayrfield.", "image": "Dublin.jpg"}, "Dublin 14": {"summary": "Dublin 14 includes Churchtown, Clonskeagh, most of Dundrum, Goatstown, parts of Rathfarnham and Windy Arbour.", "image": "Dublin.jpg"}, "Dublin 15": {"summary": "Dublin 15 includes, Ashtown, Blanchardstown, Castleknock, Coolmine, Clonsilla, Corduff, Mulhuddart, Tyrrelstown and the Dublin part of Clonee, as well as Ongar.", "image": "Dublin.jpg"}, "Dublin 16": {"summary": "Dublin 16 includes Ballinteer, Ballyboden, parts of Dundrum, Kilmashogue, Knocklyon, parts of Rathfarnham and Rockbrook.", "image": "Dublin.jpg"}, "Dublin 17": {"summary": "Dublin 17 includes Balgriffin, most of Coolock, and Belcamp, Darndale and Priorswood.", "image": "Dublin.jpg"}, "Dublin 18": {"summary": "Dublin 18 includes Cabinteely, Carrickmines, Foxrock, Kilternan, Sandyford, Shankill, Ticknock, Ballyedmonduff, Stepaside, and Leopardstown.", "image": "Dublin.jpg"}, "Dublin 20": {"summary": "Dublin 20 includes Chapelizod, and Palmerstown. This is one of only two postal districts to span the Liffey.", "image": "Dublin.jpg"}, "Dublin 22": {"summary": "Dublin 22 includes Clondalkin, Rowlagh, Quarryvale and Liffey Valley, and Neilstown.", "image": "Dublin.jpg"}, "Dublin 24": {"summary": "Dublin 24 includes Firhouse, Jobstown, Old Bawn and Tallaght.", "image": "Dublin.jpg"}}, "Town": {"Tullow": {"summary": "Tullow  (Irish: An Tulach, meaning 'The Mound', formerly Tulach Ó bhFéidhlim) is a market town in County Carlow, Ireland. It is located on the River Slaney where the N81 road intersects with the R725.", "image": "Tullow.JPG"}, "Graiguecullen": {"summary": "County Carlow (Irish: Contae Cheatharlach)  is a county in Ireland, part of the South-East Region and the province of Leinster. It is named after the town of Carlow, which lies on the River Barrow. Carlow County Council is the local authority. The population was 56,932 at the 2016 census.", "image": "Graiguecullen.png"}, "Virginia": {"summary": "Virginia (Irish: Achadh an Iúir, meaning 'field of the yew') is a town in County Cavan, Ireland. Founded in the 17th century as a plantation town, it now holds both local industry and commuter housing.", "image": "Virginia.jpg"}, "Bailieborough": {"summary": "Bailieborough or Bailieboro (Irish: Coill an Chollaigh, meaning 'the wood of the boar') is a town in County Cavan,  Ireland. As of 2016, its population was 2,683. Bailieborough's proximity to the M3 motorway has made it a commuter town.", "image": "Bailieborough.jpg"}, "Kingscourt": {"summary": "Kingscourt, historically known as Dunaree (Irish: Dún an Rí, meaning 'fort of the king'), is a town in County Cavan, Ireland. It is located near the Cavan–Meath border. The town was founded near the site of the old village of Cabra, by Mervyn Pratt, towards the end of the 18th century, and was completed by his brother, The Rev. Joseph Pratt.", "image": "Kingscourt.jpg"}, "Belturbet": {"summary": "Belturbet (Irish: Béal Tairbirt, meaning 'mouth of the isthmus') is a town in County Cavan, Ireland. It lies on the N3 road, around 14 km (8.7 mi) north of Cavan town and 123 km (76 mi) from Dublin. It is also located around 4 km (2.5 mi) south of the border with Northern Ireland, between the counties of Cavan and Fermanagh, and 36 km (22 mi) from Enniskillen.", "image": "Belturbet.jpg"}, "Ballyjamesduff": {"summary": "Ballyjamesduff (Irish: Baile Shéamais Dhuibh) is a town in County Cavan, Ireland. A former market town, it was the winner of the 1966 and 1967 Irish Tidy Towns Competition.", "image": "Ballyjamesduff.jpg"}, "Ballyconnell": {"summary": "Ballyconnell (Irish: Béal Átha Conaill, meaning 'Entrance to the Ford of Conall') is a town in County Cavan, Ireland. It is situated on the N87 national secondary road at the junction of four townlands Annagh, Cullyleenan, Doon (Tomregan) and Derryginny in the parish of Tomregan, Barony of Tullyhaw. Ballyconnell won the Irish Tidy Towns Competition in 1971 and was also winner in 1975.The town lies astride the Shannon–Erne Waterway which was re-opened in 1993, formerly known as the Woodford Canal which was finally completed in 1860. Prior to being canalised it was known as the River Grainne. The population of Ballyconnell, according to the 2016 Census, was 1,105 persons, an increase of 4% on the previous 2011 census.", "image": "Ballyconnell.JPG"}, "Cootehill": {"summary": "Cootehill (; Irish: Muinchille, meaning 'ridge') is a market town and townland in County Cavan, Ireland. Cootehill was formerly part of the neighbouring townland of Munnilly.  Both townlands lie within the barony of Tullygarvey.The English language name of the town is a portmanteau of \"Coote\" and \"Hill\", the family names of a local 18th century landowning family.", "image": "Cootehill.jpg"}, "Shannon": {"summary": "Shannon (Irish: Sionainn) or Shannon Town (Baile na Sionnainne), named after the river near which it stands, is a town in County Clare, Ireland. It was given town status on 1 January 1982. The town is located just off the N19 road, a spur of the N18/M18 road between Limerick and Ennis. It is the location of Shannon Airport, an international airport serving the Clare/Limerick region in the west of Ireland.", "image": "Shannon.jpg"}, "Ballintemple": {"summary": "Ballintemple (Irish: Baile an Teampaill, meaning 'the town of the church') is a suburb of Cork city, Ireland. The village is situated on the east side of the city with its limits extending to the River Lee and the village of Blackrock further to the east. Originally, Ballintemple was a separate village but today it has been enclosed by the city.", "image": "Ballintemple.jpg"}, "Sixmilebridge": {"summary": "Sixmilebridge (Irish: Droichead Abhann Uí gCearnaigh, meaning 'Bridge of the River of O'Kearney'), colloquially The Bridge, is a small town in County Clare, Ireland. Located midway between Ennis and Limerick city, the town is a short distance away from the main N18 road, being located on the old \"back road\" between the two. The village of Kilmurry (Irish: Cill Mhuire) is also part of the Sixmilebridge parish.\nSixmilebridge partly serves as a dormitory town for workers in the Limerick city, Ennis and Shannon region, with a number of modern housing developments having been built to accommodate demand.", "image": "Sixmilebridge.jpg"}, "Carrigtwohill": {"summary": "Carrigtwohill, officially Carrigtohill  (Irish: Carraig Thuathail, meaning 'Tuathal's rock'), is a town in County Cork, Ireland with a population of 5,080 (2016). It is 12 kilometres east of Cork city. It is connected to Cork Suburban Rail and is bypassed by the N25 road. Carrigtwohill is one of the fastest growing towns in the region, and a hub for pharmaceutical and biotechnology companies.", "image": "Carrigtwohill.jpg"}, "Blackrock (Cork)": {"summary": "Blackrock is a village and suburb contained within Cork City, Ireland. Originally a small fishing village about five kilometres from Cork City, the growth of the city has meant the village became incorporated into the city. The village is home to Blackrock GAA club, Blackrock Castle, a weekly farmers market, and as of 2015 has seen some investment in regeneration projects for the village centre.", "image": "Blackrock (Cork).jpg"}, "Blackpool": {"summary": "Blackpool (Irish: An Linn Dubh) is a suburb of Cork city in County Cork, Ireland. It is situated in the north of the city, on the N20 road to Mallow.", "image": "Blackpool.jpg"}, "Killaloe": {"summary": "Killaloe ( kil-ə-LOO; Irish: Cill Dalua meaning Lua's church) is a large village in east County Clare, Ireland. The village lies on the River Shannon on the western bank of Lough Derg and is connected by Killaloe Bridge to the \"twin town\" of Ballina on the eastern bank of the lake.\nThe Killaloe Electoral Area is one of six such areas in County Clare and returns four members to Clare County Council.\nKillaloe is at the center of the Killaloe Civil parish.", "image": "Killaloe.jpg"}, "Blarney": {"summary": "Blarney (Irish: an Bhlarna, meaning 'the little field') is a town and townland approximately 8 km (5.0 mi) north-west of Cork city in Ireland. It is the site of Blarney Castle, home of the legendary Blarney Stone. Originally administered by Cork County Council, following the 2019 Cork boundary change, Blarney is within the administrative area of Cork City Council.", "image": "Blarney.jpg"}, "Clonakilty": {"summary": "Clonakilty (; Irish: Cloich na Coillte, Clanna Chaoilte), sometimes shortened to Clon, is a town in County Cork, Ireland.  The town is located at the head of the tidal Clonakilty Bay. The rural hinterland is used mainly for dairy farming. The town's population as of 2016 was 4,592. The town is a tourism hub in West Cork, and was recognised as the \"Best Town in Europe\" in 2017, and \"Best Place of the Year\" in 2017 by the Royal Institute of the Architects of Ireland. Clonakilty is in the Cork South-West (Dáil Éireann) constituency, which has three seats.", "image": "Clonakilty.jpg"}, "Bandon": {"summary": "Bandon (; Irish: Droichead na Bandan) is a town in County Cork, Ireland. It lies on the River Bandon between two hills. The name in Irish means Bridge of the Bandon, a reference to the origin of the town as a crossing-point on the river. In 2004 Bandon celebrated its quatercentenary. The town, sometimes called the Gateway to West Cork, had a population of 6,957 at the 2016 census. Bandon is in the Cork South-West (Dáil Éireann) constituency, which has three seats.", "image": "Bandon.jpg"}, "Castlemartyr": {"summary": "Castlemartyr (Irish: Baile na Martra, formerly anglicised as Ballymarter or Ballymartyr) is a village in East Cork, County Cork, Ireland. It is located 25 minutes east of Cork city, 10 km (6 mi) east of Midleton, 16 km (10 mi) west of Youghal and 6 km (4 mi) from the coast. Approximately 1,600 people live in the village and its hinterland. It is situated on the N25 national primary road.\nIt is home to a number of community and sporting organisations, a 15th century tower house (Castlemartyr Castle, now a ruin), and an 18th century country house (Castlemartyr House, now a hotel).", "image": "Castlemartyr.jpg"}, "Ennis": {"summary": "Ennis (Irish: Inis, meaning 'island') is the county town of County Clare, Ireland. The Irish name is short for Inis Cluana Rámhfhada (\"island of the long rowing meadow\"). The town is on the River Fergus, north of where it enters the Shannon Estuary, 19 km (12 mi) from Shannon Airport.  In 2016, Ennis had a population of 25,276, making it the largest town in Clare and the 12th largest in Ireland.", "image": "Ennis.jpg"}, "Newmarket On Fergus": {"summary": "Newmarket-on-Fergus, historically known as Corracatlin (Irish: Cora Chaitlín, meaning 'Caitlín's weir'), is a town in County Clare, Ireland. It is 13 kilometres from Ennis, 8 kilometres from Shannon Airport, and 24 kilometres from Limerick.", "image": "Newmarket On Fergus.jpg"}, "Fermoy": {"summary": "Fermoy (Irish: Mainistir Fhear Maí, meaning 'monastery of the Men of the Plain') is a town on the River Blackwater in east County Cork, Ireland. As of the 2016 census, the town and environs had a population of approximately 6,500 people. It is located in the barony of Fermoy.\nThe town's name comes from the Irish and refers to a Cistercian abbey founded in the 13th century.", "image": "Fermoy.JPG"}, "Carrigaline": {"summary": "Carrigaline (Irish: Carraig Uí Leighin, meaning 'rock of Ó Leighin') is a town and civil parish in County Cork, Ireland, situated on the River Owenabue. It is about 14 kilometres (8.7 mi) south of Cork city on the R611 regional road, which passes through the town, and just off the N28 national primary route to Ringaskiddy. Carrigaline grew rapidly in the late 20th century, from a village of a few hundred people into a thriving commuter town, although many locals still refer to it as \"the village\". The town is one of the key gateways to west Cork, especially for those who arrive by ferry from France.", "image": "Carrigaline.jpg"}, "Kilrush": {"summary": "Kilrush (Irish: Cill Rois, meaning 'Church of the Woods') is a coastal town in County Clare, Ireland. It is also the name of a civil parish and an ecclesiastical parish in Roman Catholic Diocese of Killaloe. It is located near the mouth of the River Shannon in the south-west of the county. Kilrush is one of the listed Heritage Towns of Ireland. The area was officially classified as part of the West Clare Gaeltacht, an Irish-speaking community, until 1956.", "image": "Kilrush.jpg"}, "Bantry": {"summary": "Bantry (Irish: Beanntraí, meaning '(place of) Beann's people') is a town in the civil parish of Kilmocomoge in the barony of Bantry on the coast of West Cork, County Cork, Ireland. It lies at the head of Bantry Bay, a deep-water gulf extending for 30 km (19 mi) to the west. The Beara Peninsula is to the northwest, with Sheep's Head peninsula to the southwest.\nThe focus of the town is a large square, formed partly by infilling of the shallow inner harbour. In former times, this accommodated regular cattle fairs; after modernising as an urban plaza, it now features a weekly market and occasional public functions. Two piers protect the harbour.\nBantry is in the Cork South-West Dáil constituency, which elects three members of Dáil Éireann (the national parliament).", "image": "Bantry.jpg"}, "Ballincollig": {"summary": "homom is the leader of the oqg mandem and is a massive threat to the ballincollig society\n\nBallincollig (Irish: Baile an Chollaigh) is a suburban town within the administrative area of Cork city in Ireland. It is located on the western side of Cork city, beside the River Lee on the R608 regional road. In 2016 it was the largest town in County Cork, at which time the Ballincollig Electoral Division had a population of 18,621 people. The nearest towns include Ballinora, Carrigrohane, Kilnaglory, Ovens, Killumney, Inniscarra, Blarney, and Tower. It is located beyond the green belt from the suburbs of Bishopstown and Wilton.", "image": "Ballincollig.JPG"}, "Dunmanway": {"summary": "Dunmanway (Irish: Dúnmaonmhuí, official Irish name: Dún Mánmhaí) is a market town in County Cork, in the southwest of Ireland. It is the geographical centre of the region known as West Cork. It is the birthplace of Sam Maguire, an Irish Protestant republican, for whom the trophy of the All-Ireland Senior Football Championship is named.\nThere is disagreement over the meaning and origin of the town's name.  Various sources list its meaning when translated from Irish as \"the castle of the yellow river,\" \"the castle on the little plain,\" \"the fort of the gables (or pinnacles),\" and \"the fort of the yellow women.\" The town centre is built on and around two rivers, each of which are tributaries of the larger River Bandon, which passes by at the east end of the town.\nThe town is twinned with Quéven, France. Dunmanway won the Irish Tidy Towns Competition in 1982. More recently, the town came to national and international attention thanks to a visit by Liverpool Football Club for a pre-season soccer friendly.\nThe population of Dunmanway and its environs at the 2011 census was 1,585, rising to 1,655 by the 2016 census.", "image": "Dunmanway.JPG"}, "Rochestown": {"summary": "Rochestown is a primarily residential area in Cork City, Ireland. Originally a somewhat rural area in County Cork, housing developments in the 20th and 21st centuries have connected the area to Douglas and nearby suburbs. The area was incorporated into Cork City following the 2019 Cork boundary change on 31 May 2019, along with the surrounding areas of Douglas, Grange and Frankfield. A trunk road passes through the area, linking Rochestown and other villages in lower Cork Harbour, to Cork city centre. Rochestown Road also links Douglas with the N40 South Ring Road.", "image": "Rochestown.jpg"}, "Douglas": {"summary": "Douglas (Irish: Dúglas or Dúbhglas, meaning 'dark stream') is a village and suburb contained within Cork city, Ireland and the name given to the Roman Catholic, Church of Ireland and Civil parish in which it is contained. Originally a village, the growth of both the village and the city has meant Douglas has become incorporated into the city over time. The 2017 Mackinnon Report proposed that Douglas and surrounding residential areas be moved to within an extended Cork city boundary, ending the division of Douglas between the city and county administrative areas. This was approved by the Cabinet on 6 June 2018, with Douglas and surrounding areas Rochestown, Grange and Frankfield to move into the city council area following the 2019 local elections. This change occurred on 31 May 2019, ending the divide between the separated halves of Douglas.", "image": "Douglas.jpg"}, "Montenotte": {"summary": "Montenotte is an area in the north-east of Cork City, Ireland, which had an influx of wealthier merchants and a  prosperous middle classes in the early to mid-19th century. It was named after the late 18th century Napoleonic battle, the Battle of Montenotte, which took place in Northern Italy.Situated on a hill facing south over the River Lee, Montenotte acquired several substantial residences, some of them set in miniature estates with terraced gardens. Many of the larger houses now have institutional uses, or have been divided into apartments.The suburb comprises two electoral districts (Montenotte A and Montenotte B) within the Cork North-Central constituency of the Irish Dáil. As of 2002, the respective populations were 1,853 and 2,723.", "image": "Montenotte.jpg"}, "Cobh": {"summary": "Cobh ( KOHV,  Irish: An Cóbh), known from 1849 until 1920 as Queenstown, is a tourist seaport town on the south coast of County Cork, Ireland. Cobh is on the south side of Great Island in Cork Harbour and is home to Ireland's only dedicated cruise terminal. Tourism in the area draws on the maritime and emigration legacy of the town. It was associated with the RMS Titanic, which was built in Belfast.\nFacing the town are Spike Island and Haulbowline Island. On a high point in the town stands the cathedral church of the diocese of Cloyne, St Colman's, which is one of the tallest buildings in Ireland.", "image": "Cobh.jpg"}, "Macroom": {"summary": "Macroom (; Irish: Maigh Chromtha) is a market town in County Cork, Ireland which formed in the valley of the River Sullane, about halfway between Cork city and Killarney. Its Irish Gaelic may translate as \"meeting place of followers of the god Crom\" or \"crooked oak\", the latter a reference to a large oak tree that apparently grew in the town-square during the reign of the English King John. Its population has grown and receded over the centuries as it went through periods of war, famine and workhouses, forced emigration and intermittent prosperity. The 2016 census recorded an urban population of 3,765 people.\n\nMacroom began as a meeting place for the Druids of Munster. It is first mentioned is in 6th-century records, and the immediate area hosted a major battle c. 987 involving the Irish king Brian Boru. During the middle ages, the town was invaded by a succession of warring clans, including the Murcheatach Uí Briain and Richard de Cogan families. In the early modern period the MacCarthy's took control and later the area found prosperity via milling. The MacCarthys built a series of tower houses, many of which survive. The family lost influence during the Williamite wars of the 1690s, after which authority over the town castle waxed and waned between the MacCarthys and a number of ambitious English families. In the 17th century, Macroom became a central point of conflict in the Cromwellian conquest of Ireland.\nThe population fell in the 1840s during the Great Irish Famine. Evidence can be found in the former workhouse, now the district hospital at the north side of New Street, and the mass graveyard to the west, near Clondrohid. During the late 18th and early 19th century a number of Anglo-Irish families, and a branch of the Massey family, settled in the area; but many of their estate houses were burned by rebels during and after the Irish War of Independence as the town was caught the turmoil of IRA activity.\nFrom 1976 to 1982 Macroom hosted the Mountain Dew Rock festival, with lineups that included Rory Gallagher, Thin Lizzy and Van Morrison, attended by Sex Pistol John Lydon. \nToday the town is an economic hub for the mid west Cork region, and location a major Danone milk processing factory, which dries and cans Infant formula from milk supplied by local dairy farmers. Until the 1950s New Street was the town's economic hub, and contained many small retail outlets. In September 2019 Macroom was designated a rent pressure zone.", "image": "Macroom.JPG"}, "Charleville": {"summary": "Charleville (Irish: Ráth Luirc or An Ráth) is a town in north County Cork, Ireland. It lies in the Golden Vale, on a tributary of the River Maigue, near the border with County Limerick. Charleville is on the N20 road and is the second-largest town between Limerick and Cork (Mallow is the largest). The Roman Catholic parish of Charleville is within the Diocese of Cloyne. Significant industries in the town include Kerry Co-Op and the construction and services sectors.", "image": "Charleville.jpg"}, "Ballinure": {"summary": "County Cork (Irish: Contae Chorcaí) is a county in Ireland. It is the largest and southernmost county of Ireland, situated in the province of Munster and named after the city of Cork, Ireland's second-largest city. The Cork County Council is the local authority for the county. Its largest market towns are Mallow, Macroom, Midleton, and Skibbereen. In 2016, the county's population was 542,868, making it the third-most populous county in Ireland. Notable Corkonians include Michael Collins, Jack Lynch, and Sonia O'Sullivan.\nCork borders four other counties: Kerry to the west, Limerick to the north, Tipperary to the north-east and Waterford to the east. The county contains a section of the Golden Vale pastureland that stretches from Kanturk in the north to Allihies in the south. The south-west region, including West Cork, is one of Ireland's main tourist destinations, known for its rugged coast and megalithic monuments and as the starting point for the Wild Atlantic Way.\nThe county is known as the \"Rebel county\", a name given to them by King Henry VII of England for its support of a man claiming to be Richard, Duke of York in a futile attempt at a rebellion. The main third-level educator is University College Cork, founded in 1845, and with a current undergraduate population around 15,000. Significant local industry and employers include technology company Dell EMC, the European headquarters of Apple, and Dairygold, which own milk-processing factories in Mitchelstown and Mallow.", "image": "Ballinure.png"}, "Bishopstown": {"summary": "Bishopstown (Irish: Baile an Easpaig, meaning 'town of the Bishop') is located in the civil parish of St. Finbar's, Barony of Cork, County Cork, Ireland. It is a southwestern suburb of Cork and is made-up of the townlands of Ballineaspigbeg and Ballineaspigmore (sometimes spelled Ballinaspigmore). It is near the city of Ballincollig, a satellite of Cork City, and is home to a number of schools and colleges, \nThough it is sometimes suggested that the name of the area derives from an early 18th-century bishop who built his country residence there, the name can be reputedly traced back further and found in sources dating to the 16th century.", "image": "Bishopstown.jpg"}, "Glanmire": {"summary": "Glanmire (Irish: Gleann Maghair) is a town nine kilometres outside Cork, in the civil parish of Rathcooney, County Cork, Ireland.The greater Glanmire area encompasses the communities of Riverstown (Baile Roisín), Brooklodge (Cill Ruadháin) and Sallybrook (Áth na Sailí).", "image": "Glanmire.JPG"}, "Crosshaven": {"summary": "Crosshaven (Irish: Bun an Tábhairne) is a village in County Cork, Ireland. It is located in lower Cork Harbour at the mouth of the River Owenabue, across from Currabinny Wood. Originally a fishing village, from the 19th century, the economy of the area became more reliant on a growing tourism industry.", "image": "Crosshaven.jpg"}, "Kanturk": {"summary": "Kanturk (Irish: Ceann Toirc, meaning 'Boar's Head' - also the town's emblem) is a town in the north west of County Cork, Ireland. Kanturk is situated at the confluence of the rivers Allow and Dallow (also Dalua), streaming further on as tributaries into the Blackwater. It is about 50 kilometres (31 miles) from Cork, Blarney and Limerick, and lies just north of the main N72 road, 15 km (9 miles) from Mallow and about 40 km (25 miles) from Killarney.\nApart from its creamery which produced casein from milk, a raw material for early plastics, its former knitwear facility now produces concrete flooring products. The town's schools include Coláiste Treasa and Scoil Mhuire.", "image": "Kanturk.jpg"}, "Kinsale": {"summary": "Kinsale (; Irish: Cionn tSáile, meaning 'Tide Head') is a historic port and fishing town in County Cork, Ireland, which also has significant military history. Located approximately 25 km (16 mi) south of Cork City on the southeast coast near the Old Head of Kinsale, it is located at the mouth of the River Bandon. Its population was 5,281 at the 2016 census. Its population increases during the summer months, when the tourist season is at its peak and the boating fraternity and other tourist visitors arrive in numbers. Kinsale is in the Cork South-West (Dáil Éireann) constituency, which has three seats.\nKinsale is a holiday destination for both Irish and overseas tourists. \nLeisure activities include yachting, sea angling, and golf. The town also has several art galleries, and there is a large yachting marina close to the town centre.\nThe town is known for its restaurants, including the Michelin-starred Bastion restaurant, and holds a number of annual gourmet food festivals.Historical buildings in the town include St. Multose's Church (Church of Ireland) of 1190, St. John the Baptist (Catholic) of 1839, the Market House of c. 1600, and the so-called French Prison (or Desmond Castle, associated with the Earls of Desmond) of c. 1500. Charles Fort, a partly restored star fort of 1677, is in nearby Summercove.", "image": "Kinsale.jpg"}, "Midleton": {"summary": "Midleton (; Irish: Mainistir na Corann, meaning \"monastery at the weir\") is a town in south-eastern County Cork, Ireland. It lies some 16 km east of Cork City on the Owenacurra River and the N25 road, which connects Cork to the port of Rosslare. A satellite town of Cork City, Midleton is part of Metropolitan Cork. It is the central hub of business for the East Cork Area.", "image": "Midleton.jpg"}, "Passage West": {"summary": "Passage West  (locally known as \"Passage\") (Irish: An Pasáiste Thiar) is a port town in County Cork, Ireland, situated on the west bank of Cork Harbour, some 10 km south east of Cork city. The town has many services, amenities and social outlets. Passage West was designated a conservation area in the 2003 Cork County Development Plan.", "image": "Passage West.jpg"}, "Mitchelstown": {"summary": "Mitchelstown (Irish: Baile Mhistéala) is a town in County Cork, Ireland with a population of approximately 3740. Mitchelstown is situated in the valley to the south of the Galtee Mountains, 12 km south-west of the Mitchelstown Caves, 28 km from Cahir, 50 km from Cork, 59 km from Limerick and 10 km from Fermoy.  The River Gradoge runs by the town into the River Funshion, which in turn is a tributary of the River Blackwater.\nThe town is best known as a centre for cheese production.", "image": "Mitchelstown.jpg"}, "Mallow": {"summary": "Mallow (; Irish: Mala or Magh Eala) is a town in County Cork, Ireland, approximately thirty-five kilometres north of Cork. Mallow is in the barony of Fermoy.\nIt is the administrative centre of north County Cork and has been nicknamed the \"Crossroads of Munster\". The Northern Divisional Offices of Cork County Council are located in the town.", "image": "Mallow.jpg"}, "Cloyne": {"summary": "Cloyne (Irish: Cluain) is a small town to the southeast of Midleton in eastern County Cork. It is also a see city of the Anglican (Church of Ireland) Diocese of Cork, Cloyne and Ross, while also giving its name to a Roman Catholic diocese. St Colman's Cathedral in Cloyne is a cathedral church of the Church of Ireland while the Pro Cathedral of the Roman Catholic Diocese of Cloyne, Cobh Cathedral of Saint Colman, overlooks Cork Harbour.", "image": "Cloyne.jpg"}, "Skibbereen": {"summary": "Skibbereen (; Irish: An Sciobairín) is a town in County Cork, Ireland. It is located in West Cork on the N71 national secondary road. The name \"Skibbereen\" (sometimes shortened to \"Skibb\") means \"little boat harbour\". The River Ilen runs through the town; it reaches the sea about 12 kilometers away, at the seaside village of Baltimore. As of the Census of Ireland 2011, the population of the town (not including the rural hinterland) was 2,568. Skibbereen is in the Cork South-West (Dáil Éireann) constituency, which has three seats.", "image": "Skibbereen.jpg"}, "Rathcormac": {"summary": "Rathcormac (Irish: Ráth Chormaic, meaning 'Cormac's ringfort') is a small town in north County Cork, Ireland. Previously situated on the main Cork to Dublin road (the N8), it was bypassed in 2006 by the M8. The former N8 through Main St is now the R639 regional road.", "image": "Rathcormac.JPG"}, "Millstreet": {"summary": "Millstreet (Irish: Sráid an Mhuilinn) is a town in north County Cork, Ireland, with a population of 1,555 (as of 2016). The town hosted the Eurovision Song Contest 1993. \nMillstreet is within the Civil Parish of Drishane, and within a Poor Law Union also called Millstreet. The Millstreet Union encompasses the civil parishes of Drishane and Kilcorney.", "image": "Millstreet.jpg"}, "Frankfield": {"summary": "County Cork (Irish: Contae Chorcaí) is a county in Ireland. It is the largest and southernmost county of Ireland, situated in the province of Munster and named after the city of Cork, Ireland's second-largest city. The Cork County Council is the local authority for the county. Its largest market towns are Mallow, Macroom, Midleton, and Skibbereen. In 2016, the county's population was 542,868, making it the third-most populous county in Ireland. Notable Corkonians include Michael Collins, Jack Lynch, and Sonia O'Sullivan.\nCork borders four other counties: Kerry to the west, Limerick to the north, Tipperary to the north-east and Waterford to the east. The county contains a section of the Golden Vale pastureland that stretches from Kanturk in the north to Allihies in the south. The south-west region, including West Cork, is one of Ireland's main tourist destinations, known for its rugged coast and megalithic monuments and as the starting point for the Wild Atlantic Way.\nThe county is known as the \"Rebel county\", a name given to them by King Henry VII of England for its support of a man claiming to be Richard, Duke of York in a futile attempt at a rebellion. The main third-level educator is University College Cork, founded in 1845, and with a current undergraduate population around 15,000. Significant local industry and employers include technology company Dell EMC, the European headquarters of Apple, and Dairygold, which own milk-processing factories in Mitchelstown and Mallow.", "image": "Frankfield.png"}, "Wilton": {"summary": "Wilton is a suburb of Cork City. It is the site of Cork University Hospital, Cork's largest hospital. Other landmarks include Wilton Shopping Centre and St. Finbarr's Cemetery, which lies on the border between Wilton and Glasheen and is the resting place of some of Cork's most notable citizens.", "image": "Wilton.jpg"}, "Ringaskiddy": {"summary": "Ringaskiddy (Irish: Rinn an Scidígh, meaning 'Skiddy's Headland') is a village in County Cork, Ireland. It is located on the western side of Cork Harbour, south of Cobh, and is 15 kilometres from Cork city, to which it is connected by the N28 road. The village is a port with passenger ferry services to France. A ferry service to Swansea in Wales closed in 2012.During the 20th century, Ringaskiddy changed from a fishing village to a centre of transport and industrial activity. It is now one of the largest employment hubs in the pharmaceuticals sector in the region. The village is close to a number of tourist areas, including Crosshaven, Currabinny and Monkstown.", "image": "Ringaskiddy.jpg"}, "Tivoli": {"summary": "Tivoli is an eastern suburb of Cork city in  Ireland.\nTivoli is part of the Port of Cork. It provides container handling, facilities for oil, livestock and ore and a roll-on/roll-off (Ro-Ro) ferry ramp. It's a significant point of entry for imported motor vehicles. Tivoli is also a minor tourist area, and has a number of bed and breakfast establishments as well as the Silver Springs Hotel. The cedar trees, still growing in the area, are reputed to have been planted by Sir Walter Raleigh, who lived there briefly.", "image": "Tivoli.png"}, "Spencer Dock": {"summary": "Spencer Dock (Irish: Duga Spencer) is a location within North Wall, Dublin, Ireland. Occupants of Spencer Dock include the Convention Centre Dublin, PricewaterhouseCoopers' Irish headquarters, Nationwide Building Society, Credit Suisse and TMF Group.\nOffices of the Central Bank of Ireland and the NTMA are located in the nearby Dublin Landings development.", "image": "Spencer Dock.jpg"}, "Ballybofey": {"summary": "Ballybofey ( BAL-ee-bə-FAY, locally  BAL-bə-FAY; Irish: Bealach Féich, meaning 'Fiach's pass') is a town located on the south bank of the River Finn, County Donegal, Ireland. Together with the smaller town of Stranorlar on the north side of the River Finn, the towns form the Twin Towns of Ballybofey-Stranorlar. Ballybofey-Stranorlar, a census town, had a population of 4,852 in the 2016.The town grew rapidly in the 19th and 20th centuries. There are no schools or churches in the town of Ballybofey itself, with all these amenities lying either across the bridge in Stranorlar or outside the town limits. This is due to laws during plantation times when certain Catholic buildings were not allowed within a specified range of Protestant towns, in this case Stranorlar, though Stranorlar now has both a Roman Catholic and a Church of Ireland church.", "image": "Ballybofey.jpg"}, "Youghal": {"summary": "Youghal ( YAWL; Irish: Eochaill, meaning 'yew wood') is a seaside resort town in County Cork, Ireland. Sitting on the estuary of the River Blackwater, in the past it was militarily and economically important. Being built on the edge of a steep riverbank, the town has a long and narrow layout. As of the 2016 census, the population was 7,963.As a historic walled seaport town on the coastline of East Cork, and close to a number of beaches, it has been a tourist destination since the mid-19th century. There are a number of historic buildings and monuments within the town's walls, and Youghal is among a small number of towns designated as \"Irish Heritage Ports\" by the Irish Tourist Board.", "image": "Youghal.jpg"}, "Stranorlar": {"summary": "Stranorlar (Irish: Srath an Urláir, meaning the \"valley of the floor\" or flat bottomed valley) is a small town in the Finn Valley of County Donegal, in Ireland. Stranorlar and Ballybofey (located on the other side of the River Finn) form the Twin Towns.", "image": "Stranorlar.jpg"}, "Carndonagh": {"summary": "Carndonagh (karn-DUN-ah; Irish: Carn Domhnach) is a town on the Inishowen peninsula in County Donegal, Ireland, close to Trawbreaga Bay. It is the site of the Donagh Cross (or St. Patrick's Cross), believed to date to the 7th century. The Irish name, Carn Domhnach, means \"the cairn or mound of the church\".", "image": "Carndonagh.jpg"}, "Bundoran": {"summary": "Bundoran (Irish: Bun Dobhráin) is a town in County Donegal, Ireland. The town is located on the N15 road near Ballyshannon, and is the most southerly town in Donegal. The town is a popular seaside resort, and tourism has been at the heart of the local economy since the 18th century. Bundoran is a world-renowned surfing area and was listed by National Geographic magazine in 2012 as one of the World's Top 20 Surf Towns.", "image": "Bundoran.JPG"}, "Lifford": {"summary": "Lifford (Irish: Leifear, historically anglicised as Liffer) is the county town of County Donegal, Ireland. It is the administrative capital of the county and the seat of Donegal County Council, although the town of Letterkenny is often mistaken for fulfilling this role.\nLifford lies in the Finn Valley area of East Donegal where the River Finn meets the River Mourne to create the River Foyle. The Burn Dale (also spelt as the Burn Deele), a burn (small river), flows into the River Foyle just north of Lifford.", "image": "Lifford.jpg"}, "Whitegate": {"summary": "Whitegate (Irish: an Geata Bán) is a small village in East Cork on the eastern shore of Cork Harbour in County Cork, Ireland. It lies within the townlands of Ballincarroonig and Corkbeg.The ruins of a 14th-century or 15th-century church lie in the grounds of Corkbeg churchyard close to Whitegate village. The current Church of Ireland parish church was built within the same churchyard in 1881.Once a fishing port and known for lace-making, during the 20th-century Whitegate became the location for Ireland's only oil refinery, which was built on Corkbeg Island on one side of Whitegate Bay. This refinery has been owned by Irving Oil since 2016. Aghada Power Generating plant lies on the other side of the bay.\nThe writer William Wall grew up here, though his home, then vacant, was destroyed in a fire in 2008 in a suspected arson attack. Trabolgan Holiday Village is located nearby.", "image": "Whitegate.jpg"}, "Dundrum": {"summary": "Dundrum (Irish: Dún Droma, the ridge fort), originally a town in its own right, is an outer suburb of Dublin, Ireland. The area is located in the postal districts of Dublin 14 and Dublin 16.\nDundrum is home to the largest shopping centre in the country.", "image": "Dundrum.jpg"}, "Buncrana": {"summary": "Buncrana ( bun-KRA-NA; Irish: Bun Cranncha, meaning 'foot of the (River) Crana') is a town in County Donegal, Ireland. It is beside Lough Swilly on the Inishowen peninsula, 23 kilometres (14 mi) northwest of Derry and 43 kilometres (27 mi) north of Letterkenny. In the 2016 census, the population was 6,785 making it the second most populous town in County Donegal, after Letterkenny, and the largest in Inishowen.\nBuncrana is the historic home of the O'Doherty clan and originally developed around the defensive tower known as O'Doherty's Keep at the mouth of the River Crana. The town moved to its present location just south of the River Crana when George Vaughan built the main street in 1718.\nThe town was a major centre for the textile industry in County Donegal from the 19th century until the mid-2000s (decade).", "image": "Buncrana.jpg"}, "Balgriffin": {"summary": "Balgriffin (Irish: Baile Ghrífín, meaning \"Griffin's town\") is a part-rural suburb of Dublin, Ireland, centred on a hamlet. It lies within southern Fingal in the traditional County Dublin and it is partly in the jurisdiction of Dublin City Council and partly that of Fingal County Council.\nBalgriffin is also a civil parish in the ancient barony of Coolock.", "image": "Balgriffin.jpg"}, "Letterkenny": {"summary": "Letterkenny  (Irish: Leitir Ceanainn, meaning 'hillside of the O'Cannons' [ˈl̠ʲɛtʲəɾʲ ˈcanˠən̪ˠ]), nicknamed \"the Cathedral Town\", is the largest and most populous town in County Donegal, Ireland. It lies on the River Swilly in East Donegal and has a population of 19,274. It is the 36th largest settlement in all of Ireland by population (placing it ahead of Sligo, Armagh and Killarney) and is the 15th largest settlement by population in the historic province of Ulster (most of which comprises the separate jurisdiction of modern-day Northern Ireland). Along with the nearby city of Derry, Letterkenny is considered a regional economic gateway for the north-west of Ireland. Letterkenny acts as an urban gateway to the Ulster Gaeltacht, similar to Galway's relationship to the Connemara Gaeltacht.\nLetterkenny began as a market town at the start of the 17th century, during the Plantation of Ulster. A castle once stood near where the Cathedral of St Eunan and St Columba, County Donegal's only Catholic cathedral, stands today. Letterkenny Castle, built in 1625, was located south of Mt Southwell on Castle Street. County Donegal's premier third-level institution, the Letterkenny Institute of Technology (LYIT), is located in the town, as are St Eunan's College, Highland Radio, and a Hindu temple. Letterkenny was also the original home of Oatfield Sweet Factory, a confectionery manufacturer; the factory closed and was demolished in 2014. In 1798, Theobald Wolfe Tone was arrested at Laird's Hotel in the town. In 2015, Letterkenny was judged as the tidiest town in Ireland.Members of the family of Jane Austen lived and are buried in the town, while Letterkenny also has ancestral links to the future British kings William V and George VII (second and third in line to the throne, respectively).", "image": "Letterkenny.JPG"}, "Rathfarnham": {"summary": "Rathfarnham or Rathfarnam (Irish: Ráth Fearnáin, meaning 'Fearnán's ringfort') is a Southside suburb of Dublin, Ireland. It is south of Terenure, east of Templeogue, and is in the postal districts of Dublin 14 and 16. It is within the administrative areas of both Dún Laoghaire–Rathdown and South Dublin County Councils.", "image": "Rathfarnham.jpg"}, "Tower": {"summary": "Tower (Irish: Teamhair; Ordnance Survey Ireland name Model Village) is a village within the administrative area of Cork city in Ireland. It is located to the northwest of the city, approximately 3 km from the town of Blarney on the R617 road. Together with Blarney, Tower is a satellite or dormitory town of Cork city.", "image": "Tower.jpg"}, "Cherry Orchard": {"summary": "Cherry Orchard (Irish: Gort na Silíní) is a suburb within the Ballyfermot area in Dublin, Ireland. It is located near Inchicore, Drimnagh, Kilmainham and Clondalkin. Cherry Orchard F.C. was founded in 1957. The parish Church of the Holy Sacrament, which opened in 1992, is located on  Cherry Orchard Avenue.", "image": "Cherry Orchard.jpg"}, "Ballymun": {"summary": "Ballymun (Irish: Baile Munna) is an outer suburb of Dublin, Ireland, at the northern edge of the Northside, the development of which began in the 1960s to accommodate a housing crisis in inner city areas of Dublin. The area became well known for its high-rise tower blocks and flat complexes. It has several sub-districts such as Sillogue and Poppintree, and is in close proximity to Dublin Airport.\nIn 1997, a regeneration plan was announced, which led to demolition of the flats and their replacement by new low-rise housing and some civic amenities, but also saw the loss of most of the area's shops.  The regeneration had cost about one billion euro as of 2016.", "image": "Ballymun.jpg"}, "Meakstown": {"summary": "County Dublin (Irish: Contae Bhaile Átha Cliath or Contae Átha Cliath) is one of the thirty-two traditional counties of Ireland. Prior to 1994 it was also an administrative county covering the whole county outside of Dublin City Council. In 1994, as part of a reorganisation of local government within Dublin the boundaries of Dublin City were redrawn, Dublin County Council was abolished and three new administrative county councils were established: Dún Laoghaire–Rathdown, Fingal and South Dublin.\nWhile it is no longer used as an administrative division for local government, it retains a strong identity in popular culture. It is in the province of Leinster, and is named after the city of Dublin, the capital city of Ireland. County Dublin was one of the first parts of Ireland to be shired by John, King of England following the Norman invasion of Ireland. \nAccording to the 2016 census, the total population of County Dublin was 1,345,402, approximately 27% of the Republic of Ireland's population. The county is a NUTS 3 region, and is part of the NUTS 2 region of Eastern and Midland.", "image": "Meakstown.png"}, "Clonee (Dublin)": {"summary": "Clonee (Irish: Cluain Aodha, meaning 'Aodh's pasture') is a village and a townland in County Meath, Ireland. It borders Fingal to the east at the townlands of Huntstown and Littlepace, and is sometimes used in addresses for housing in those townlands. The River Tolka passes the village.", "image": "Clonee (Dublin).jpg"}, "Parnell Street": {"summary": "Parnell Street (Irish: Sráid Pharnell) is located on Dublin's Northside and runs from Capel Street in the west to Gardiner Street and Mountjoy Square in the east. It is at the north end of O'Connell Street, where it provides the south side of Parnell Square.\nOriginally, Parnell Street was part of the ancient road connecting the old city to northern coast, with Father Matthew Bridge connecting Church Street and Wood Quay in the east, to Ballybough and Fairview in the west. During the 18th century, development of Amiens Street and Annesley Bridge provided a new coast road, and Parnell Street and its continuation to the east, Summerhill, became home to Georgian architecture.\nThe western end of Parnell Street has been substantially redeveloped in recent years. The urban regeneration came after road plans by Dublin Corporation devastated the street in the 1970s, when it was scheduled to be part of the Inner Tangent Road scheme, causing massive dereliction and blight. Virtually all of the original Georgian architecture was destroyed and subsequently replaced by buildings of much larger scale. The eastern end of Parnell Street, having remained comparatively undeveloped, is now home to a thriving immigrant community. Most notably, a plethora of authentic Chinese and Korean restaurants have lent the east side the reputation of being Dublin's \"Chinatown\". There is also a significant presence of African and East and Central European businesses at the eastern end, including the Big Romance, a vinyl only craft beer pub.", "image": "Parnell Street.jpg"}, "Sutton": {"summary": "Sutton (Irish: Cill Fhionntain – Fintan's cell or church) is a residential suburb on the Northside of Dublin, Ireland. It occupies the tombolo which links Howth Head to the mainland, some of the lower slopes of Howth Hill, and a little of the adjacent coasts. The area lies within the jurisdiction of Fingal County Council.  There is a small commercial core at the Sutton Cross road intersection. \nSutton lies in the ancient Barony of Coolock, within the historic County Dublin.", "image": "Sutton.jpg"}, "Drimnagh": {"summary": "Drimnagh (Irish: Droimneach) is a suburb of Dublin, Ireland, situated on the Southside of the city between Walkinstown, Crumlin and Inchicore, bordered by the Grand Canal to the north and east. Drimnagh is in postal district Dublin 12.", "image": "Drimnagh.jpg"}, "IFSC": {"summary": "The International Financial Services Centre (IFSC) is an area of central Dublin and part of the CBD established in the 1980s as an urban regeneration area and Special Economic Zone (SEZ) on the derelict state owned former port authority lands of the reclaimed North Wall and George's Dock areas of the Dublin Docklands. The term has now morphed into use as a metonym for the Irish financial services industry as well as being used as an address and still being classified as an SEZ.\nIt officially began in 1987 as an SEZ on an 11-hectare docklands site in central Dublin, with EU approval to apply a 10% corporate tax rate for \"designated financial services activities\" on the site. Before the expiry of this EU approval in 2005, the Irish Government legislated to effectively have a national flat rate by reducing the overall Irish corporate tax rate from 32% to 12.5% which was introduced in 2003.An additional primary goal of the IFSC was to assist the urban renewal and development programme of the North Wall area as a result of its dereliction following the advent of containerisation in the 1960s. The area continues to benefit from Section 23 (Urban Renewal) income tax reliefs for property owners as of 2019 although new entrants ceased being able to avail of reliefs from 1999.The original 11-hectare IFSC site has gone through several expansions to become a 37.8-hectare area by 2018 which is now a major European financial centre situated within Dublin's central business district. By merging with the Spencer Dock and Grand Canal Dock (sometimes called Silicon Docks) area, the IFSC is now considered to be an \"International Services Centre\", covering a broader range then being purely \"financial\". The creation and development of the IFSC is considered by author Nicholas Shaxson to be an important part of Ireland's economic growth story.A 2015 Irish Government IFS 2020 Strategy Paper, lists the Irish financial services sector as comprising over 400 companies, employing over 35,000 people (one third outside Dublin), with over €3.2 trillion in funds under administration, providing €2bn in taxes and €2.3bn in wages and salaries. KMPG estimate the IFSC constitutes 7% of Irish GDP. The IFSC has now become one of Europe's most important centres for § Fund Administration & Domiciling, and § Securitisation, and ultimately became the birthplace of and global leader in § Aircraft leasing.Some of the largest offices in the IFSC are those of the major Irish accounting and law firms. They have become associated with the creation and development of international tax management tools, (such as the Double Irish, Single malt, and Capital allowances for intangible assets (CAIA) BEPS tools; and Section 110 SPV, QIAIF and ICAV zero-tax legal structures), leading to concerns of Ireland as a tax haven. In 2017, a University of Amsterdam study estimated that the IFSC was one of the world's largest Conduit OFCs for facilitating global corporate tax avoidance. In 2018, a Gabriel Zucman study estimated that Ireland had become the world's largest corporate tax haven by virtue of its use as a Conduit OFC.Dublin encompassing the IFSC ranked 38th overall out of 102 major global financial centres in the 2019 Global Financial Centres Index as well as ranking 15th out of 15 in the maiden list of leading Fintech centres in the same publication (GFCI25, March 2019).", "image": "IFSC.jpg"}, "Glasnevin": {"summary": "Glasnevin (Irish: Glas Naíon, meaning 'stream of the infants', also known as Glas Naedhe, meaning \"stream of O'Naeidhe\" after an ancient chieftain) is a neighbourhood of Dublin, Ireland, situated on the River Tolka.  While primarily residential, Glasnevin is also home to the National Botanic Gardens, national meteorological office and a range of other State bodies, and Dublin City University has its main campus and other facilities in and near the area.\nGlasnevin is also a civil parish in the ancient barony of Coolock.", "image": "Glasnevin.jpg"}, "Walkinstown": {"summary": "Walkinstown (Irish: Baile Bhailcín) is a suburb of Dublin, Ireland, situated on the Southside of the city, approximately 6 kilometres south-west of Dublin city centre. The suburb borders Crumlin to the east, Drimnagh to the north, Greenhills to the south and Ballymount, Bluebell and Clondalkin to the west. Its postal code is Dublin 12.\nWalkinstown is a suburb consisting primarily of privately owned residential housing with some social housing remaining in the Dublin City Council area between the Walkinstown and Long Mile Roads and Ballymount Lower. It was built as an estate of starter homes after World War 2 with the council housing being developed as social rented homes later in the early to mid fifties.\nLight industry, warehousing, car dealerships and commercial outlet stores are concentrated along the Long Mile Road in the western sector of the suburb. The Central Statistics Office census of 2016 recorded a populated of 6819 for the area. The area is very well served with a library, residents' association, sports ground, community centre, schools, pubs, church and retail facilities.", "image": "Walkinstown.jpg"}, "Crumlin": {"summary": "Crumlin (Irish: Cromghlinn, meaning 'Crooked Glen') is a Southside suburb of Dublin, Ireland.  A densely populated residential area, with some industry, it is also the site of Ireland's largest children's hospital.", "image": "Crumlin.jpg"}, "Finglas": {"summary": "Finglas (; Irish: Fionnghlas, meaning 'clear streamlet') is a northwestern outer suburb of Dublin, Ireland, close to Junction 5 of the M50 motorway and the N2 road. Nearby suburbs include Glasnevin and Ballymun; Dublin Airport is 7 km to the north. It lies mainly in the postal district of Dublin 11.\nFinglas is the core of a civil parish in the barony of Castleknock.", "image": "Finglas.jpg"}, "Kimmage": {"summary": "Kimmage (Irish: Camaigh uisce, \"Crooked water-meadow\", probably referring to the meandering course of the River Poddle), is a small residential suburb located on the south side of Dublin, Ireland. It is in the jurisdiction of Dublin City Council.", "image": "Kimmage.jpg"}, "Baldoyle": {"summary": "Baldoyle (Irish: Baile Dúill) is a coastal suburb of Dublin's northside. It is located in the southeastern part of the jurisdiction of Fingal, Ireland, developed from a former fishing village. \nBaldoyle is also a civil parish in the barony of Coolock within the historic County Dublin.", "image": "Baldoyle.jpg"}, "Clonskeagh": {"summary": "Clonskeagh or Clonskea (Irish: Cluain Sceach, meaning \"meadow of the Whitethorn\"; pronounced [klɔnskiː]), is a small southern suburb of Dublin, Ireland. The district straddles the River Dodder.", "image": "Clonskeagh.jpg"}, "Donaghmede": {"summary": "Donaghmede (Irish: Domhnach Míde, meaning 'St Mide's Church') is a residential suburb on the northern side of Dublin, Ireland, formed from parts of Baldoyle, Coolock and Raheny in the 1970s. It contains a mid-size shopping centre and a ruined chapel, and lies within the jurisdiction of Dublin City Council.", "image": "Donaghmede.jpg"}, "St Margarets Road": {"summary": "County Dublin (Irish: Contae Bhaile Átha Cliath or Contae Átha Cliath) is one of the thirty-two traditional counties of Ireland. Prior to 1994 it was also an administrative county covering the whole county outside of Dublin City Council. In 1994, as part of a reorganisation of local government within Dublin the boundaries of Dublin City were redrawn, Dublin County Council was abolished and three new administrative county councils were established: Dún Laoghaire–Rathdown, Fingal and South Dublin.\nWhile it is no longer used as an administrative division for local government, it retains a strong identity in popular culture. It is in the province of Leinster, and is named after the city of Dublin, the capital city of Ireland. County Dublin was one of the first parts of Ireland to be shired by John, King of England following the Norman invasion of Ireland. \nAccording to the 2016 census, the total population of County Dublin was 1,345,402, approximately 27% of the Republic of Ireland's population. The county is a NUTS 3 region, and is part of the NUTS 2 region of Eastern and Midland.", "image": "St Margarets Road.png"}, "Porterstown": {"summary": "Porterstown station is a proposed transport interchange intended for the Porterstown area of Dublin. The intended station would form an interchange between heavy rail services operated by Iarnród Éireann and light rail operations on the planned Dublin Metro's Metro West line.The station would serve areas of Blanchardstown, Clonsilla and Carpenterstown. The heavy rail station would be located on the Maynooth Line and would have Commuter services operating to Mullingar and Navan from both Dublin Connolly and Docklands, as well as high frequency DART services. \nThe Dublin Metro is a proposed light rail operation, with the station intended to be built on an elevated section over the railway line and adjacent Royal Canal. The Metro West line was indefinitely postponed in late 2011, as no capital funding is available.\n\n\n== References ==", "image": "Porterstown.jpg"}, "Castleknock": {"summary": "Castleknock (Irish: Caisleán Cnucha, meaning 'Cnucha's Castle') is an affluent suburb of Dublin, centred on a village in Fingal, Ireland. It is located 8 km (5 mi) west of the centre of Dublin.\nIn addition to the suburb, the name \"Castleknock\" also refers to older units of land division: a townland, a civil parish and a barony.", "image": "Castleknock.jpg"}, "Ashtown": {"summary": "Ashtown (Irish: Baile an Áisigh) is a small suburb of Dublin, Ireland.  It is also a townland in the civil parish of Castleknock and falls largely into the postal districts of Dublin 15, with some addresses falling into the Dublin 7 postal district.\nAshtown is bounded roughly by the townlands of Castleknock to the west.  It is situated by the Royal Canal, near the Navan Road, which some addresses being named off Navan Road.  The Phoenix Park is also nearby, its Ashtown Gate entrance about 500 metres south of the railway station. The townland's 278 acres are within Dublin City whereas Castleknock is in Fingal. The suburb had a population of 13,209 inhabitants as reported in the 2016 census.Teagasc has a food research centre at Ashtown.", "image": "Ashtown.jpg"}, "Goatstown": {"summary": "Goatstown (Irish: Baile na nGabhar) is a small, affluent Southside suburb of Dublin, Ireland. To the west is Dundrum, to the east is Blackrock, to the south is Sandyford, and to the north Ranelagh.", "image": "Goatstown.jpeg"}, "Clongriffin": {"summary": "Clongriffin (Irish: Cluain Ghrífín) is a growing community in northern Donaghmede, on the northern fringe of Dublin, Ireland.  The settlement was based on a master plan vision from major developer Gannon Homes, with significant investment in transport infrastructure and also community and recreational amenities.  Development slowed during the downturn in the economy, although activity renewed in recent years, with planning permission secured for a hotel and range of additional homes including a 16-storey apartment block with residential lounges and roof gardens..", "image": "Clongriffin.jpg"}, "Ballyfermot": {"summary": "Ballyfermot (Irish: Baile Formaid) is a suburb in the city of Dublin, Ireland. Located seven kilometres west of the city centre, south of the Phoenix Park, it is bordered on the north by Chapelizod, on the south by Walkinstown, on the east by Inchicore, on the north-west by Palmerstown and the south-west by Clondalkin.  The River Liffey lies to the north, and the Grand Canal, now a recreational waterway, lies to the south.  Ballyfermot is designated as postal district Dublin 10. Cherry Orchard is also a suburb within Ballyfermot. Ballyfermot is also a civil parish in the barony of Uppercross.", "image": "Ballyfermot.jpg"}, "Churchtown": {"summary": "Churchtown (Irish: Baile an Teampaill) is a largely residential suburb on the southside of Dublin, Ireland, between  Rathfarnham and Dundrum.", "image": "Churchtown.jpg"}, "Coolmine": {"summary": "Coolmine (Irish: Cúl Mhín) is a residential area in Fingal, Ireland. It is also a townland in the civil parish of Clonsilla.", "image": "Coolmine.jpg"}, "Summerhill": {"summary": "Summerhill (Irish: Cnoc an Línsigh) is a designated heritage village in County Meath, Ireland.  It is located at the intersection of the R156 and R158 regional roads and is part of the Laracor civil parish. The Irish version of the town's name means \"Lynch's Hill\", and it was the ancestral home of the Norman-Irish Lynch family, whence came the Galway merchant family of the same name - one of the \"Tribes of Galway\".  It is also the site of one of the most important battles in 17th century Ireland, the Battle of Dungan's Hill. The town was known in English as 'The Knock' or 'Lynchs' Knock'  (phonetic renderings of Cnoc an Línsigh, Lynchs' hill) until about 1667 when it was renamed Summerhill. The ruins of the large Lynch castle can be seen in the village today.", "image": "Summerhill.jpg"}, "Ongar": {"summary": "Ongar is an outer suburb of Dublin, Ireland. Developed on a greenfield basis since 2001, it comprises the townlands of Castaheany (northerly) and \"Hansfield or Phibblestown\" (southerly), within the ancient Barony of Castleknock, County Dublin. It is close to Castleknock, Blanchardstown and Clonsilla.  The development has a number of amenities on the main street, there are several schools in the area, and the nearby railway line at Hansfield railway station connects to the Luas Green Line and ultimately the N3 national route / M3 motorway.  Employers in the nearby business parks and \"Greater Blanchardstown\" include Intel, Hewlett Packard, IBM, Kepak and eBay.", "image": "Ongar.jpg"}, "Carpenterstown": {"summary": "County Dublin (Irish: Contae Bhaile Átha Cliath or Contae Átha Cliath) is one of the thirty-two traditional counties of Ireland. Prior to 1994 it was also an administrative county covering the whole county outside of Dublin City Council. In 1994, as part of a reorganisation of local government within Dublin the boundaries of Dublin City were redrawn, Dublin County Council was abolished and three new administrative county councils were established: Dún Laoghaire–Rathdown, Fingal and South Dublin.\nWhile it is no longer used as an administrative division for local government, it retains a strong identity in popular culture. It is in the province of Leinster, and is named after the city of Dublin, the capital city of Ireland. County Dublin was one of the first parts of Ireland to be shired by John, King of England following the Norman invasion of Ireland. \nAccording to the 2016 census, the total population of County Dublin was 1,345,402, approximately 27% of the Republic of Ireland's population. The county is a NUTS 3 region, and is part of the NUTS 2 region of Eastern and Midland.", "image": "Carpenterstown.png"}, "Mulhuddart": {"summary": "Mulhuddart (Irish: Mullach Eadrad, meaning 'the hill of the milking place') is an outer suburb situated 12 km (7.456 miles) north-west of Dublin, Ireland. The River Tolka passes near the village. \nMulhuddart is also a civil parish in the barony of Castleknock in the historic County Dublin.", "image": "Mulhuddart.jpg"}, "Blanchardstown": {"summary": "Blanchardstown (Irish: Baile Bhlainséir) is a large outer suburb of Dublin in County Fingal, Ireland, built out from a small village since the 1960s. It is located 10 km north-west of the city centre. It is within the historical barony of Castleknock in the traditional County Dublin, as well as the Dublin 15 postal area and the Dublin West electoral constituency.  \nBlanchardstown is the largest urban area in Fingal. One of Ireland's largest shopping and leisure centres, the Blanchardstown Centre, is located in the area.", "image": "Blanchardstown.jpg"}, "Clonsilla": {"summary": "Clonsilla (Irish: Cluain Saileach, meaning 'meadow of the willow or sally tree') is an outer suburb of Dublin in Fingal, Ireland. \nClonsilla is also a civil parish in the barony of Castleknock in the historic County Dublin.", "image": "Clonsilla.jpg"}, "Ballinteer": {"summary": "Ballinteer (Irish: Baile an tSaoir, meaning 'Town of the Stonemason') is a small southside suburb of Dublin, located in Dún Laoghaire–Rathdown, Ireland, extensively developed from the late 1960s onwards.", "image": "Ballinteer.JPG"}, "Tyrrelstown": {"summary": "Tyrrelstown (Irish: Baile an Tirialaigh) is a townland in the civil parish of Mulhuddart, located 13 km northwest of the city of Dublin in Ireland and often considered as part of the greater Blanchardstown area.  It is the site of a planned suburban development from the early 2000s.  The local authority for the area, which forms part of the Dublin 15 postal district, is Fingal County Council.", "image": "Tyrrelstown.jpg"}, "Royal Canal Park": {"summary": "The Royal Canal (Irish: An Chanáil Ríoga) is a canal originally built for freight and passenger transportation from the River Liffey in Dublin to Longford in Ireland. The canal fell into disrepair in the late 20th century, but much of the canal has since been restored for navigation. The length of the canal to the River Shannon was reopened on 1 October 2010, but the final spur branch of the canal to Longford Town remains closed.", "image": "Royal Canal Park.jpg"}, "Sandyford": {"summary": "Sandyford (Irish: Áth an Ghainimh) is a suburb of Dublin, located in Dún Laoghaire–Rathdown, Ireland.\nSandyford Business District makes up much of the suburb and encompasses Sandyford Industrial Estate. It is the location for a number of multinational financial services and technology companies including Google, Facebook, Microsoft and AIB.", "image": "Sandyford.jpg"}, "Cabinteely": {"summary": "Cabinteely (Irish: Cábán tSíle, meaning 'Sheila's Cabin') is a suburb of Dublin's southside. It is located in the jurisdiction of Dún Laoghaire–Rathdown, County Dublin, Ireland.", "image": "Cabinteely.jpg"}, "Palmerstown": {"summary": "Palmerstown (Irish: Baile Phámar) is a civil parish and suburb in South Dublin, Ireland. It is located about 8 km west of Dublin city centre. The area is bordered to the north by the River Liffey, to the west by Lucan, to the south by Ballyfermot and to the east by the village of Chapelizod. Palmerstown village is situated near the Liffey Valley Shopping Centre. The area is situated near the major junction of the M50 motorway and the N4. It is 8.8 km from Dublin city centre. The Old Lucan Road, once the main route from the city to the west, passes through the centre of Palmerstown village.", "image": "Palmerstown.JPG"}, "Leopardstown": {"summary": "Leopardstown (Irish: Baile na Lobhar, meaning 'Town of the Lepers') is a village in Dún Laoghaire–Rathdown, County Dublin, Ireland, located at the foot of the Dublin Mountains. A residential suburb in the east of the greater Dublin area, it is divided by the course of the M50 motorway, and adjoins the neighbouring areas of Sandyford, Stepaside, Ballyogan, Foxrock and Stillorgan.", "image": "Leopardstown.JPG"}, "Malahide Road": {"summary": "Malahide (ma-la-HYD; Irish: Mullach Íde) is an affluent coastal settlement in Fingal, County Dublin, Ireland, situated approximately 18 km north-east of Dublin city.  It has a village centre surrounded by suburban housing estates, with a population over 16,000.\nMalahide Castle dates from the 12th century and is surrounded by a large park, part of which incorporates an international cricket ground.  The area also features a sandy beach, a marina, and a variety of sporting clubs.", "image": "Malahide Road.JPG"}, "Carrickmines": {"summary": "Carrickmines (Irish: Carraig Mhaighin, meaning 'Plateau of rock') is an outer suburb of Dublin in Dún Laoghaire–Rathdown, Ireland. The area, still semi-rural, was historically on the border of English control and featured a defensive construction, Carrickmines Castle, which became the subject of national controversy during the building of a late stage of Dublin's M50 orbital motorway.", "image": "Carrickmines.JPG"}, "Ballycullen": {"summary": "Ballycullen (Irish: Baile Uí Chuillinn) is a townland and suburb of Dublin, Ireland situated next to Knocklyon.\nBallycullen is a townland in the civil parish of Tallaght, located in Dublin 16 and Dublin 24.  Part of Ballycullen is in Dublin 24. Part of Ballycullen is South of Old Court Road.\nBallycullen, (D16) Knocklyon (D16) and Firhouse (D24) all adjoin each other and the two defining borders are Ballycullen Road, Old Court Road, Dale Tree Road and Gunny Hill. The area is served by Dublin Bus routes 15, 49 and 65b.\n\n\n== References ==", "image": "Ballycullen.jpg"}, "Northern Cross": {"summary": "County Dublin (Irish: Contae Bhaile Átha Cliath or Contae Átha Cliath) is one of the thirty-two traditional counties of Ireland. Prior to 1994 it was also an administrative county covering the whole county outside of Dublin City Council. In 1994, as part of a reorganisation of local government within Dublin the boundaries of Dublin City were redrawn, Dublin County Council was abolished and three new administrative county councils were established: Dún Laoghaire–Rathdown, Fingal and South Dublin.\nWhile it is no longer used as an administrative division for local government, it retains a strong identity in popular culture. It is in the province of Leinster, and is named after the city of Dublin, the capital city of Ireland. County Dublin was one of the first parts of Ireland to be shired by John, King of England following the Norman invasion of Ireland. \nAccording to the 2016 census, the total population of County Dublin was 1,345,402, approximately 27% of the Republic of Ireland's population. The county is a NUTS 3 region, and is part of the NUTS 2 region of Eastern and Midland.", "image": "Northern Cross.png"}, "Stepaside": {"summary": "Stepaside (Irish: An Chéim) is a village on the outskirts of Dublin located on its southside, located in Dún Laoghaire–Rathdown, Ireland. The area is situated 4 kilometres (2.5 mi) south of Dundrum.", "image": "Stepaside.JPG"}, "Tara Street": {"summary": "Tara Street is a major traffic route in Dublin, Ireland, partly due to the current one-way traffic flow in the city centre. It links Pearse Street to the northern side of the city via Butt Bridge - traffic flows to the north. The street gives its name to Tara Street railway station, which is around the corner on Georges Quay, near the northern end of Tara Street. Home to Philomena Bernadette O’Neill, mother to Fiona Avril and Jonathan James, a State Registered Nurse.\nIt was developed as a completely new street in 1885 replacing Shoe Lane (part of which was called Stocking Lane) and George's Street.  The street was named after Tara, the home of the ancient high kings of Ireland.\nIn April 1907 Dublin Fire Brigade opened its headquarters at the new fire station at the corner of Tara Street and Pearse Street.  This would be the headquarters of the Fire Brigade until a new headquarters was opened in Townsend Street in 1998. The brick watch tower at the intersection of the two streets is now a protected structure.During the Easter Rising, British artillery shelled Liberty Hall from Tara Street, though the road surface made it difficult.Tara Street was widened in 1932 after Butt Bridge was changed from a swing bridge to a three span fixed structure.\nIn October 2006, The Irish Times moved to new headquarters in Tara Street. Previously, it had been based on D'Olier Street", "image": "Tara Street.jpg"}, "Citywest": {"summary": "Citywest (Irish: Iarthar na Cathrach) is a developing suburb on the southwestern periphery of Dublin, originally developed as a \"business campus.\" It contains a large hotel and golf course, a shopping centre and an expanding residential element Citywest is situated in the southwest of the traditional County Dublin, in the jurisdiction of South Dublin County Council; the nearest major suburban centre is Tallaght, while the semi-suburban village of Saggart is adjacent.", "image": "Citywest.jpg"}, "Ballsbridge": {"summary": "Ballsbridge (Irish: Droichead na Dothra, meaning 'Dodder bridge') (from historic Ball's Bridge) is an affluent neighbourhood of the city of Dublin, the capital of Ireland. The area is largely north and west of a three-arch stone bridge across the River Dodder, on the south side of the city. The sign on the bridge still proclaims it as \"Ball's Bridge\", in recognition of the fact that the original bridge on that location was built and owned by the Ball family, a well-known Dublin merchant family in the 1500s and the 1600s. The current bridge was built in 1791.\nBallsbridge was once part of the Pembroke Township.", "image": "Ballsbridge.jpg"}, "Marino": {"summary": "Marino (Irish: An Mairíne) is an inner city suburb on the northside of Dublin, Ireland.", "image": "Marino.JPG"}, "Irishtown": {"summary": "Irishtown (Irish: An Baile Gaelach) is an inner suburb of Dublin, Ireland. It is situated on the southside of the River Liffey, between Ringsend to the north and Sandymount to the south, and is to the east of the River Dodder.", "image": "Irishtown.jpg"}, "Sandymount": {"summary": "Sandymount (Irish: Dumhach Thrá) is an affluent coastal suburb in the Dublin 4 district on the south side of Dublin in Ireland.", "image": "Sandymount.jpg"}, "Pearse Street": {"summary": "Pearse Street (Irish: Sráid an Phiarsaigh) is one of the longest streets in Dublin and varies in use along its length. It is named after the Irish revolutionaries, Pádraig Pearse and his brother William, who were born there. It was previously called Great Brunswick Street, after the House of Brunswick-Lüneburg, Hanover line.", "image": "Pearse Street.jpg"}, "Chapelizod": {"summary": "Chapelizod (Irish: Séipéal Iosóid, meaning 'Iseult's Chapel') is a village preserved within the city of Dublin, Ireland. It lies in the wooded valley of the River Liffey, near the Strawberry Beds and the Phoenix Park. The village is associated with Iseult of Ireland and the location of Iseult's chapel. Chapelizod is under the administration of Dublin City Council.", "image": "Chapelizod.jpg"}, "Lower Mount Street": {"summary": "County Dublin (Irish: Contae Bhaile Átha Cliath or Contae Átha Cliath) is one of the thirty-two traditional counties of Ireland. Prior to 1994 it was also an administrative county covering the whole county outside of Dublin City Council. In 1994, as part of a reorganisation of local government within Dublin the boundaries of Dublin City were redrawn, Dublin County Council was abolished and three new administrative county councils were established: Dún Laoghaire–Rathdown, Fingal and South Dublin.\nWhile it is no longer used as an administrative division for local government, it retains a strong identity in popular culture. It is in the province of Leinster, and is named after the city of Dublin, the capital city of Ireland. County Dublin was one of the first parts of Ireland to be shired by John, King of England following the Norman invasion of Ireland. \nAccording to the 2016 census, the total population of County Dublin was 1,345,402, approximately 27% of the Republic of Ireland's population. The county is a NUTS 3 region, and is part of the NUTS 2 region of Eastern and Midland.", "image": "Lower Mount Street.png"}, "Foxrock": {"summary": "Foxrock (Irish: Carraig an tSionnaigh) is a suburb of Dublin, Ireland. It is within the county of Dún Laoghaire–Rathdown, in the postal district of Dublin 18 and in the Roman Catholic parish of Foxrock.", "image": "Foxrock.jpg"}, "Hanover Quay": {"summary": "County Dublin (Irish: Contae Bhaile Átha Cliath or Contae Átha Cliath) is one of the thirty-two traditional counties of Ireland. Prior to 1994 it was also an administrative county covering the whole county outside of Dublin City Council. In 1994, as part of a reorganisation of local government within Dublin the boundaries of Dublin City were redrawn, Dublin County Council was abolished and three new administrative county councils were established: Dún Laoghaire–Rathdown, Fingal and South Dublin.\nWhile it is no longer used as an administrative division for local government, it retains a strong identity in popular culture. It is in the province of Leinster, and is named after the city of Dublin, the capital city of Ireland. County Dublin was one of the first parts of Ireland to be shired by John, King of England following the Norman invasion of Ireland. \nAccording to the 2016 census, the total population of County Dublin was 1,345,402, approximately 27% of the Republic of Ireland's population. The county is a NUTS 3 region, and is part of the NUTS 2 region of Eastern and Midland.", "image": "Hanover Quay.png"}, "Firhouse": {"summary": "Firhouse (Irish: Teach na Giúise) is an outer suburb of Dublin, in the jurisdiction of South Dublin, Ireland, developed from what was historically a small rural village by the River Dodder, with a second settlement, Upper Fir-house, nearby.  It is just outside the M50 orbital motorway, and in the postal district of Dublin 24 (eircode routing key D24), and is adjacent to Knocklyon (with which it shares a townland) and close to both Tallaght and Templeogue. In the historic divisions of local administration, Firhouse is in the civil parish of Tallaght and the barony of Uppercross.", "image": "Firhouse.JPG"}, "Townsend Street": {"summary": "County Dublin (Irish: Contae Bhaile Átha Cliath or Contae Átha Cliath) is one of the thirty-two traditional counties of Ireland. Prior to 1994 it was also an administrative county covering the whole county outside of Dublin City Council. In 1994, as part of a reorganisation of local government within Dublin the boundaries of Dublin City were redrawn, Dublin County Council was abolished and three new administrative county councils were established: Dún Laoghaire–Rathdown, Fingal and South Dublin.\nWhile it is no longer used as an administrative division for local government, it retains a strong identity in popular culture. It is in the province of Leinster, and is named after the city of Dublin, the capital city of Ireland. County Dublin was one of the first parts of Ireland to be shired by John, King of England following the Norman invasion of Ireland. \nAccording to the 2016 census, the total population of County Dublin was 1,345,402, approximately 27% of the Republic of Ireland's population. The county is a NUTS 3 region, and is part of the NUTS 2 region of Eastern and Midland.", "image": "Townsend Street.png"}, "Charlemont Street": {"summary": "County Dublin (Irish: Contae Bhaile Átha Cliath or Contae Átha Cliath) is one of the thirty-two traditional counties of Ireland. Prior to 1994 it was also an administrative county covering the whole county outside of Dublin City Council. In 1994, as part of a reorganisation of local government within Dublin the boundaries of Dublin City were redrawn, Dublin County Council was abolished and three new administrative county councils were established: Dún Laoghaire–Rathdown, Fingal and South Dublin.\nWhile it is no longer used as an administrative division for local government, it retains a strong identity in popular culture. It is in the province of Leinster, and is named after the city of Dublin, the capital city of Ireland. County Dublin was one of the first parts of Ireland to be shired by John, King of England following the Norman invasion of Ireland. \nAccording to the 2016 census, the total population of County Dublin was 1,345,402, approximately 27% of the Republic of Ireland's population. The county is a NUTS 3 region, and is part of the NUTS 2 region of Eastern and Midland.", "image": "Charlemont Street.png"}, "Clondalkin": {"summary": "Clondalkin ( klun-DAWK-ən; Irish: Cluain Dolcáin, meaning 'Dolcan's meadow') is a suburban town situated 10 km south-west of Dublin city centre, Ireland, under the administrative jurisdiction of South Dublin.  It features an eighth-century round tower that acts as a focal point for the area.  Clondalkin forms part of the Dublin Mid-West Dáil constituency and its postal code is Dublin 22.\nClondalkin is also the name of a civil parish in the ancient barony of Uppercross, and is also used in relation to some local religious parishes.", "image": "Clondalkin.jpg"}, "Grand Canal Square": {"summary": "The Grand Canal (Irish: An Chanáil Mhór) is the southernmost of a pair of canals that connect Dublin, in the east of Ireland, with the River Shannon in the west, via Tullamore and a number of other villages and towns, the two canals nearly encircling Dublin's inner city. Its sister canal on the Northside of Dublin is the Royal Canal. The last working cargo barge passed through the Grand Canal in 1960.", "image": "Grand Canal Square.jpg"}, "Temple Bar": {"summary": "Temple Bar (Irish: Barra an Teampaill) is an area on the south bank of the River Liffey in central Dublin, Ireland. The area is bounded by the Liffey to the north, Dame Street to the south, Westmoreland Street to the east and Fishamble Street to the west. It is promoted as Dublin's 'cultural quarter' and, as a centre of Dublin's city centre's nightlife, is a tourist destination.Temple Bar is in the Dublin 2 postcode.", "image": "Temple Bar.JPG"}, "Aungier Street": {"summary": "County Dublin (Irish: Contae Bhaile Átha Cliath or Contae Átha Cliath) is one of the thirty-two traditional counties of Ireland. Prior to 1994 it was also an administrative county covering the whole county outside of Dublin City Council. In 1994, as part of a reorganisation of local government within Dublin the boundaries of Dublin City were redrawn, Dublin County Council was abolished and three new administrative county councils were established: Dún Laoghaire–Rathdown, Fingal and South Dublin.\nWhile it is no longer used as an administrative division for local government, it retains a strong identity in popular culture. It is in the province of Leinster, and is named after the city of Dublin, the capital city of Ireland. County Dublin was one of the first parts of Ireland to be shired by John, King of England following the Norman invasion of Ireland. \nAccording to the 2016 census, the total population of County Dublin was 1,345,402, approximately 27% of the Republic of Ireland's population. The county is a NUTS 3 region, and is part of the NUTS 2 region of Eastern and Midland.", "image": "Aungier Street.png"}, "East Wall": {"summary": "East Wall (Irish: An Port Thoir) is an inner city area of the Northside of Dublin, Ireland. Built on reclaimed ground in the 1820s, the area is also 30 minutes walk from Dublin's main thoroughfare, O'Connell Street.", "image": "East Wall.jpg"}, "Clontarf": {"summary": "Clontarf (Irish: Cluain Tarbh, meaning 'meadow of the bull') is an affluent coastal suburb on the northside of Dublin, in Ireland. Whilst Clontarf does not have a single ’village centre’,  historically there were two centres of population, one on the coast towards the city, and the fishing village of Clontarf Sheds, further north on the coast at what is now Vernon Avenue. Clontarf has a range of commercial facilities in several locations, mainly centred on Vernon Avenue. It adjoins Fairview, Marino, Killester and Raheny, and is in the postal district Dublin 3.  Clontarf is in the jurisdiction of Dublin City Council. \nClontarf is most famous for the Battle of Clontarf in 1014, in which Brian Boru, High King of Ireland, defeated the Vikings of Dublin and their allies, the Irish of Leinster. This battle, which extended over a wide area, is seen as marking an end to the Irish-Viking Wars.", "image": "Clontarf.jpg"}, "Eastwall": {"summary": "East Wall (Irish: An Port Thoir) is an inner city area of the Northside of Dublin, Ireland. Built on reclaimed ground in the 1820s, the area is also 30 minutes walk from Dublin's main thoroughfare, O'Connell Street.", "image": "Eastwall.jpg"}, "Grand Canal Dock": {"summary": "Grand Canal Dock (Irish: Duga na Canálach Móire) is a Southside area near the city centre of Dublin, Ireland.  It is located on the border of eastern Dublin 2 and the westernmost part of Ringsend in Dublin 4, surrounding the Grand Canal Docks, an enclosed harbour where the Grand Canal comes to the River Liffey. The area has undergone significant redevelopment since 2000, as part of the Dublin Docklands area redevelopment project.\nThe area has been nicknamed \"Silicon Docks\" by Google and Facebook (a reference to Silicon Valley) as it has become a popular location for multinational technology firms such as Google, Facebook, Twitter, LinkedIn, and Airbnb. The area has been the subject of debate over the balance of development and gentrification as well as the subject of derision over the clichéd nature of its new nickname.", "image": "Grand Canal Dock.jpg"}, "Clonliffe": {"summary": "For the Dublin athletic club, see Clonliffe Harriers\n\nClonliffe is an area of North Dublin, Ireland, between Ballybough and Drumcondra. \nClonliffe Road is the wide linking thoroughfare nearly a mile long forming the central artery. There is an entrance at the Drumcondra end, to Holy Cross College, and to the grounds of the residence of the Archbishop of Dublin.  \nThe main access to Croke Park GAA sports ground is from Jones Road, the principal turn off on the south side of Clonliffe Road. In the mid-19th century, it was proposed that a university be located at Clonliffe.", "image": "Clonliffe.jpg"}, "Fairview": {"summary": "Fairview (Irish: Fionnradharc) is a coastal suburb of Dublin in Ireland, in the jurisdiction of Dublin City Council.  Part of the area forms Fairview Park, a recreational amenity laid-out on land reclaimed from the sea.", "image": "Fairview.jpg"}, "Knocklyon": {"summary": "Knocklyon (Irish: Cnoc Lín) is a suburb of Dublin in the administrative county of South Dublin within the traditional County Dublin, Ireland.  Unlike many Dublin suburbs, Knocklyon was not developed around a village; rather it largely comprises modern housing built between the village of Templeogue and the former hamlet, now a suburb in its own right, of Firhouse. A number of old cottages and farmhouses along the Knocklyon Road attest to the area’s rural past.", "image": "Knocklyon.jpg"}, "Donnybrook": {"summary": "Donnybrook (Irish: Domhnach Broc, meaning 'The Church of Saint Broc') is a district of Dublin, Ireland. It is situated on the southside of the city, in the Dublin 4 postal district, and is home to the Irish public service broadcaster Raidió Teilifís Éireann (RTÉ). It was once part of the Pembroke Township. Its neighbouring suburbs are Ballsbridge, Sandymount, Ranelagh and Clonskeagh. \nDonnybrook is also a civil parish mainly situated in the old barony of Dublin.", "image": "Donnybrook.jpg"}, "Artane": {"summary": "Artane, sometimes spelled Artaine (Irish: Ard Aidhin), historically Tartaine is a northside suburb of Dublin city, Ireland. It is also a civil parish in the ancient barony of Coolock. Neighbouring districts include Kilmore West, Coolock, Beaumont, Killester, Raheny and Clontarf; to the south is a small locality, Harmonstown, straddling the Raheny-Artane border. Artane is also a parish in the Fingal South East deanery of the Roman Catholic Archdiocese of Dublin.", "image": "Artane.jpg"}, "Harolds Cross": {"summary": "Harold's Cross (Irish: Cros Araild, meaning 'Harold's Cross') is an urban village and inner suburb on the south side of Dublin, Ireland.  The River Poddle runs through it, and it holds both a major cemetery, Mount Jerome, and Our Lady's Hospice.", "image": "Harolds Cross.jpg"}, "Raheny": {"summary": "Raheny (Ráth Eanaigh in Irish) is a northern suburb of Dublin, Ireland, halfway from the city centre to Howth. It is centred on a historic settlement, first documented in 570 CE (Mervyn Archdall). The district shares Dublin's two largest municipal parks, Saint Anne's Park and Bull Island with its 4.5 km beach, with neighbouring Clontarf, and is crossed by several small watercourses.\nRaheny is also a civil parish in the ancient barony of Coolock. The coastal hamlet grew rapidly in the 20th century and is now a mid-density Northside suburb with a village core.", "image": "Raheny.jpg"}, "Ringsend": {"summary": "For the village in Northern Ireland, see Ringsend, County Londonderry; and for the hamlet in the English county of Cambridgeshire, see Ring's End\n\nRingsend (Irish: An Rinn) is a southside inner suburb of Dublin, Ireland. It is located on the south bank of the River Liffey and east of the River Dodder, about two kilometres east of the city centre. It is the southern terminus of the East Link Toll Bridge. Areas included in Ringsend are the south side of the Dublin Docklands, and at the west end is the area of South Lotts and part of the Grand Canal Dock area. Neighbouring areas include Irishtown, Sandymount and the Beggars Bush part of Ballsbridge to the south, and the city centre to the west.  A key feature of the area is the chimneys of Poolbeg power station.\nFormerly the point where ships arriving from across the Irish Sea would dock, Ringsend went into decline in the 19th and 20th centuries, when the shipping moved to other locations, although there is still some container shipping.", "image": "Ringsend.jpg"}, "Terenure": {"summary": "Terenure (Irish: Tír an Iúir, meaning 'land of the yew tree'), originally called Roundtown, is a mainly residential suburb of Dublin, Ireland, largely in the administrative area of Dublin City Council but with parts in the administrative county of South Dublin (within the Terenure-Templeogue electoral area).", "image": "Terenure.jpg"}, "Ranelagh": {"summary": "Ranelagh ( RAN-ə-lə, locally pronounced ; Irish: Raghnallach) is a residential area and urban village on the south side of Dublin, Ireland in the postal district of Dublin 6.", "image": "Ranelagh.jpg"}, "North Strand": {"summary": "North Strand (Irish: An Trá Thuaidh ) is a residential inner city neighbourhood on the Northside of Dublin, Ireland.", "image": "North Strand.jpg"}, "Tallaght": {"summary": "Tallaght ( TAL-ə; Irish: Tamhlacht, IPA: [ˈt̪ˠəul̪ˠəxt̪ˠ]) is the largest settlement, and county town, of South Dublin, Ireland, and the largest suburb of Dublin.  The central village area was the site of a monastic settlement from at least the 8th century, which became one of medieval Ireland's more important monastic centres.Up to the 1960s Tallaght was a small village in the traditional County Dublin (now the Dublin Region), linked to several nearby rural areas which were part of the large civil parish of the same name - the local council estimates the then population at 2,500. Suburban development began in the 1970s and a town centre area has been developing since the late 1980s. There is no legal definition of the boundaries of Tallaght, but the electoral divisions known as \"Tallaght\" followed by the name of a locality have, according to the 2016 census, a population of 76,119, up from 69,454 over five years. There have been calls in recent years for Tallaght to be declared a city.The village core of the district is located north of, and near to, the River Dodder, and parts of the broader area within South Dublin are close to the borders of Dublin City, Kildare, Dún Laoghaire–Rathdown and County Wicklow. Several streams flow in the area, notably the Jobstown or Tallaght Stream (a tributary of the Dodder), and the Fettercairn Stream (a tributary of the River Camac), while the Tymon River, the main component of the River Poddle (Liffey tributary), rises in Cookstown, near Fettercairn.\nTallaght is also the name of an extensive civil parish, which includes other areas of southern and southwestern Dublin, from Templeogue to Ballinascorney in the mountains.  A book about the civil parish was published in the 19th century, \"The History and Antiquities of Tallaght in the County of Dublin,\" written by William Domville Handcock.", "image": "Tallaght.jpg"}, "Killester": {"summary": "Killester (Irish: Cill Easra) is a small, largely residential, suburb of Dublin, Ireland on the Northside of the city.\n\nKillester is also a civil parish in the ancient barony of Coolock.", "image": "Killester.jpg"}, "Templeogue": {"summary": "Templeogue (from Irish: Teach Mealóg, meaning \"New Church of Saint Mel\") is a southwestern residential suburb of Dublin in Ireland. It lies between the River Poddle and River Dodder, and is about halfway from Dublin's centre to the mountains to the south.", "image": "Templeogue.jpg"}, "Drumcondra": {"summary": "Drumcondra (Irish: Droim Conrach, meaning 'Conra's Ridge') is a residential area and inner suburb on the Northside of Dublin, Ireland. It is administered by Dublin City Council. The River Tolka and the Royal Canal flow through the area.", "image": "Drumcondra.jpg"}, "Merrion": {"summary": "Merrion is a suburban area located about 4 km south east of Dublin City, situated along the Merrion Road between Ballsbridge to the north and Booterstown to the south.\nThis stretch of road, about 1 km long contains a shopping mall (the Merrion Centre), St. Vincent's University Hospital, a Catholic church, the Merrion Inn public house, a petrol station, a bank, restaurant and various other retail outlets.\nIt lies within the Dublin City Council area ends on the border between Dun Laoghaire-Rathdown County Council and Dublin City Council near Merrion Gates.", "image": "Merrion.JPG"}, "Pembroke": {"summary": "Pembroke Township was an area adjoining the city of Dublin, Ireland, formed for local government purposes by private Act of Parliament in 1863. The township took its name from the fact that most of the area was part of the estate of the Earl of Pembroke. The township was governed by commissioners until 1899 when it became an Urban District. In 1930 Pembroke Township was absorbed by the City and County Borough of Dublin.", "image": "Pembroke.jpg"}, "Rathgar": {"summary": "Rathgar (Irish: Ráth Garbh, meaning 'rough ringfort'), originally a village, from 1862 part of the township Rathmines and Rathgar, in 1930 became a suburb of Dublin, Ireland. It lies about 3 kilometres south of the city centre.", "image": "Rathgar.jpg"}, "Dartry": {"summary": "Dartry (Irish: Dartraí) is a small suburb of Dublin, Ireland, often seen as part of the broad Rathmines area. Among the locations in Dartry are Dartry Road, Temple Road, Orwell Park and Palmerston Park.", "image": "Dartry.jpg"}, "Milltown": {"summary": "Milltown (Irish: Baile an Mhuilinn) is a suburb on the southside of Dublin, Ireland. The townland got its name well before the 18th or 19th century. Both Milltown and Clonskeagh were \"Liberties\" of Dublin, following the English invasion and colonisation in 1290. Milltown was the site of several working mills on the River Dodder and is also the location of the meeting of the River Slang with the Dodder.", "image": "Milltown.jpg"}, "Arbour Hill": {"summary": "Arbour Hill (Irish: Cnoc an Arbhair) is an inner city area of Dublin, on the Northside of the River Liffey, in the Dublin 7 postal district.  Arbour Hill, the road of the same name, runs west from Blackhall Place in Stoneybatter, and separates Collins Barracks, now part of the National Museum of Ireland, to the south from Arbour Hill Prison to the north, whose graveyard includes the burial plot of the signatories of the Easter Proclamation that began the 1916 Rising. \nThe Irish composer Vincent Kennedy set a movement entitled \"Arbour Hill\" as part of his commissioned Symphonic work \"IRISHMEN AND IRISHWOMEN\" in 1916. The movement is a moving tribute to the 1916 signatories and leaders buried at Arbour Hill graveyard. \n\n\n== References ==", "image": "Arbour Hill.JPG"}, "North Circular Road": {"summary": "The North Circular Road (Irish: An Cuarbhóthar Thuaidh) - designated as R101 regional road - is an important thoroughfare on the northside of Dublin, in Ireland. The regional road was long considered the northern boundary of the city and still separates the city centre from the inner suburbs. It runs from the Phoenix Park in the west through Phibsboro, to North Wall in the east. A number of important institutions are located along the road, including the Mater Hospital, Dalymount Park and Mountjoy Prison, and both Croke Park and St. Brendan's Hospital are nearby.\nThe R101 and the NCR overlap for most of their lengths, and the entire NCR forms a section of the R101. In the west the R101 connects the NCR to Parkgate Street via the short Infirmary Road ; at the eastern end the R101 becomes Portland Row after the junction with Summerhill. It continues the northern loop through Saville Place , then turning east for its final kilometre via Sheriff Street (Upper) before terminating at North Wall Road (the R131). \nThe official description of the R101 from the Roads Act 1993 (Classification of Regional Roads) Order 2012  reads:\n\nR101: North Circular Road, DublinBetween its junction with R109 at Parkgate Street and its junction with R147 at Dalymount via Infirmary Road and North Circular Road all in the city of Dublinandbetween its junction with R135 at Berkeley Road and its junction with R131 at East Wall Road via North Circular Road, Portland Row, Seville Place, Sheriff Street Lower and Sheriff Street Upper all in the city of Dublin.", "image": "North Circular Road.jpg"}, "Cabra": {"summary": "Cabra (Irish: An Chabrach, meaning 'the poor land')   is an inner suburb on the northside of Dublin city in Ireland. It is approximately 2 kilometres (1.2 mi) northwest of the city centre, in the administrative area of Dublin City Council. It was commonly known as Cabragh until the early 20th century.  Largely located between the Royal Canal and the Phoenix Park, it is primarily a residential suburb, with a range of institutions and some light industry. Cabra is served by bus, tram and mainline rail; it lies across Navan Road, one of the main roads from central Dublin to the orbital motorway.", "image": "Cabra.jpg"}, "Rathmines": {"summary": "Rathmines (Irish: Ráth Maonais, meaning 'ringfort of Maonas') is an inner suburb on the southside of Dublin, about 3 kilometres south of the city centre. It effectively begins at the south side of the Grand Canal and stretches along the Rathmines Road as far as Rathgar to the south, Ranelagh to the east and Harold's Cross to the west. It is situated in the city's Dublin 6 postal district.\nRathmines has thriving commercial and civil activity and is well known across Ireland as part of a traditional \"flatland\" - providing rented accommodation to newly arrived junior civil servants and third level students coming from outside the city since the 1930s. In more recent times, Rathmines has diversified its housing stock and many houses have been gentrified by the wealthier beneficiaries of Ireland's economic boom of the 1990s. Rathmines, nonetheless, is often said to have a cosmopolitan air, and has a diverse international population and has always been home to groups of new immigrant communities and indigenous ethnic minorities.\nIn the 2006 Census, Rathmines had a population of 38,106.", "image": "Rathmines.jpg"}, "Islandbridge": {"summary": "Island Bridge (Irish: Droichead na hInse) (formerly Sarah or Sarah's Bridge) is a road bridge spanning the River Liffey, in Dublin, Ireland and joining the South Circular Road to Conyngham Road at the Phoenix Park.\nIsland Bridge and the surrounding area are so named because of the island formed here by the creation of a mill race towards the right bank while the main current flows to the left. The River Camac emerges from a tunnel further downstream towards Dublin Heuston railway station.", "image": "Islandbridge.JPG"}, "Phibsborough": {"summary": "Phibsborough (; Irish: Baile Phib), also spelled Phibsboro, is a mixed commercial and residential neighbourhood on the Northside of Dublin, Ireland.\nThe Bradogue River crosses the area in a culvert, and the Royal Canal passes through its northern reaches, notably at Cross Guns Bridge. Formerly, a branch of the canal ran to the Broadstone basin, later the site of the Midland Great Western Railway Terminus and currently the headquarters of Bus Éireann. Mountjoy Prison is located in the district.", "image": "Phibsborough.jpg"}, "South Circular Road": {"summary": "The South Circular Road (Irish: An Cuarbhóthar Theas) is a road in Dublin, Ireland, one of the longest in the city. It runs from Kilmainham in the west of the city, through Rialto and Dolphin's Barn to Portobello, near the centre. As it runs mainly through residential areas, it is used by numerous bus routes.", "image": "South Circular Road.jpg"}, "Navan Road": {"summary": "County Dublin (Irish: Contae Bhaile Átha Cliath or Contae Átha Cliath) is one of the thirty-two traditional counties of Ireland. Prior to 1994 it was also an administrative county covering the whole county outside of Dublin City Council. In 1994, as part of a reorganisation of local government within Dublin the boundaries of Dublin City were redrawn, Dublin County Council was abolished and three new administrative county councils were established: Dún Laoghaire–Rathdown, Fingal and South Dublin.\nWhile it is no longer used as an administrative division for local government, it retains a strong identity in popular culture. It is in the province of Leinster, and is named after the city of Dublin, the capital city of Ireland. County Dublin was one of the first parts of Ireland to be shired by John, King of England following the Norman invasion of Ireland. \nAccording to the 2016 census, the total population of County Dublin was 1,345,402, approximately 27% of the Republic of Ireland's population. The county is a NUTS 3 region, and is part of the NUTS 2 region of Eastern and Midland.", "image": "Navan Road.png"}, "Inchicore": {"summary": "Inchicore (Irish: Inse Chór, meaning 'Island of Sheep') is a suburb of Dublin, Ireland.", "image": "Inchicore.jpg"}, "Stoneybatter": {"summary": "Stoneybatter, historically known as Bohernaglogh (Irish: Bóthar na gCloch), is a neighbourhood of Dublin, Ireland, on the Northside of the city between the River Liffey, the North Circular Road, Smithfield Market, and Grangegorman.  It is in the Dublin 7 postal district.", "image": "Stoneybatter.jpg"}, "Smithfield": {"summary": "Smithfield (Irish: Margadh na Feirme, meaning 'Farm Market') is an area on the Northside of Dublin. Its focal point is a public square, formerly an open market, now officially called Smithfield Plaza, but known locally as Smithfield Square or Smithfield Market.\nNotable landmarks include the Old Jameson Whiskey Distillery and the Observation Tower.\nNotable businesses include the children's animation studio Brown Bag Films.\nHistorically, Smithfield was a suburb of Oxmantown and lay within the civil parish of St. Paul's. There is no general agreement on the extent of the area known as Smithfield, but it roughly incorporates the area bounded by the River Liffey to the south, Bow Street to the east, Queen Street to the west, and North Brunswick street in the suburb of Grangegorman to the north.", "image": "Smithfield.jpg"}, "Dolphins Barn": {"summary": "Dolphin's Barn (Irish: An Carnán, meaning 'the parcel') is an inner city suburb of Dublin, Ireland, situated on the Southside of the city in the Dublin 8, and partially in the Dublin 12, postal district. Its name derives from a family named Dolphyn who once owned a prominent storehouse there. Surrounding areas include The Liberties, Inchicore, Islandbridge, Kilmainham and Crumlin. It is home to one of the city's fire stations which is situated on the corner of Parnell Road and Rutland Avenue. The Grand Canal passes through the centre of the locality under Dolphin's Barn Bridge.\nThe Dublin marathon passes down South Circular Road in Dolphin's Barn.", "image": "Dolphins Barn.JPG"}, "Kilmainham": {"summary": "Kilmainhamwood, historically simply Killmainham (Irish: Cill Mhaighneann), is a village and townland in north County Meath, Ireland. The village is built on the River Dee and is situated north of Whitewood Lake. The town is located on local roads. Neighbouring parishes are Kingscourt to the north, Drumconrath to the east, Nobber to the south-east, Moynalty to the south and Bailieborough to the west.", "image": "Kilmainham.jpg"}, "Glenageary": {"summary": "Glenageary (Irish: Gleann na gCaorach [ɟlʲaːnˠ nˠə ˈɡeːɾˠə], meaning \"Glen of the Sheep\") is an area in the suburbs of Dún Laoghaire–Rathdown, Ireland. While there is no officially defined boundary, it is surrounded by the areas of Dalkey, Dún Laoghaire, Glasthule, Johnstown, Killiney and Sallynoggin. The Church of Ireland does have a defined boundary for the Parish of Glenageary. \nOn early 20th century maps, Glenageary and Sallynoggin are considered to be the same place and it was not until the building of local authority houses in the late 1940s and 1950s in the townlands of Honeypark and Thomastown by Dún Laoghaire Borough Corporation that a clear distinction between Sallynoggin and Glenageary was created. \nThe Roman Catholic Parish of Glenageary covers all of Upper Glenageary Road, Bellevue, Avondale, Adelaide and Silchester Roads.", "image": "Glenageary.jpg"}, "Cork Street": {"summary": "Cork Street (Irish: Sráid Chorcaí) runs from the junction of The Coombe to Donore Avenue.", "image": "Cork Street.JPG"}, "Rialto": {"summary": "The Rialto is a central area of Venice, Italy, in the sestiere of San Polo. It is, and has been for many centuries, the financial and commercial heart of the city. Rialto is known for its prominent markets as well as for the monumental Rialto Bridge across the Grand Canal.", "image": "Rialto.jpg"}, "Monkstown": {"summary": "Monkstown (Irish: Baile na Manach), historically known as Carrickbrennan (Irish: Carraig Bhraonáin), is a suburb in south Dublin, located in Dún Laoghaire–Rathdown, Ireland. It is on the coast, between Blackrock and Dún Laoghaire.\nThe lands of the Carrickbrennan estate form the greater part of the civil parish of Monkstown.", "image": "Monkstown.JPG"}, "Christchurch": {"summary": "Christ Church Cathedral, more formally The Cathedral of the Holy Trinity, is the cathedral of the United Dioceses of Dublin and Glendalough and the cathedral of the ecclesiastical province of the United Provinces of Dublin and Cashel in the (Anglican) Church of Ireland. It is situated in Dublin, Ireland, and is the elder of the capital city's two medieval cathedrals, the other being St Patrick's Cathedral.", "image": "Christchurch.jpg"}, "Kinsealy": {"summary": "Kinsealy (officially Kinsaley; Irish: Cionn Sáile) is an outer suburb of Dublin in Fingal, Ireland.  Kinsealy is on the northside of the city, about 7 km from the centre city, on the Malahide Road, in the former green belt between the suburbs of Balgriffin, Portmarnock and Malahide.\nKinsaley is also the name of the surrounding electoral division and of a civil parish in the ancient barony of Coolock within the historic County Dublin.", "image": "Kinsealy.jpg"}, "Blackrock (Dublin)": {"summary": "Blackrock (Irish: An Charraig Dhubh) is a suburb of Dublin, Ireland, 3 km (1.9 mi) northwest of Dún Laoghaire.", "image": "Blackrock (Dublin).jpg"}, "Booterstown": {"summary": "Booterstown (Irish: Baile an Bhóthair, meaning 'town of the road') is a coastal townland and civil parish, situated in the county of Dún Laoghaire–Rathdown, about 7 km (4.3 mi) south of the city of Dublin in Ireland.", "image": "Booterstown.jpg"}, "Dalkey": {"summary": "Dalkey ( DAW-kee; Irish: Deilginis, meaning 'thorn island') is an affluent suburb of Dublin, and a seaside resort southeast of the city, and the town of Dún Laoghaire, in the historic County Dublin, Ireland. It was founded as a Viking settlement and became an active port during the Middle Ages. According to chronicler John Clyn (c.1286–c.1349), it was one of the ports through which the plague entered Ireland in the mid-14th century. In modern times, Dalkey has become a seaside suburb that attracts some tourist visitors. \nOne of Dublin's wealthiest districts, it has been home to writers and celebrities including Jane Emily Herbert, Maeve Binchy, Hugh Leonard, Bono, the Edge, Van Morrison and Enya. Dalkey lies within the jurisdiction of Dún Laoghaire–Rathdown County Council.", "image": "Dalkey.jpg"}, "Dun Laoghaire": {"summary": "Dún Laoghaire ( doon LEER-ee, Irish: [d̪ˠuːn̪ˠ ˈl̪ˠeːɾʲə] or [d̪ˠuːn̪ˠ ˈl̪ˠiːɾʲə]) is a suburban coastal town in the traditional county of Dublin in Ireland. It is the county town of Dún Laoghaire–Rathdown, one of the three authorities that replaced the old Dublin County Council.\nThe town was built following the 1816 legislation that allowed the building of a major port to serve Dublin. It was known as Dunleary until it was renamed Kingstown in honour of King George IV's 1821 visit, and in 1920 was given its present name, the original Irish form of Dunleary. Over time, the town became a residential location, a seaside resort and the terminus of Ireland's first railway.", "image": "Dun Laoghaire.JPG"}, "Donabate": {"summary": "Donabate (Irish: Domhnach Bat)  is a small coastal town in Fingal, Ireland, about 20 kilometres (12 miles) north-northeast of Dublin. The town is on a peninsula on Ireland's east coast, between the Rogerstown Estuary to the north and Broadmeadow Estuary to the south. Donabate is a civil parish in the ancient barony of Nethercross.", "image": "Donabate.jpg"}, "Balbriggan": {"summary": "Balbriggan (; Irish: Baile Brigín) is a town 34km from Dublin in the northern part of Fingal, Ireland. The 2016 census population was 21,722 for Balbriggan and its environs.", "image": "Balbriggan.jpg"}, "Santry": {"summary": "Santry (Irish: Seantrabh, meaning 'Old tribe') is a suburb on the northside of Dublin, Ireland, bordering Coolock, Glasnevin, Kilmore and Ballymun. It straddles the boundary of Dublin City Council and Fingal County Council jurisdictions.\nThe character of the area has changed in the last 100 years, from a district centred on a large estate, and later small village, to a modern, rather dispersed, mixed-use suburb. Much of the old village is gone and where there were once fields full of crops, and wild woodlands of all sorts, there are now housing estates, an athletics stadium, a shopping complex, industrial parks and busy roads leading to Dublin Airport.\nTrinity College Library has a depository at Santry which holds three million books.Santry is also the name of a civil parish in the ancient barony of Coolock.", "image": "Santry.jpg"}, "Beaumont": {"summary": "Beaumont is a northside suburb of Dublin city, Ireland, bordered by Donnycarney, Santry and Artane. It lies within the postal district of Dublin 9.", "image": "Beaumont.jpg"}, "Lusk": {"summary": "Lusk (Irish: Lusca) is a small town in \nFingal, Ireland. The town is located about 20 km (12 mi) north of Dublin city centre.", "image": "Lusk.jpg"}, "Whitehall": {"summary": "Whitehall (Irish: Fionnbhrú) is a Northside suburb of Dublin City, Ireland.\nWhitehall is a residential area on the northern outskirts of Dublin's inner city, located near the M1 motorway leading to Dublin Airport, Swords and Belfast, it's situated between the suburbs of Santry and Drumcondra. North of Whitehall, the M1 motorway begins at its junction with the M50, past the Dublin Port Tunnel's northern entrance. The area is adjacent to the major public Beaumont Hospital and to Dublin City University on Collins Avenue.\nWhitehall takes its name from a house named White Hall, formerly located to the south of the village on Drumcondra Road Upper. The area commonly known as Whitehall Cross, at the intersection of the Swords Road (R132) (north-south) and Collins Avenue (east-west), is in the townland of Clonturk, and was formerly the site of a public house called The Thatch, whose memory is preserved in the name of a nearby road.", "image": "Whitehall.png"}, "Rush": {"summary": "Rush (Irish: Ros Eó, meaning 'peninsula of the yew trees' pronounced [ɾˠoːsˠ oː], officially An Ros) is a  small seaside town in Fingal, Ireland. It was one of the few towns of the historic County Dublin.  Rush lies on the Irish Sea coast, between Skerries and Lusk, and has a small harbour. It had a population at the 2011 census of 9,231.Rush was once viewed as the heart of market gardening in Leinster and many people were employed in agriculture. Nowadays, however, horticulture and agriculture have been superseded by Rush's increasing role as a \"commuter belt\" town.", "image": "Rush.jpg"}, "Portmarnock": {"summary": "Portmarnock (Irish: Port Mearnóg) is a coastal suburban settlement in Fingal, Ireland, with significant beaches and one of Ireland's best-known golf clubs, a modest commercial core, and inland residential estates.\nPortmarnock is also a civil parish in the ancient barony of Coolock in the historic County Dublin. In the 2002 census the population was 8,975 and by 2011 had climbed to 9,285.", "image": "Portmarnock.jpg"}, "Portobello": {"summary": "Portobello (Irish: Cuan Aoibhinn – meaning 'beautiful harbour') is an area of Dublin located in the South City Centre, bounded to the south by the Grand Canal.\nPortobello came into existence as a small suburb south of the city of Dublin in the 18th century, centred on Richmond St. During the following century it was completely developed, transforming an area of private estates and farmland into solid Victorian red-bricked living quarters for the middle classes (on the larger streets), and terraced housing bordering the canal for the working classes.\nAs a fast-expanding suburb during the 19th century Portobello attracted many upwardly-mobile families whose members went on to play important roles in politics, the arts and the sciences. Towards the end of the century came an influx of Jews, refugees from pogroms in Eastern Europe, which gave the name \"Little Jerusalem\" to the area.\nIt is in the postal district of Dublin 8. It is in the local government electoral area of Dublin South East Inner City and the Dáil Constituency of Dublin Bay South.", "image": "Portobello.jpg"}, "Sandycove": {"summary": "Sandycove (Irish: Cuas an Ghainimh) is a suburb of Dublin, Ireland. It is south east of Dún Laoghaire and Glasthule, and north west of Dalkey. It is a popular seaside resort and is well known for its bathing place, the Forty Foot, which in the past was reserved for men only but is now available for mixed bathing. The locale features in the opening of Ulysses by James Joyce.", "image": "Sandycove.jpg"}, "The Coombe": {"summary": "The Coombe (; Irish: An Com) is a historic street in the south inner city of Dublin, Ireland. It was originally a hollow or valley where a tributary of the River Poddle, the Coombe Stream or Commons Water, ran.   The name is sometimes used for the broader area around, in which the Poddle and its related watercourses featured strongly.", "image": "The Coombe.jpg"}, "Bohermore": {"summary": "Bohermore (Irish: An Bóthar Mór, meaning 'The Big Road') is an area of Galway, Ireland. It got this name as it was the main road into Galway City from the east in medieval times.\nThere is a large cemetery located in Bohermore known as the \"New Cemetery\", which contains two mortuary chapels, one Catholic and the other Protestant. People buried there include the Irish-language writer and journalist Pádraic Ó Conaire (1882-1928), Lord Haw Haw (William Joyce) (1906-1946), an Irish-American who broadcast Nazi propaganda from Germany during World War II, and Lady Gregory (1852-1932), a founding member of the Irish Literary Theatre movement, who hosted a literary and artistic salon in her house at Coole Park, in rural south Galway.", "image": "Bohermore.jpg"}, "Malahide": {"summary": "Malahide (ma-la-HYD; Irish: Mullach Íde) is an affluent coastal settlement in Fingal, County Dublin, Ireland, situated approximately 18 km north-east of Dublin city.  It has a village centre surrounded by suburban housing estates, with a population over 16,000.\nMalahide Castle dates from the 12th century and is surrounded by a large park, part of which incorporates an international cricket ground.  The area also features a sandy beach, a marina, and a variety of sporting clubs.", "image": "Malahide.JPG"}, "Lucan": {"summary": "Lucan ( LOO-kən; (Irish: \"leamhacán\" place of marsh-mallow plant) is a suburban town located roughly 12 km west of Dublin city centre, on the River Liffey near the Strawberry Beds and Lucan Weir, and at the confluence of the River Griffeen. The majority of the area lies under the jurisdiction of South Dublin county council while a small portion north of the Liffey, including Laraghcon, Westmanstown, St Catherine's Park and Lucan Demesne, lies under Fingal council control. Main road access is from the N4 bypass, and the M50 orbital motorway at junction 7.", "image": "Lucan.jpg"}, "Mount Merrion": {"summary": "Mount Merrion (Irish: Cnoc Mhuirfean) is an affluent suburban area of Dublin, Ireland. It is roughly 7 kilometres (5 mi) south of Dublin city centre and is situated on and around the hill of the same name.", "image": "Mount Merrion.JPG"}, "Shankill": {"summary": "Shankill (Irish: Seanchill, meaning 'Old Church') is a suburb of Dublin, Ireland, situated in the administrative area of Dún Laoghaire–Rathdown. Located in the south-east of County Dublin, close to the border with County Wicklow, it has a population of 14,257 (2016 census).", "image": "Shankill.jpg"}, "Claregalway": {"summary": "Baile Chláir or Baile Chláir na Gaillimhe (anglicized Claregalway) is a Gaeltacht village about 10 km north of Galway in County Galway, Ireland. Claregalway was founded on the banks of the River Clare, hence the derivation of its name: Baile Chláir na Gaillimhe meaning \"town on the Clare, in Galway\". Claregalway lies within the Gaeltacht and traditionally most of the locals would have spoken English only as a second language. Until September 2017, the village sat at the junction of the busy N17 and N18 national primary routes with over 27,000 vehicles having formerly passed through the village every day.", "image": "Claregalway.jpg"}, "Stillorgan": {"summary": "Stillorgan (Irish: Stigh Lorgan, also Stigh Lorcáin and previously Tigh Lorcáin or Teach Lorcáin), formerly a village in its own right, is now a suburban area of Dublin in Ireland. Stillorgan is located in Dún Laoghaire–Rathdown, and contains many housing estates, shops and other facilities, with the old village centre still present. Stillorgan is at least partly contiguous with Kilmacud and neighbours other southside districts such as Mount Merrion, Sandyford, Leopardstown, Dundrum, Blackrock, Goatstown and Foxrock.\nThe suburban region defined as the Stillorgan ward (electoral area) of Dún Laoghaire–Rathdown, an area considerably larger than Stillorgan village, had a population of 19,840 at the 2006 census.", "image": "Stillorgan.jpg"}, "Ballinasloe": {"summary": "Ballinasloe ( bal-en-a-SLOH; Irish: Béal Átha na Sluaighe, meaning 'mouth of the ford of the crowds') is a town in the easternmost part of County Galway in Connacht. It is one of the largest towns in County Galway with a population of 6,662 people as of the 2016 census.", "image": "Ballinasloe.jpg"}, "Athenry": {"summary": "Athenry (; Irish: Baile Átha an Rí, meaning 'Town of the Ford of the King') is a town in County Galway, Ireland, which lies 25 kilometres (16 mi) east of Galway city. Some of the attractions of the medieval town are its town wall, Athenry Castle, its priory and its 13th century Anglo-Norman street-plan. The town is also well known by virtue of the song \"The Fields of Athenry\".", "image": "Athenry.jpg"}, "Barna": {"summary": "Bearna (anglicised as Barna) is a coastal village in Connemara, west of Galway city in County Galway, Ireland, on the R336 regional road. Once a satellite of Galway city, the village is now rapidly becoming one of its suburbs. Officially, the village is regarded as Irish speaking and is therefore a constituent part of the regions of Ireland that make up the Gaeltacht. However, because of its absorption into the city, it has recently become a mainly English-speaking village. Nonetheless, Irish is still the main language of its western and northern hinterland and the village has now effectively become the gateway to the largest Irish-speaking region in the country.To try to control the major development which has been undertaken in recent years, a very strongly supported local action group has been set up (Pobal Bhearna). In 1976 a community development group called Comharchumann Bearna Teo was formed after five local men put up the purchase money for 2 acres (8,100 m2) at Troscaigh Thiar to be used for community purposes and has succeeded in developing several recreational facilities.", "image": "Barna.jpg"}, "Rathcoole": {"summary": "Rathcoole (Irish: Rath Cúil, meaning 'ringfort of Comhaill or Cumhaill') is an outer suburban village, south west of the city of Dublin, in the jurisdiction of South Dublin, Ireland.\nRathcoole is also a civil parish in the Barony of Newcastle.", "image": "Rathcoole.jpg"}, "Ballybrit": {"summary": "Ballybrittas (Irish: Baile Briotáis, meaning 'town of the palisade') is a small village in the northeast of County Laois, Ireland situated on the R445 about 5 km SW of Monasterevin, County Kildare. Formerly on the N7 Dublin - Limerick road, the village is now bypassed by the M7 motorway.", "image": "Ballybrit.jpg"}, "Saggart": {"summary": "Saggart (Irish: Teach Sagard) is a village in South Dublin, Ireland, south west of Dublin city. It lies between the N7 (Naas Road), Rathcoole, and Tallaght.  It is one of the fastest growing settlements in Ireland, showing a population increase of 46.1% between 2011 and 2016.", "image": "Saggart.jpg"}, "Killiney": {"summary": "Killiney (Irish: Cill Iníon Léinín, meaning 'Church of the Daughters of Léinín') is an affluent seaside resort and suburb in Dún Laoghaire–Rathdown, Ireland. It lies south of neighbouring Dalkey, and north of Shankill. The place grew around the 11th century Killiney Church, and became a popular seaside resort in the 19th century. It is part of the Dáil Éireann constituency of Dún Laoghaire.", "image": "Killiney.JPG"}, "Doughiska": {"summary": "Doughiska (Irish: Dabhach Uisce, 'water pond, water basin') is a fast-growing suburb of Galway City in County Galway, Ireland. There is now continuous urban development between Doughiska and the city centre due to the growth of Galway City in recent years.", "image": "Doughiska.jpg"}, "Howth": {"summary": "Howth ( HOHTH; Irish: Binn Éadair, meaning 'Éadar's peak') is a village and outer suburb of Dublin, Ireland. The district as a whole occupies the greater part of the peninsula of Howth Head, which forms the northern boundary of Dublin Bay.\nHowth has been settled since prehistoric times, and features in Irish mythology. A fishing village and small trading port from at least the 14th century, Howth has grown to become a busy and affluent suburb of Dublin, with a mix of suburban residential development, wild hillside and heathland, golf courses, cliff and coastal paths, a small quarry and a busy commercial fishing port. The only neighbouring district on land is Sutton. Howth is also home to one of the oldest occupied buildings in Ireland, Howth Castle.Howth is also a civil parish in the ancient barony of Coolock.", "image": "Howth.jpg"}, "Skerries": {"summary": "Skerries (Irish: Na Sceirí, meaning 'Rocky Islands') is a coastal town in Fingal, Ireland. Historically Skerries was a fishing port and later a centre of hand embroidery. These industries declined in the early 20th century however, and it became both a resort town and a commuter town for Dublin.", "image": "Skerries.JPG"}, "Swords": {"summary": "Swords (Irish: Sord [sˠoːɾˠd̪ˠ] or Sord Cholmcille) is the county town of Fingal and a large suburban town on the Northside of Dublin.  Lying ten kilometres north of the city centre, on the Ward River, and reputedly founded around 560 A.D., it features a restored medieval castle, a holy well from which it takes its name, a round tower and a Norman tower.  Near to Dublin Airport, Swords is also home to one of the Dublin region's larger shopping centres, The Pavilions, extensive other retail facilities and a range of industries.  Extensive suburban housing estates lie around the town centre, with several parks and many schools and sporting facilities.\nThe name \"Swords\" is also applicable to a townland, to the civil parish, within the historic County Dublin, and to the local electoral area.", "image": "Swords.jpg"}, "Clifden": {"summary": "Clifden (Irish: An Clochán, meaning \"stepping stones\") is a coastal town in County Galway, Ireland, in the region of Connemara, located on the Owenglin River where it flows into Clifden Bay. As the largest town in the region, it is often referred to as \"the Capital of Connemara\". Frequented by tourists, Clifden is linked to Galway city by the N59.", "image": "Clifden.JPG"}, "Ballybane": {"summary": "County Galway ( GAWL-way; Irish: Contae na Gaillimhe) is a county in Ireland. It is located in the West of Ireland, part of the province of Connacht.\nThere are several Irish-speaking areas in the west of the county. The traditional county includes, and is named for, the city of Galway, but the city and county now have separate local authorities: Galway City Council administers the urban area, while the rest of the county is administered by Galway County Council.\nThe population of the county was 258,058 at the 2016 census.", "image": "Ballybane.png"}, "Portumna": {"summary": "Portumna (Irish: Port Omna - meaning 'the landing place of the oak') is a market town in the south-east of County Galway, Ireland, on the border with and linked by a bridge to County Tipperary. The town is located to the west of the point where the River Shannon enters Lough Derg. This historic crossing point over the River Shannon between counties Tipperary and Galway has a long history of bridges and ferry crossings. On the south-western edge of the town lie Portumna Castle and Portumna forest park.", "image": "Portumna.jpg"}, "Gort": {"summary": "Gort (Irish: Gort Inse Guaire or An Gort) is a town in south County Galway, in the west of Ireland. It lies just north of the border with County Clare on the old Galway–Limerick road, now the R458. Gort is situated in the territory of Uí Fiachrach Aidhne also known as Maigh Aidhne (\"the plain of Aidhne\"), which is coextensive with the diocese of Kilmacduagh / Cill Mhic Dhuach.", "image": "Gort.jpg"}, "Salthill": {"summary": "Salthill (Irish: Bóthar na Trá) is a seaside area in the City of Galway in the west of Ireland. Lying within the townland of Lenaboy (an Léana Buí), it attracts many tourists all year round. There is a 2 km long promenade, locally known as the Prom, overlooking Galway Bay with bars, restaurants and hotels.", "image": "Salthill.jpg"}, "Headford": {"summary": "Headford (Irish: Áth Cinn) is a town in County Galway, located 26 km north of Galway city in the west of Ireland. It is an angling centre for the eastern shore of Lough Corrib, and Greenfields, some 6.5 km west of the town, is its boating harbour. The town is situated next to the Black River (noted also for its trout angling) which is the county boundary with Mayo. Located on the N84 national secondary road from Galway to Castlebar and the R333, and R334 regional roads the town is a commuter town to Galway City. \nThe town is the centre of an area which contains a number of prehistoric burial cairns, Iron Age stone enclosures, early Norman and later castles, and several monastic sites. These include Ross Errilly Friary, founded in 1351, which is one of the best preserved monastic ruins of its period in Ireland.According to Central Statistics Office census of 2016, there were 973 people living in Headford in April 2016.", "image": "Headford.jpg"}, "Renmore": {"summary": "Renmore (An Rinn Mhór, meaning \"Big Point\") is a suburb of Galway City, Ireland, situated approximately 2 km to the east of the city. St Oliver Plunkett Church is located beside the primary school. Lough Atalia lies between Renmore and the city, which can be crossed using the public path beside the railway line (widely known as 'the line'). The primary school in Renmore is widely called Scoil Chaitriona the area also has an all Irish school named Gaelscoil Dara.\nRenmore is one of the widest suburbs of Galway city, running east along the coast and south of Dublin Road, from the shore of Lough Atalia on its west side to Lurgan Park on its east. The area houses approximately 5,000 people and includes Ballyloughaun beach, which also has camping facilities.\nGalway-Mayo Institute of Technology is one of the larger employers in the area.\nRenmore is also home to Dún Uí Mhaoilíosa (Mellow's Fort), a base of the Irish Army's Southern Brigade. The barracks – called \"Renmore Barracks\" under British rule when it was base to the Connaught Rangers and still widely known as such – is the base of the 1st Infantry Battalion and is located at the end of Renmore Road. The Department of Defence is also based in the area.There is also a private hospital called the Bon Secours.", "image": "Renmore.jpg"}, "Knocknacarra": {"summary": "County Galway ( GAWL-way; Irish: Contae na Gaillimhe) is a county in Ireland. It is located in the West of Ireland, part of the province of Connacht.\nThere are several Irish-speaking areas in the west of the county. The traditional county includes, and is named for, the city of Galway, but the city and county now have separate local authorities: Galway City Council administers the urban area, while the rest of the county is administered by Galway County Council.\nThe population of the county was 258,058 at the 2016 census.", "image": "Knocknacarra.png"}, "Castleisland": {"summary": "Castleisland (Irish: Oileán Ciarraí) is a town and commercial centre in County Kerry in south west Ireland. The town is known for the width of its main street. As of the 2016 Census, Castleisland had a population of 2,486.Castleisland was described by one of its citizens, journalist Con Houlihan, as \"not so much a town as a street between two fields\".", "image": "Castleisland.jpg"}, "Oranmore": {"summary": "Oranmore (Irish: Órán Mór) is a town and parish in County Galway on the outskirts of the city of Galway in the west of Ireland.\nOranmore is 9 km (5.6 mi) east of Galway City on the edge of Oranmore Bay, an inlet of Galway Bay.", "image": "Oranmore.jpg"}, "Mervue": {"summary": "County Galway ( GAWL-way; Irish: Contae na Gaillimhe) is a county in Ireland. It is located in the West of Ireland, part of the province of Connacht.\nThere are several Irish-speaking areas in the west of the county. The traditional county includes, and is named for, the city of Galway, but the city and county now have separate local authorities: Galway City Council administers the urban area, while the rest of the county is administered by Galway County Council.\nThe population of the county was 258,058 at the 2016 census.", "image": "Mervue.png"}, "Wellpark": {"summary": "Wellpark is a suburb of Galway city, Ireland. The area is bordered by the N6 Dublin Road to the south, the Tuam Road to the West and the suburb of Mervue on the east.", "image": "Wellpark.jpg"}, "Rahoon": {"summary": "County Galway ( GAWL-way; Irish: Contae na Gaillimhe) is a county in Ireland. It is located in the West of Ireland, part of the province of Connacht.\nThere are several Irish-speaking areas in the west of the county. The traditional county includes, and is named for, the city of Galway, but the city and county now have separate local authorities: Galway City Council administers the urban area, while the rest of the county is administered by Galway County Council.\nThe population of the county was 258,058 at the 2016 census.", "image": "Rahoon.png"}, "Loughrea": {"summary": "Loughrea ( lokh-RAY; Irish: Baile Locha Riach, meaning 'town of the grey/ speckled lake') is a town in County Galway, Ireland. The town lies to the north of a range of wooded hills, the Slieve Aughty Mountains, and the lake from which it takes its name. The town's cathedral, St Brendan's, dominates the town's skyline. The town has increased in population in the late 20th and early 21st centuries. Although the town also serves as a commuter town for the city of Galway, it also remains an independent market town.", "image": "Loughrea.jpg"}, "Roscam": {"summary": "Roscam is a medieval ecclesiastical site and National Monument located in County Galway, Ireland.", "image": "Roscam.JPG"}, "Moycullen": {"summary": "Moycullen (Irish: Maigh Cuilinn) is a Gaeltacht village in County Galway, Ireland, about 10 km (7 mi) northwest of Galway city. It is near Lough Corrib, on the N59 road to Oughterard and Clifden, in Connemara.\nMoycullen is now a satellite town of Galway with some residents commuting to the city for work, school, and business.", "image": "Moycullen.jpg"}, "Monivea": {"summary": "Monivea (Irish: Muine Mheá) is a village in County Galway, Ireland. It is located approximately 30 km from Galway City and 9 km from Athenry. \nIt was formerly part of the kingdom of the Soghain of Connacht. Monivea is known for its forest, Monivea Castle which now lies in partial ruins, and a well-preserved mausoleum. The mausoleum and castle were built by the Ffrench family, one of the \"Tribes of Galway\", who were also responsible for the distinctive layout of the greens in the centre of the village, which were used as drying stations for the linen (known as flax) of local industries. The forest, mausoleum and castle were left to the State by the last Ffrench, and the forest is now held by Coillte.\nThere are two small grocery shops one with a petrol station, a butcher shop, four pubs, a Garda station, a post office, a playground, a church in Ryehill, and Monivea National School.", "image": "Monivea.jpg"}, "Kilcullen": {"summary": "Kilcullen (Irish: Cill Chuilinn), formally Kilcullen Bridge, is a small town on the River Liffey in County Kildare, Ireland. Its population of 3,473 (2011 Census makes it the 12th largest settlement in County Kildare and the fastest growing in the county, having doubled in population from 1,483 in the census of 2002. It is situated primarily in the Barony of Kilcullen (in the Civil Parish of Kilcullen), with part in the Barony of Naas South (Civil Parish of Carnalway), and subsidiary areas include Logstown, Harristown, Carnalway and Brannockstown, Gilltown, Nicholastown, and Castlemartin.\nKilcullen Bridge replaced the original settlement of Kilcullen, now Old Kilcullen, in the centuries following the building of the great bridge at the future site of the town.  Other local historical features include Dun Ailinne, New Abbey and Castlemartin, for many years the home of media magnate Tony O'Reilly and his wife, horse-breeding shipping heiress Chryss Goulandris, and now owned by US billionaire John Malone.  In the town's hinterland are a number of stud farms.", "image": "Kilcullen.jpg"}, "Tuam": {"summary": "Tuam ( TEW-əm; Irish: Tuaim, meaning 'mound or burial-place' [t̪ˠuəmʲ]) is a town in Ireland and the second-largest settlement in County Galway. It is west of the midlands of Ireland, about 35 km (22 mi) north of Galway city. Humans have lived in the area since the Bronze Age while the historic period dates from the 6th century. The town became increasingly important in the 11th and 12th centuries in political and religious aspects of Ireland. The market-based layout of the town and square indicates the importance of commerce.", "image": "Tuam.jpg"}, "Oughterard": {"summary": "Oughterard (Irish: Uachtar Ard) is a small town on the banks of the Owenriff River close to the western shore of Lough Corrib in County Galway, Ireland. The population of the town in 2016 was 1,318. It is located about 26 km northwest of Galway on the N59 road. Oughterard is on the border of the Connemara region, and is the chief angling centre on Lough Corrib.", "image": "Oughterard.jpg"}, "Kenmare": {"summary": "Kenmare (Irish: An Neidín, meaning 'the little nest') is a small town in the south of County Kerry, Ireland. The name Kenmare is the anglicised form of Ceann Mara, meaning \"head of the sea\", referring to the head of Kenmare Bay.", "image": "Kenmare.jpg"}, "Woodquay": {"summary": "Wood Quay (Irish: An Ché Adhmaid) is a riverside area of Dublin that was a site of Viking settlement. The site is bounded on the north side by Wood Quay on the River Liffey, on the west by Winetavern Street, on the south by John's Lane and on the east by Fishamble Street. \nDublin Corporation acquired Wood Quay gradually between 1950 and 1975, finally announcing that it would be the location of their new offices. Large-scale archaeological excavations were conducted on the site by the National Museum of Ireland at intervals between 1974 and 1981. Finds made during the excavations of the site led to a significant, but ultimately unsuccessful, public campaign to halt the development. Artefacts from the excavations are now on display in the National Museum of Ireland. Most of the quay is now entirely occupied by Dublin City Council's Civic Offices. \nTwo bridges cross the river at Wood Quay, one at the eastern and the other at the western end. The bridge at the eastern end is Grattan Bridge, formerly known as Essex Bridge, named after 18th century parliamentarian Henry Grattan. This bridge, which resembles Westminster Bridge in London, was until the 18th century the most easterly and therefore the closest to the sea of the Liffey Bridges. The bridge at the westerly end of Wood Quay is O'Donovan Rossa Bridge named after the 19th century fenian.\nIn a later excavation between 1990 and 1993 further along the quay at Lower Exchange Street, an archaeological dig team unearthed a roundtower-like ruin from the 13th century called Isolde's Tower. This tower was first discovered in the 17th century, but most of it was destroyed and covered in. Because of the dig, the construction of underground parking facilities for a planned development on the site could not be constructed at their intended location. The tower ruins are now viewable through railings on Lower Exchange Street, and the car park ramp is further to the left.", "image": "Woodquay.jpg"}, "Dingle": {"summary": "Dingle (Irish: An Daingean or Daingean Uí Chúis, meaning \"fort of Ó Cúis\") is a town in County Kerry, Ireland. The only town on the Dingle Peninsula, it sits on the Atlantic coast, about 50 kilometres (30 mi) southwest of Tralee and 71 kilometres (40 mi) northwest of Killarney.Principal industries in the town are tourism, fishing and agriculture: Dingle Mart (livestock market) serves the surrounding countryside. In 2016 Dingle had a population of 2,050. Dingle is situated in a Gaeltacht region. An adult Bottlenose dolphin named Fungie has been courting human contact in Dingle Bay since 1983.", "image": "Dingle.jpg"}, "Killarney": {"summary": "Killarney (keh-LAR-nee; Irish: Cill Airne, meaning 'church of sloes'; pronounced [ˈcɪl̠ʲ ˈaːɾˠnʲə]) is a town in County Kerry, southwestern Ireland. The town is on the northeastern shore of Lough Leane, part of Killarney National Park, and is home to St Mary's Cathedral, Ross Castle, Muckross House and Abbey, the Lakes of Killarney, MacGillycuddy's Reeks, Purple Mountain, Mangerton Mountain, Paps Mountain, the Gap of Dunloe and Torc Waterfall. Its natural heritage, history and location on the Ring of Kerry make Killarney a popular tourist destination.Killarney won the Best Kept Town award in 2007, in a cross-border competition jointly organised by the Department of the Environment and the Northern Ireland Amenity Council. In 2011, it was named Ireland's tidiest town and the cleanest town in the country by Irish Business Against Litter.", "image": "Killarney.JPG"}, "Listowel": {"summary": "Listowel ( LISS-tohl; Irish: Lios Tuathail, meaning 'Tuathal's ringfort') is a Heritage town and a market town in County Kerry, Ireland, and is situated on the River Feale, 28 km (17 mi) from the county town, Tralee. The town of Listowel had a population of 4,820 according to the CSO Census 2016.Described by the organisers of Listowel's writers festival as the \"Literary Capital of Ireland\", a number of internationally known playwrights and authors have lived there, including Bryan MacMahon and John B. Keane.", "image": "Listowel.jpg"}, "Castledermot": {"summary": "Castledermot (Irish: Diseart Diarmada, meaning \"Dermot's Hermitage\") is an inland village in the south-east of Ireland in County Kildare, about 75 km (47 mi) from Dublin, and 10 km (6.2 mi) from the town of Carlow. The N9 road from Dublin to Waterford previously passed through the village but upon completion of a motorway bypass in 2010, it was redesignated the R448.", "image": "Castledermot.jpg"}, "Newcastle": {"summary": "County Galway ( GAWL-way; Irish: Contae na Gaillimhe) is a county in Ireland. It is located in the West of Ireland, part of the province of Connacht.\nThere are several Irish-speaking areas in the west of the county. The traditional county includes, and is named for, the city of Galway, but the city and county now have separate local authorities: Galway City Council administers the urban area, while the rest of the county is administered by Galway County Council.\nThe population of the county was 258,058 at the 2016 census.", "image": "Newcastle.png"}, "Kilcock": {"summary": "Kilcock (from Irish  Cill Choca, meaning 'Coca's Church') is a town and townland in the north of County Kildare, Ireland, on the border with County Meath. Its population of 6,093 makes it the ninth largest town in Kildare and 76th largest in Ireland. The town is located 35km (22 mi) west of Dublin, and is on the Royal Canal.\nLocal industries include a large Musgrave Group distribution centre, which supplies SuperValu and Centra stores across much of the country.", "image": "Kilcock.jpg"}, "Tralee": {"summary": "Tralee ( tra-LEE; Irish: Trá Lí, formerly Tráigh Lí, IPA: [t̪ˠɾˠaː ˈl̠ʲiː], meaning 'strand of the Lee River') is the county town of County Kerry in the south-west of Ireland. The town is on the northern side of the neck of the Dingle Peninsula, and is the largest town in County Kerry. The town's population including suburbs was 23,691 as of the 2016 census making it the 8th largest town, and 14th largest urban settlement in Ireland. Tralee is well known for the Rose of Tralee International Festival which has been held annually in August since 1959.", "image": "Tralee.jpg"}, "Newbridge": {"summary": "Newbridge, officially known by its Irish name Droichead Nua ([ˈd̪ˠɾˠɛçəd̪ˠ n̪ˠuə]), is a town in County Kildare, Ireland. While the nearby Great Connell Priory was founded in the 13th century, the town itself formed from the 18th century onwards, and grew rapidly alongside a military barracks which opened in the early 19th century. Taking on the name Newbridge (An Droichead Nua) in the 20th century, the town expanded to support the local catchment, and also as a commuter town for Dublin. Doubling in population during the 20 years between 1991 and 2011, its population of 22,742 in 2016 makes it the largest town in Kildare and the fifteenth-largest in Ireland.", "image": "Newbridge.jpg"}, "Kill": {"summary": "Kill (Irish: an Chill, meaning 'the church') is a village and parish in County Kildare, Ireland near the county's border with Dublin beside the N7. Its population was recorded as 3,348 people in the 2016 census.Kill is the birthplace of the Fenian John Devoy as well as home to two holders of the most senior ministry in the Irish government, the most powerful family in the 18th century Irish House of Commons and the birthplace of a leader of the opposition in the British House of Commons. The village won the European Entente Florale horticultural competition in 1987.", "image": "Kill.png"}, "Naas": {"summary": "Naas ( NAYSS; Irish: Nás na Ríogh, or An Nás [ən̪ˠ n̪ˠaːsˠ]) is the county town of County Kildare in Ireland. In 2016, it had a population of 21,393, making it the second largest town in County Kildare after Newbridge.", "image": "Naas.jpg"}, "Rathangan": {"summary": "Rathangan (; Irish: Ráth Iomgháin, meaning 'Iomghan's Fort') is a town in the west of County Kildare, Ireland, with a population of 2,374. It is located 65 km (40 mi) from the centre of Dublin, and 14 km (8.7 mi) from Kildare, at the intersection of the R401, R414, and R419 regional roads. The Slate River and the Grand Canal run through the town.\nRathangan is situated beside the Bog of Allen, and is in close proximity to the lowlands of the Curragh. In recent years, the town has grown significantly to become a big commuter base for people working in Dublin.", "image": "Rathangan.jpg"}, "Celbridge": {"summary": "Celbridge (; Irish: Cill Droichid) is a town and townland on the River Liffey in County Kildare,  Ireland. It is 23 km (14 mi) west of Dublin. Both a local centre and a commuter town within the Greater Dublin Area, it is located at the intersection of the R403 and R405 regional roads. As of the 2016 census, Celbridge was the third largest town in County Kildare by population, with over 20,000 residents.", "image": "Celbridge.jpg"}, "Clane": {"summary": "Clane (Irish: Claonadh) is a town in County Kildare, Ireland, 35.4 km (22 mi) from Dublin. Its population of 7,280 makes it the eighth largest town in Kildare and the 66th largest in Ireland. It is on the River Liffey. Clane gives its name to the associated townland, civil parish, electoral division and barony.", "image": "Clane.jpg"}, "Maynooth": {"summary": "Maynooth (; Irish: Maigh Nuad) is a university town in north County Kildare, Ireland. It is home to Maynooth University (part of the National University of Ireland and also known as the National University of Ireland, Maynooth) and St Patrick's College, a Pontifical University and Ireland's main Roman Catholic seminary. Maynooth is also the seat of the Irish Catholic Bishops' Conference and holds the headquarters of Ireland's largest development charity, Trócaire. Maynooth is located 24 kilometres (15 miles) west of central Dublin.", "image": "Maynooth.jpg"}, "Killorglin": {"summary": "Killorglin (Irish: Cill Orglan, meaning \"Orgla's Church\") is a town in County Kerry, Ireland. It is situated on the Ring of Kerry and the Wild Atlantic Way.\nAs of the 2016 CSO census, the town's population was 2,199. Killorglin is within the Reeks District tourist area, which is known for its outdoor activities, mountains walks and water sports. The town hall was built with the help of Andrew Carnegie. Fexco, a financial services company, was founded and is headquartered in Killorglin. In addition, the pharmaceutical firms Temmler and Astellas have small plants in the town. The town contains the ruins of Castle Conway. \nThe annual Puck Fair festival takes place in Killorglin over several days each August, and ends with the crowning and parading of a \"king\" wild goat.", "image": "Killorglin.jpg"}, "Leixlip": {"summary": "Leixlip ( or ; Irish: Léim an Bhradáin) is a town in north-east County Kildare, Ireland, near Dublin. Its location on the confluence of the River Liffey and the Rye Water has marked it as a frontier town historically: on the border between the ancient kingdoms of Leinster and Brega, as an outpost of The Pale, and on Kildare's border with County Dublin.\nAs of 2016, the population of the town was 15,504. It is the fourth largest town in Kildare, and the 29th largest in Ireland.", "image": "Leixlip.jpg"}, "Castlecomer": {"summary": "Castlecomer is a town in the north of County Kilkenny, Ireland. It is positioned at the meeting of N78 and R694 roads about 16 km (9.9 mi) north of Kilkenny city. At the 2016 census of the Central Statistics Office, the town's population included 1,502 people.The town has been associated with the coal mining industry since the 17th century, and is part of a discrete area called the Castlecomer Plateau. It is bounded on the east by the River Barrow, the west by the River Nore and dissected in the centre by the River Dinnin. \nThe name Castlecomer comes from the Irish Caislean an Chumai which means \"the Castle at the confluence of the Waters\", the \"waters\" referring to the rivers Deen, Brocagh and Cloghogue while the \"castle\" refers to the Norman castle built in 1171 on the mound opposite the gates to \"Castlecomer Demesne\".The town is located in the townland of the same name which is in the civil parish of the same name in the ancient barony of Fassadinin.", "image": "Castlecomer.jpg"}, "Callan": {"summary": "Callan (Irish: Callainn) is a market town in County Kilkenny in Ireland. Situated 16 km (10 mi) south of Kilkenny on the N76 road to Clonmel, it is near the border between County Tipperary. It is the second largest town in the county, and has a population of 2,475 as of the 2016 census. Callan is the chief town of the barony of the same name.", "image": "Callan.jpg"}, "Athy": {"summary": "Athy ( ə-THY; Irish: Baile Átha Í, meaning '[town of the] ford of Ae') is a market town at the meeting of the River Barrow and the Grand Canal in south-west County Kildare, Ireland, 72 kilometres southwest of Dublin.  A population of 9,677 (as of the 2016 census) makes it the sixth largest town in Kildare and the 50th largest in the Republic of Ireland, with a growth rate of approximately 60% since the 2002 census.", "image": "Athy.JPG"}, "Mountrath": {"summary": "Mountrath (Irish: Maighean Rátha, meaning 'homestead of the ringfort') is a small town in County Laois, Ireland.  The town lies on the R445 midway between Dublin and Limerick, exactly 96.5 km (60 mi) from both cities. The town was bypassed by the M7 motorway in 2010 leading to a significant easing of traffic congestion in the town. \nAs of the 2016 census, Mountrath had a population of 1,774. The river that flows through the town is called the Whitehorse and gets its name from the white colouring that was present in its water from the whiskey distillery that used to be in the centre of the town.", "image": "Mountrath.jpg"}, "Kells (Kilkenny)": {"summary": "Kells (Irish: Ceanannas) is a village in County Kilkenny in Ireland. It is about 15 km south of Kilkenny. It is situated on high ground to the south of the Kings River.\nKells Priory, though in ruins, is one of the best preserved in Ireland.\nKilree round tower and 9th century high cross, said to be the burial place of Niall Caille, is located 2 km south of Kells.\nThe champion racehorse Red Rum was bred at Rossenarra stud in Kells.\nOlympian Michelle Smith de Bruin lives in Kells.", "image": "Kells (Kilkenny).JPG"}, "Thomastown": {"summary": "Thomastown (Irish: Baile Mhic Andáin), historically known as Grennan, is a town in County Kilkenny in the province of Leinster in the south-east of Ireland. It is a market town along a stretch of the River Nore which is known for its salmon and trout, with a number of historical landmarks in the vicinity. Visitor attractions include Jerpoint Abbey, Kilfane Glen gardens, and Mount Juliet Golf Course.\nThomastown is a Local Electoral Area of County Kilkenny and includes the electoral divisions of Ballyhale, Ballyvool, Bennettsbridge, Bramblestown, Castlebanny, Clara, Coolhill, Dunbell, Famma, Freaghana, Goresbridge, Gowran, Graiguenamanagh, Inistioge, Jerpoint Church, Kilfane, Kiltorcan, Paulstown, Pleberstown, Powerstown, Shankill, Thomastown, Tullaherin, Ullard and Woolengrange.", "image": "Thomastown.jpg"}, "Monasterevin": {"summary": "Monasterevin (Irish: Mainistir Eimhín), also Monasterevan, is a town in County Kildare, Ireland. The town lies on the River Barrow and the Barrowline a canal branch of the Grand Canal. The population was 4,246 at the 2016 Census.", "image": "Monasterevin.jpg"}, "Freshford": {"summary": "Freshford (Irish: Achadh Úr, meaning 'fresh field') is a village and former town in the barony of Crannagh, County Kilkenny, Ireland.", "image": "Freshford.jpg"}, "Sallins": {"summary": "Sallins  (Irish: Na Solláin) is a town in County Kildare, Ireland, situated 3.5 km north of the town centre of Naas, from which it is separated by the M7 motorway. Sallins is the anglicised name of Na Solláin which means \"The Willows\".\nAccording to the official CSO Census of 2016 Sallins has a population of 5,849. The town expanded rapidly between the 2002 and 2016 census, almost doubling the population in those years. It is the 9th largest settlement in Kildare and the 78th largest in Ireland. \nSallins grew as a result of its position on both the Grand Canal and the Dublin to Cork railway line. Historically, the major employers in the town were Odlum's Flour Mills and a meat factory, although both have now closed.\nTheobald Wolfe Tone is buried near Sallins in Bodenstown graveyard. Each summer, Irish Republicans of various political and paramilitary groupings congregate at Sallins to hold commemorations at Tone's grave.", "image": "Sallins.jpg"}, "Carrick On Shannon": {"summary": "Carrick-on-Shannon (Irish: Cora Droma Rúisc, meaning 'weir of the marshy ridge') is the county town of County Leitrim in Ireland. It is the largest town in the county of Leitrim and the smallest county town in the entire country. A smaller part of the town lies in County Roscommon. The population of the town was 4,062 in 2016. It is situated on a strategic crossing point of the River Shannon. The Leitrim part of the town is in the civil parish of Kiltoghert which is in the ancient barony of Leitrim.", "image": "Carrick On Shannon.jpg"}, "Mountmellick": {"summary": "Mountmellick or Mountmellic (Irish: Móinteach Mílic) is a town in the north of County Laois, Ireland. It lies on the N80 national secondary road and the R422 and R423 regional roads.", "image": "Mountmellick.jpg"}, "Portarlington": {"summary": "Portarlington, historically called Cooletoodera (from Irish: Cúil an tSúdaire, meaning 'nook of the tanner'), is a town on the border of County Laois and County Offaly, Ireland. The River Barrow forms the border. The town was recorded in the 2016 census as having a population of 8,368.", "image": "Portarlington.jpg"}, "Portlaoise": {"summary": "Portlaoise (Pronounced ), or Port Laoise (Irish [pˠɔɾˠt̪ˠˈl̪ˠiːʃə]) is the county town of County Laois, Ireland. It is located in the South Midlands in the province of Leinster. The 2016 census shows that the town's population increased by 9.5% to 22,050, which is well above the national average of 3.8%. It is the most populous and also the most densely populated town in the Midlands Region, which has a total population of 292,301 at the 2016 census.  This also makes it the fastest growing of the top 20 largest towns and cities in Ireland.It was an important town in the medieval period, as the site of the Fort of Maryborough, a fort built by English settlers in the 16th century.\nPortlaoise is fringed by the Slieve Bloom mountains to the west and north-west and the Great Heath of Maryborough to the east. It is notable for its architecture, engineering and transport connections.\nOn the national road network, Portlaoise is located 94 km (58 mi) west-southwest from Dublin on the M7, 170 km (106 mi) north-east from Cork on the M8/M7 and 114 km (71 mi) east-northeast from Limerick on the M7.\nIt was once known for the manufacture of iron and steel buildings, tennis balls, rubber seals, tyres and electrical cabling. Today Portlaoise is a commercial centre, with the economy dominated by the service sector, and a hub of shopping, transport, and events for the surrounding catchment.", "image": "Portlaoise.jpg"}, "Castletroy": {"summary": "Castletroy (Irish: Caladh an Treoigh) is a suburb of Limerick, Ireland.\nHistorically, the district was entirely separate to Limerick, and consisted of little development aside from the villages of Annacotty and Monaleen.  With the creation of the University of Limerick, as well as the growth of Limerick city itself, this began to change. Castletroy is one of the fastest-growing residential areas in Ireland and has now engulfed the old villages of Annacotty and Monaleen (Móin a lín - field of flax).\nCastletroy includes three primary schools Milford NS, Monaleen NS and a Gaelscoil (Gaelscoil Chaladh an Treoigh), the secondary school, Castletroy College, and a number of hotels including the Kilmurry Lodge Hotel and Castletroy Park Hotel. It is also host to both Milford and Monaleen GAA Clubs.\nCastletroy Golf Course is well known and divides Monaleen and Castletroy itself. Kilbane, Castletroy Heights, Monaleen Heights and Monaleen Park were the original housing developments and were once surrounded by farmland. These houses are the oldest.\nRecent developments include numerous sprawling housing estates, with much of the new development concentrated near Castletroy College. The Castletroy Shopping Centre extends to some 90,000 square feet (8,400 m2) and is located off Dublin road at Kilmurray roundabout adjacent to the Briarfield estate. It includes a SuperValu supermarket and 24 mall shops, McDonald's restaurant and an eight-screen Odeon cinema. Lidl have recently opened a branch in Castletroy. A local park has also been built including a children's playground and skatepark. The National Technology Park is home to some major business in Castletroy such as 'Vistakon', a contact lens division of Johnson & Johnson and Viagogo an online ticket marketplace for buying and selling tickets to live events. More recently Chicago based financial institution Northern Trust has expended in Castletroy's Hamilton House 2 and opened a new office in City East Plaza also in Castletroy.\nIn the past several attempts were made by Limerick City Council to expand its area of control to include Castletroy as part of its plan to expand the old city boundary to include large suburbs just outside the boundary. Up until June 2014 Castletroy and neighbouring suburbs were not within the city boundary despite being part of the cities overall urban fabric.  The amalgamation of the 2 local authorities in Limerick from 2014 saw all areas of Limerick (city and county) come under one united and single authority for the first time. The merger of the authorities saw the city area expanded to include all urban areas (including Castletroy) within the Limerick urban area into the Limerick Metropolitan District within the merged Limerick authority.\nAlso in Castletroy is a small and little-known Jewish graveyard. It dates from the late 19th century when Limerick had a sizable Jewish community and was renovated and reopened by Chief Rabbi Mervis in 1990. Limerick's Jewish population waned over the decades, though a sizable portion of Jews lived in Castletroy as late as the 1980s.\n\n\t\t\n\n\n== References ==", "image": "Castletroy.jpg"}, "Dooradoyle": {"summary": "Dooradoyle (Irish: Tuar an Daill) is a large suburb of Limerick, Ireland. It is one of Limerick's newer suburbs, and is home to the campus of University Hospital Limerick and the Crescent Shopping Centre.", "image": "Dooradoyle.jpg"}, "Glin": {"summary": "Glin (Irish: An Gleann, meaning 'the glen') is a village in the northwest of County Limerick, Ireland.  It is on the south shore of the River Shannon's estuary, on the N69 road between Foynes and Tarbert. The population of the village in 2006 was 566.", "image": "Glin.jpg"}, "Old Cratloe Road": {"summary": "Cratloe (Irish: An Chreatlach, meaning 'The Land of Sallow Trees') is a village in County Clare, Ireland, situated between Limerick and Shannon in the mid-west of Ireland. It is possible that the name derives from Croit-shliabh meaning \"hump-backed hill\", referring to Woodcock Hill. The present-day parish of Cratloe consists of the former parish of Kilfintinan and a portion of the contemporary parish of Killeely. This was agreed upon by priests in the 18th century, who claimed there were not enough members of the clergy to operate fully in both parishes.", "image": "Old Cratloe Road.jpg"}, "Raheen": {"summary": "Raheen (Irish: An Ráithín, meaning 'small ringfort') is a large suburb of Limerick, Ireland. Initially developed to ease population overspill from the city of Limerick, Raheen is socioeconomically diverse, ranging from older, poor class housing estates to relatively affluent areas.", "image": "Raheen.jpg"}, "Castleconnell": {"summary": "Castleconnell (Irish: Caisleán Uí gConaing) is a village in County Limerick on the banks of the River Shannon. It is 11 km (6.8 mi) from Limerick city and near the boundaries of counties Clare and Tipperary.", "image": "Castleconnell.jpg"}, "Abbeyfeale": {"summary": "Abbeyfeale (; Irish: Mainistir na Féile, meaning 'Abbey of the Feale') is a historical market town in County Limerick, Ireland near the boundary with County Kerry. The town is in the south west of Ireland, some 21 km (13 mi) from Newcastle West on the N21 – the main road from Limerick to Tralee.", "image": "Abbeyfeale.jpg"}, "Ardee": {"summary": "Ardee ( – Irish: Baile Átha Fhirdhia – pronounced [ˈbˠalʲə aːhə fʲerðiað]) is a town and townland in County Louth, Ireland. It is located at the intersection of the N2, N52, and N33 roads. The town shows evidence of development from the thirteenth century onward but as a result the continued development of the town since then much of the fabric of the medieval town has been removed.Ardee is on the banks of the River Dee and is equidistant between the county's two biggest towns - approximately 20 km (12 mi) from Dundalk and Drogheda, while it is also close to Slane and Carrickmacross.\nArdee has seen a large growth in population from 2002 to 2010 with an increase of roughly a thousand, the town has an estimated population of 5,000.", "image": "Ardee.jpg"}, "Newtownforbes": {"summary": "Newtownforbes (Irish: an Lios Breac, meaning 'the speckled ringfort') is a village in County Longford, Ireland. It was historically called Lisbrack, an anglicisation of the Irish name.The N4 National primary route passes through  the Main Street of the village, which is situated 6 km (4 miles) northwest of Longford Town.\nThe population of Newtownforbes is 778, as of the 2016 Census. The national school is Scoil Mhuire.  The village has a Catholic church, St. Mary's which has been recently restored. One feature of the renovation is the new west windows, by Joe Sheridan of Kilkenny which shows Virgin Mary with Jesus and St. John and a playfriend. It also shows St. Elither, a local saint, building the first Christian church of the village. The village also has four public houses, several shops and other amenities to cater for the expanding village.  The sports complex has a floodlit pitch and indoor basketball court.Newtownforbes is in the parish of Clonguish; its Irish name is Cluain geis which means The Meadow of the Swans. Clonguish is bordered by four other parishes, Killashee, Templemicheal, Killoe and Drumlish. The parish also shares a common boundary with the province of Connacht in that it adjoins the parishes of Bornacoola and Gortletteragh in County Leitrim and is separated by the Shannon from Kilbarry in County Roscommon. The River Camlin flows through the south-western end of the parish.\nOn the approach to Newtownforbes from Longford, there is an old house called Minard House on the left. It was built in the 1760s and was the base to a local radio station.", "image": "Newtownforbes.jpg"}, "Newcastle West": {"summary": "Newcastle West (Irish: an Caisleán Nua Thiar) or simply Newcastle (an Caisleán Nua, formerly anglicized Castlenoe) is a town in west County Limerick, Ireland. It is the largest town in the county, excluding Limerick city, and sits on the River Arra which flows into the River Deel. Newcastle West is in the middle of a great bowl-shaped valley in West Limerick, known one time as the valley of the Wild Boar, apparently due to the abundance of this animal here when the area was thickly wooded. The crest of the town carries the image of a wild boar. Newcastle West is on the N21 road from Limerick to Tralee, between Rathkeale and Abbeyfeale. In 2016, the population of the town was 6,619.", "image": "Newcastle West.jpg"}, "Annacotty": {"summary": "Annacotty (Irish: Áth an Choite, meaning 'the ford of the angling cots') is a suburban town on the outskirts of Limerick, Ireland, 7 km (4.3 mi) from the centre of the city. It is situated where the old N7 main road between Limerick and Dublin crosses the Mulkear River, 1 km (0.62 mi) upstream of where it flows into the River Shannon.", "image": "Annacotty.jpg"}, "Manorhamilton": {"summary": "Manorhamilton (Irish: Cluainín (Uí Ruairc)) is the second-largest town in County Leitrim, Ireland. It is located on the N16 between Sligo 16 miles (26 km) and Enniskillen 25 miles (40 km).", "image": "Manorhamilton.jpg"}, "Clonee (Meath)": {"summary": "Clonee (Irish: Cluain Aodha, meaning 'Aodh's pasture') is a village and a townland in County Meath, Ireland. It borders Fingal to the east at the townlands of Huntstown and Littlepace, and is sometimes used in addresses for housing in those townlands. The River Tolka passes the village.", "image": "Clonee (Meath).jpg"}, "Corbally": {"summary": "Limerick (; Irish: Luimneach [ˈl̪ˠɪmʲ(ə)nʲəx]) is a city in County Limerick, Ireland. It is located in the Mid-West Region and is also part of the province of Munster. With a population of 94,192 at the 2016 census, Limerick is the third-most populous urban area in the state, and the fourth-most populous city on the island of Ireland. The city lies on the River Shannon, with the historic core of the city located on King's Island, which is bounded by the Shannon and Abbey Rivers. Limerick is also located at the head of the Shannon Estuary, where the river widens before it flows into the Atlantic Ocean. Limerick City and County Council is the local authority for the city.", "image": "Corbally.jpg"}, "Charlestown": {"summary": "Charlestown (Irish: Baile Chathail) is a town in County Mayo, Ireland, on the N17 road near its junction with the N5.", "image": "Charlestown.JPG"}, "Dock Road": {"summary": "County Limerick (Irish: Contae Luimnigh) is a county in Ireland. It is located in the province of Munster, and is also part of the Mid-West Region. It is named after the city of Limerick. Limerick City and County Council is the local council for the county. The county's population at the 2016 census was 194,899 of whom 94,192 lived in Limerick City, the county capital.", "image": "Dock Road.png"}, "Swinford": {"summary": "Swinford, (Irish: Béal Átha na Muice, meaning 'ford-mouth of the pig'), is a town in County Mayo, Ireland. It is surrounded by the settlements of Midfield, Meelick, Culmore, Cloonaghboy, Killasser, Kinaffe and other villages. It is just off the N5 road, located 18 km (11 mi) from Ireland West Airport Knock (formerly known as Knock International Airport). Situated on a tributary of the River Moy, Swinford is known for its fishing waters, including the Callow lakes and the lakes of Conn and Cullin. Swinford was bypassed in 1993 by the N5 route and was the first town in Mayo to be bypassed.", "image": "Swinford.jpg"}, "Ashbourne": {"summary": "Ashbourne, historically called Killeglan or Kildeglan  (Irish: Cill Dhéagláin, meaning 'Déaglán's church'), is the second largest town in County Meath, Ireland. It is about 20 km north of Dublin close to the M2 motorway.", "image": "Ashbourne.jpg"}, "Dunshaughlin": {"summary": "Dunshaughlin (Irish: Dún Seachlainn, meaning 'the fort of Seachlainn' or locally Irish: Domhnach Seachnaill, meaning 'St Seachnall's Church') is a town in County Meath, Ireland. A commuter town for nearby Dublin, Dunshaughlin more than tripled in population (from 1,275 to 4,035 inhabitants) between the 1991 and 2016 censuses.", "image": "Dunshaughlin.jpg"}, "Bettystown": {"summary": "Bettystown (Irish: Baile an Bhiataigh), previously known as Betaghstown transliterated to Beattystown/Bettystown, is a small village in an area known as East Meath within County Meath, Ireland.  Together with the neighbouring villages of Laytown and Mornington it comprises the census town of Laytown-Bettystown-Mornington with a combined population of 10,889 at the 2011 Census and 11,872 (with Donacarney) at the 2016 Census. During the Celtic Tiger, with increasing property prices in Dublin, Bettystown expanded to cater for large numbers of commuters to Dublin. The area was well known before that as a spot for Dublin summer holiday visitors, with a number of caravan parks and seaside amusements. \nIn 2007, it was announced that in revisions to Dáil Constituency boundaries for 2012, Bettystown and Laytown as far as the River Nanny would be ceded from the three-seat constituency of Meath East to the five-seat constituency of Louth.", "image": "Bettystown.jpg"}, "Foxford": {"summary": "Foxford (Irish: Béal Easa, meaning 'mouth of the waterfall') is a village 16 km south of Ballina in County Mayo, Ireland. It stands on the N26 national primary route from Swinford to Ballina and has a railway station served by trains between Manulla Junction and Ballina.  \nFoxford lies on the River Moy, a salmon-fishing river, close to Loughs Conn and Cullin and between the Nephin and Ox Mountains. The Foxford Way is an 86-km waymarked tourist trail that circles Foxford, taking in the Ox Mountains, bogland, archeological sites, lakeshores and river banks.\nAgnes Bernard founded a convent and started a water-powered woollen mill here in 1892. The Foxford Woollen Mills are known for producing characteristic wool blankets.", "image": "Foxford.jpg"}, "Dunboyne": {"summary": "Dunboyne (Irish: Dún Búinne, meaning 'Búinne's stronghold') is a town in Meath, Ireland. It is located close to Blanchardstown and is a commuter town for Dublin. In the 20 years between the 1996 and 2016 censuses, the population of Dunboyne more than doubled from 3,080 to 7,272 inhabitants.", "image": "Dunboyne.jpg"}, "Duleek": {"summary": "Duleek (; Irish: Damhliag, meaning 'stone house or church') is a village in County Meath, Ireland.\nDuleek takes its name from the Irish word daimh liag, meaning house of stones and referring to an early stone-built church, St Cianán’s Church, the ruins of which are still visible in Duleek today.", "image": "Duleek.jpg"}, "Athboy": {"summary": "Athboy (Irish: Baile Átha Buí, meaning 'Town of the Yellow Ford'), is a small agricultural town located in County Meath. The town is located on the Yellow Ford River, in wooded country near the County Westmeath border.", "image": "Athboy.jpg"}, "Drogheda (Louth)": {"summary": "Drogheda ( DRAW-həd-ah; Irish: Droichead Átha [ˈd̪ˠɾˠɛhəd̪ˠ ˈaːhə], meaning \"bridge at the ford\") is one of the oldest towns in Ireland. It is located on the Dublin–Belfast corridor on the east coast of Ireland, mostly in County Louth but with the south fringes of the town in County Meath, 49 km or 30 miles north of Dublin. Drogheda has a population of approximately 41,000 inhabitants (2016), making it the eleventh largest settlement by population in all of Ireland. It is the last bridging point on the River Boyne before it enters the Irish Sea. The UNESCO World Heritage Site of Newgrange is located 8 km west of the city.\n\nDrogheda was founded as two separately administered towns in two different territories: Drogheda-in-Meath (i.e. the Lordship and Liberty of Meath, from which a charter was granted in 1194) and Drogheda-in-Oriel (or 'Uriel', as County Louth was then known). The division came from the twelfth-century boundary between two Irish kingdoms, colonised by different Norman interests, just as the River Boyne continues to divide the town between the dioceses of Armagh and Meath.  In 1412 these two towns were united, and Drogheda became a 'County Corporate', styled as 'the County of the Town of Drogheda'. Drogheda continued as a County Borough until the setting up of County Councils through the enactment of the Local Government (Ireland) Act 1898, which saw all of Drogheda, including a large area south of the Boyne, become part of an extended County Louth. With the passing of the County of Louth and Borough of Drogheda (Boundaries) Provisional Order, 1976, County Louth again grew larger at the expense of County Meath. The boundary was further altered in 1994 by the Local Government (Boundaries) (Town Elections) Regulations 1994. The 2007–2013 Meath County Development Plan recognises the Meath environs of Drogheda as a primary growth centre on a par with Navan.\nThe city was selected to host Fleadh Cheoil na hÉireann in 2018.", "image": "Drogheda (Louth).jpg"}, "Laytown": {"summary": "Laytown (Irish: An Inse, meaning 'the holm') is a village in County Meath, Ireland, located on the R150 regional road and overlooking the Irish Sea. Historically it was called Ninch, after the townland it occupies. Together with the neighbouring villages of Mornington and Bettystown it comprises the census town of Laytown-Bettystown-Mornington with a combined population of 10,889 at the 2011 Census, which is part of the wider area collectively known as East Meath. The 2016 Census recorded a population of 11,872 in the area which is now called Laytown-Bettystown-Mornington-Donacarney.", "image": "Laytown.jpg"}, "Castlebar": {"summary": "Castlebar (Irish: Caisleán an Bharraigh, meaning 'Barry's Castle') is the county town of County Mayo, Ireland.\nA campus of Galway-Mayo Institute of Technology and the Country Life section of the National Museum of Ireland are two important local amenities. The town is linked by railway to Dublin, Westport and Ballina. The main route by road is the N5.", "image": "Castlebar.jpg"}, "Edgeworthstown": {"summary": "Edgeworthstown or Mostrim (Irish: Meathas Troim, meaning 'frontier of the elder tree') is a small town in County Longford, Ireland. The town is in the east of the county, near the border with County Westmeath. Nearby towns are Longford 12 km to the west, Mullingar 26 km to the east, Athlone 40 km to the south and Cavan 42 km to the north.", "image": "Edgeworthstown.jpg"}, "Ballinrobe": {"summary": "Ballinrobe (Irish: Baile an Róba, meaning 'town of the (river) Robe') is a town in County Mayo in Ireland. It is located on the River Robe, which empties into Lough Mask two kilometres to the west. The population in the 2016 Census was 3,770.", "image": "Ballinrobe.JPG"}, "Dundalk": {"summary": "Dundalk ( dun-DAWK; Irish: Dún Dealgan [ˌd̪ˠuːnˠ ˈdʲalˠɡənˠ], meaning \"Dalgan's fort\") is the county town of County Louth, Ireland. It is on the Castletown River, which flows into Dundalk Bay, and near the border with Northern Ireland, halfway between Dublin and Belfast. It has associations with the mythical warrior hero Cú Chulainn.", "image": "Dundalk.png"}, "Claremorris": {"summary": "Claremorris (; Irish: Clár Chlainne Mhuiris) is a town in County Mayo in the west of Ireland, at the junction of the N17 and the N60 national routes. Claremorris is the fastest growing town in County Mayo. There was a 31% increase in the town's population between 2006 and 2011 and a 23% increase between 2002 and 2006. The population of Claremorris in the 2016 Census was 3,687, rising from 3,412 in the 2011 Census.The town sits at the bottom of a valley, all roads leading to the town follow hills, in particular the old Knock road (known as the Knock hill) and Courthouse road. Although low-lying, the town does not experience flooding. There is no major river through the town although there are two lakes in the town centre: Clare Lake where the 'Land of the Giants' amenity is located and Mayfield Lake.", "image": "Claremorris.jpg"}, "Ballyhaunis": {"summary": "Ballyhaunis (Irish: Béal Átha hAmhnais, meaning 'ford-mouth of strife') is a town in County Mayo, Ireland. It is at the crossroads of the N60 and N83 National secondary roads and on the railway line linking Dublin to Westport and Ballina. \nIt is thought that the town grew up around St Mary's Augustinian Friary (popularly referred to as \"the Abbey\"), which was founded in 1348, according to local tradition. The town and its hinterland contain a number of megalithic monuments.According to the 2016 Census, Ballyhaunis had a population of 2,312. Non-Irish nationals made up 42% of the population, which is much higher than the national average of  and is the highest of any town in Ireland. Poles and Pakistanis make up the largest groups of immigrants. Meanwhile, White Irish people make up 40% of the population. There are two Roman Catholic churches in the town, and it is also home to Ireland's first purpose-built mosque, the first mosque in Ireland outside Dublin. Farming, private business and industry are the main sources of employment.Ballyhaunis is within both the Roman Catholic and civil parishes of Annagh.", "image": "Ballyhaunis.jpg"}, "Kilmallock": {"summary": "Kilmallock (Irish: Cill Mocheallóg) is a town in south County Limerick, Ireland, near the border with County Cork. There is a Dominican Priory in the town and King's Castle (or King John's Castle). The remains of medieval walls which encircled the settlement are still visible.", "image": "Kilmallock.jpg"}, "Ballymahon": {"summary": "Ballymahon (Irish: Baile Uí Mhatháin, meaning 'Mahon's town') on the River Inny is a town in the southern part of County Longford, Ireland. It is located at the junction of the N55 National secondary road and the R392 regional road.", "image": "Ballymahon.jpg"}, "Navan": {"summary": "Navan ( NAV-ən; Irish: An Uaimh [ənˠ ˈuəvʲ], meaning \"the Cave\") is the county town of County Meath, Ireland. In 2016, it had a population of 30,173, making it the fifth largest town in Ireland. Navan is at the confluence of the River Boyne and Blackwater.", "image": "Navan.JPG"}, "Drogheda (Meath)": {"summary": "Drogheda ( DRAW-həd-ah; Irish: Droichead Átha [ˈd̪ˠɾˠɛhəd̪ˠ ˈaːhə], meaning \"bridge at the ford\") is one of the oldest towns in Ireland. It is located on the Dublin–Belfast corridor on the east coast of Ireland, mostly in County Louth but with the south fringes of the town in County Meath, 49 km or 30 miles north of Dublin. Drogheda has a population of approximately 41,000 inhabitants (2016), making it the eleventh largest settlement by population in all of Ireland. It is the last bridging point on the River Boyne before it enters the Irish Sea. The UNESCO World Heritage Site of Newgrange is located 8 km west of the city.\n\nDrogheda was founded as two separately administered towns in two different territories: Drogheda-in-Meath (i.e. the Lordship and Liberty of Meath, from which a charter was granted in 1194) and Drogheda-in-Oriel (or 'Uriel', as County Louth was then known). The division came from the twelfth-century boundary between two Irish kingdoms, colonised by different Norman interests, just as the River Boyne continues to divide the town between the dioceses of Armagh and Meath.  In 1412 these two towns were united, and Drogheda became a 'County Corporate', styled as 'the County of the Town of Drogheda'. Drogheda continued as a County Borough until the setting up of County Councils through the enactment of the Local Government (Ireland) Act 1898, which saw all of Drogheda, including a large area south of the Boyne, become part of an extended County Louth. With the passing of the County of Louth and Borough of Drogheda (Boundaries) Provisional Order, 1976, County Louth again grew larger at the expense of County Meath. The boundary was further altered in 1994 by the Local Government (Boundaries) (Town Elections) Regulations 1994. The 2007–2013 Meath County Development Plan recognises the Meath environs of Drogheda as a primary growth centre on a par with Navan.\nThe city was selected to host Fleadh Cheoil na hÉireann in 2018.", "image": "Drogheda (Meath).jpg"}, "Kells (Meath)": {"summary": "Kells (; Irish: Ceanannas) is a town in County Meath, Ireland. The town lies off the M3 motorway, 16 km (10 mi) from Navan and 65 km (40 mi) from Dublin. It is best known as the site of Kells Abbey, from which the Book of Kells takes its name.", "image": "Kells (Meath).jpg"}, "Belmullet": {"summary": "Belmullet or Béal an Mhuirthead (Irish for \"mouth of the Mullet [Peninsula]\") is a coastal Gaeltacht town with a population of around 1,000 on the Mullet Peninsula in the barony of Erris, County Mayo, Ireland. It is the commercial and cultural heart of the barony of Erris, which has a population of almost 10,000.\nBelmullet has two bays, Blacksod Bay and Broadhaven Bay, linked by Carter's Canal running through the town.", "image": "Belmullet.jpg"}, "Trim": {"summary": "Trim  (Irish: Baile Átha Troim, meaning 'town at the ford of elderflowers') is a town in County Meath, Ireland. It is situated on the River Boyne and has a population of 9,194. The town is noted for Trim Castle – the largest Cambro-Norman castle in Ireland. One of the two cathedrals of the United Dioceses of Meath and Kildare — St Patrick's cathedral — is located north of the river. Trim won the Irish Tidy Towns Competition in 1972, 1984, and 2014 and was the \"joint\" winner with Ballyconnell in 1974. Traditionally Trim was the county town of Meath, but this title was passed on over time onto larger, neighbouring town Navan.", "image": "Trim.JPG"}, "Ballybay": {"summary": "Ballybay (Irish: Béal Átha Beithe, meaning 'mouth of the ford of the birch') is a town in County Monaghan, Ireland. It is centered on the crossroads of the R183 and R162 regional roads.", "image": "Ballybay.jpg"}, "Carrickmacross": {"summary": "Carrickmacross (Irish: Carraig Mhachaire Rois, meaning 'rock of the wooded plain') is a town in County Monaghan, Ireland. The town and environs had a population of 5,032 according to the 2016 census, making it the second-largest town in the county. Carrickmacross is a market town which developed around a castle built by the Earl of Essex in 1630. The town won the European Entente Florale Silver Medal Award in 1998. The local Gaelic football and hurling club is Carrickmacross Emmets. The local soccer team is Carrick Rovers.", "image": "Carrickmacross.jpg"}, "Banagher": {"summary": "Banagher (Irish: Beannchar or Beannchar na Sionna) is a town in Republic of Ireland, located in the midlands, on the western edge of County Offaly in the province of Leinster, on the banks of the River Shannon. The name Banagher comes from its Irish name, which translates to English as \"the place of the pointed rocks on the Shannon\".Banagher was a town of 3,000 people at the height of its economic growth in the mid-19th century. As of 2016, the population was over 1,700. Banagher was historically an important strategic location on the River Shannon and was one of the few crossing points between the provinces of Leinster and Connacht. It thus became a natural focus for a number of historical buildings, including a 19th-century Martello Tower and a number of castles around the town, which were built in the 14th and 15th centuries.\nThe town used to be the focus of thriving river business and was an important stop on the Dublin to Limerick navigation. It supported a number of industries, including a maltings and distillery, which are now defunct. Tourism has supplanted this to a certain extent with a modern marina providing support for river cruisers and watersports facilities and the town is an angling centre, with particular attraction for pike anglers. Banagher is the centre of the Shannon Callows, grassy meadows which flood in winter and provide living space for waterfowl.", "image": "Banagher.jpg"}, "Westport": {"summary": "Westport (Irish: Cathair na Mart, meaning 'stone fort of the beeves', historically anglicised as Cahernamart) is a town in County Mayo in Ireland. It is at the south-east corner of Clew Bay, an inlet of the Atlantic Ocean on the west coast of Ireland. Westport is a popular tourist destination and scores highly for quality of life. It  won the Irish Tidy Towns Competition three times in 2001, 2006 and 2008. In 2012 it won the Best Place to Live in Ireland competition run by The Irish Times.The design for the town was commissioned in the 1780s by the John Browne of the nearby stately home, Westport House, as a place for his workers and tenants to live. John Browne cleared the original village of Cahernamart, that had 700 inhabitants, to make way for his gardens at Westport House.The current town centre was originally designed by William Leeson in 1780, in the Georgian architectural style. Its layout follows the medieval principles of urban design introduced by the Normans in the 13th century. A particular feature is the incorporation of the river into the composition, contained for two blocks by low stone walls producing, on each side of the river, tree lined promenades (The Mall) with several stone bridges over the river Carrow Beg. \nThe famous pilgrimage mountain of Croagh Patrick, known locally as \"the Reek\", lies some 10 km west of the town near the villages of Murrisk and Lecanvey. The mountain forms the backdrop to the town.", "image": "Westport.jpg"}, "Enfield": {"summary": "Enfield (Irish: An Bóthar Buí, meaning 'the yellow road') or Innfield is a town in south County Meath, Ireland, situated between Kilcock and Kinnegad and very close to the border with County Kildare. The town is on the Dublin-Sligo railway line. It is located on the R148 regional road, formerly the N4 national primary road connecting Dublin to Connacht. \nIn the 20 years between the 1996 and 2016 census, the population of Enfield grew considerably from just 566 inhabitants to 3,239 people. This increase is due to its location on the commuter belt to Dublin. Similarly to many other dormitory towns in this vicinity, numerous housing estates have been constructed, with 2016 census numbers indicating that 80% of the town's housing stock (826 of 1,024 households) was built between 1991 and 2010.", "image": "Enfield.jpg"}, "Ballina (Mayo)": {"summary": "Ballina ( bal-ən-A; Irish: Béal an Átha, meaning 'mouth of the ford') is a town in north County Mayo, Ireland. It lies at the mouth of the River Moy near Killala Bay, in the Moy valley and Parish of Kilmoremoy, with the Ox Mountains to the east and the Nephin Beg mountains to the west. The town occupies two baronies; Tirawley on the west bank of the Moy River, and Tireragh, a barony within the County of Sligo, on its east banks. As of 2016, the population of Ballina was 10,171.", "image": "Ballina (Mayo).jpg"}, "Clara": {"summary": "Clara (Clóirtheach or An Clárach in Irish) is a town on the River Brosna in County Offaly and is the 10th largest town in the midlands of Ireland. The town had a population of 3,336 as of the 2016 census. Clara's local services include churches, banks, credit union, schools, supermarkets, shops, garages, pubs, nightclubs and restaurants. It has its own Garda (police) and fire station while the Midlands Regional Hospital is located approximately eleven kilometres away in Tullamore.", "image": "Clara.jpg"}, "Ratoath": {"summary": "Ratoath (Irish: Ráth Tó, meaning 'Tó's ringfort') is a town in the barony of the same name in County Meath, Ireland. The town is centred on the point where the R125 and R155 regional roads meet. The Broad Meadow River (Irish: An Gabhair) flows through the town. As of the 2016 census, there were 9,533 people living in Ratoath.", "image": "Ratoath.jpg"}, "Edenderry": {"summary": "Edenderry (; Irish: Éadan Doire, meaning 'hill-brow of the oak wood') is a town in east County Offaly, Ireland. It is near the borders with Counties Kildare, Meath and Westmeath. The Grand Canal runs along the south of Edenderry, through the Bog of Allen, and there is a short spur to the town centre.\nThe R401 road from Kinnegad to the north and the R402 from Enfield to the east meet at the northeastern end of the Main Street. At the Grand Canal they split, with the R402 continuing westwards towards Tullamore and the R401 heads south to Rathangan and Kildare Town.", "image": "Edenderry.jpg"}, "Stamullen": {"summary": "Stamullen (Irish: Steach Maoilín, meaning 'Mullen's house') is a village in County Meath, Ireland on the border with County Dublin. It lies just off the M1 motorway some 35 km north of Dublin City and beside the Delvin River. In the late 1990s and early 21st century, it expanded significantly with the development of numerous housing estates in the area.", "image": "Stamullen.jpg"}, "Birr": {"summary": "Birr (; Irish: Biorra, meaning \"plain of water\") is a town in County Offaly, Ireland. Between 1620 and 1899 it was called Parsonstown, after the Parsons family who were local landowners and hereditary Earls of Rosse. The town lies within a parish of the same name in the Roman Catholic Diocese of Killaloe.\nBirr is a designated Irish Heritage Town with a carefully preserved Georgian heritage. Birr itself has graceful wide streets and elegant buildings. Many of the houses in John's Place and Oxmantown Mall have exquisite fanlight windows of the Georgian period.\nThe town is known for Birr Castle and its gardens, home of the Parsons family and also the Leviathan of Parsonstown which was the largest telescope in the world for over 70 years.", "image": "Birr.jpg"}, "Ballaghaderreen": {"summary": "Ballaghaderreen (Irish: Bealach an Doirín, meaning 'the way of the little oak grove') is a town in County Roscommon, Ireland, but traditionally part of County Mayo, located just off the N5 National primary road. The population was 1,808 in the 2016 census.", "image": "Ballaghaderreen.jpg"}, "Athlone (Roscommon)": {"summary": "Athlone (; Irish: Baile Átha Luain, meaning 'The town of Luan's ford') is a town in County Westmeath, Ireland. It is located on the River Shannon near the southern shore of Lough Ree.\nIt is the second most populous town in the Midlands Region with a population of 21,349 in the 2016 census.Most of the town lies on the east bank of the river; however, by the terms of the Local Government Act of 1898, six townlands on the west bank of the Shannon, formerly in County Roscommon, were incorporated into the town, and consequently, into the county of Westmeath.The 2016 census recorded the population of the town at 21,349, a 5.9% increase from 2011. Recent growth has also occurred outside the town's boundaries.\nAthlone is near the geographical centre of Ireland, which is 8.85 kilometres (5.50 mi) north-northwest of the town, in the area of Carnagh East in County Roscommon.", "image": "Athlone (Roscommon).jpg"}, "Tullamore": {"summary": "Tullamore (Irish: Tulach Mhór, meaning 'great mound') is the county town of County Offaly, in the midlands of Ireland, and is located in the centre of the county. It is the fourth most populous town in the midlands region with a population of 14,607 in the 2016 census.The town retained Gold Medal status in the National Tidy Town Awards in 2015 and also played host to the World Sheep Dog Trials in 2005 which attracted international interest in the region. The Tullamore Show is held near the town every year.\nThe town's most famous export is Tullamore Dew – an Irish whiskey distilled by Tullamore Distillery – that can be traced back to 1829. The original distillery was shut down in 1954, with the brand later being resurrected and produced at the Midleton Distillery, in Cork. However, the brand's new owners, William Grant & Sons, invested in a new distillery near Tullamore, bringing whiskey production back to the town in 2014.", "image": "Tullamore.jpg"}, "Castleblayney": {"summary": "Castleblayney or Castleblaney (; Irish: Baile na Lorgan) is a town in County Monaghan, Ireland. The town had a population of 3,607 as of the 2016 census. Castleblayney is near the border with County Armagh in Northern Ireland, and lies on the N2 road from Dublin to Derry and Letterkenny.", "image": "Castleblayney.jpg"}, "Castlerea": {"summary": "Castlerea (; Irish: An Caisleán Riabhach, meaning 'brindled castle') is the second largest town in County Roscommon, Republic of Ireland. It is located in the west of the county and had a population of 1,992 at the 2016 Census. Roughly translated from Irish, Castlerea can mean Brindled Castle (Caisleán Riabhach) or King's Castle (Caisleán Rí). The town is built on the banks of the River Suck and the River Francis, both of which are tributaries of the River Shannon.", "image": "Castlerea.jpg"}, "Boyle": {"summary": "Boyle (; Irish: Mainistir na Búille) is a town in County Roscommon, Ireland. It is located at the foot of the Curlew Mountains near Lough Key in the north of the county. Carrowkeel Megalithic Cemetery, the Drumanone Dolmen and the lakes of Lough Arrow and Lough Gara are also close by. As of 2016, the population of the town was 2,568.", "image": "Boyle.jpg"}, "Ballysadare": {"summary": "Ballysadare (Irish: Baile Easa Dara, meaning 'town of the waterfall of the oak'), locally also Ballisodare, is a town in County Sligo, Ireland. It is about 7 kilometres (4 miles) south of Sligo town. The town developed on an important crossing of the Owenmore River.", "image": "Ballysadare.jpg"}, "Ballymote": {"summary": "Ballymote (Irish: Baile an Mhóta, meaning 'town of the motte/mound') is a market town in southern County Sligo in the province of Connacht, in the west of Ireland.  It lies in the barony of Corran.\nThe Norman Ballymote Castle dates from the 1300s and the Book of Ballymote was written in or near the town in the 1390s.", "image": "Ballymote.jpg"}, "Strokestown": {"summary": "Strokestown, historically called Bellanamullia and Bellanamully (Irish: Béal na mBuillí), is a small town in County Roscommon, Ireland. It is located at the junction of the N5 National primary route and the R368 in the north of the county.\nNotable features include the second-widest street in Ireland and the Strokestown Park House, an 18th-century mansion with the longest herbaceous border in Ireland.", "image": "Strokestown.jpg"}, "Lough Gill": {"summary": "Lough Gill (Irish: Loch Gile, meaning 'bright or white lake') is a freshwater lough (lake) mainly situated in County Sligo, but partly in County Leitrim, in Ireland. Lough Gill provides the setting for William Butler Yeats' poem \"The Lake Isle of Innisfree\".", "image": "Lough Gill.jpg"}, "Ballinode": {"summary": "Ballinode or Bellanode (Irish: Béal Átha an Fhóid) is a village situated approximately 6 kilometres (3.7 mi) from Monaghan Town and 3 kilometres (1.9 mi) from Scotstown in County Monaghan, Ireland. The village straddles the Monaghan Blackwater (a tributary of the River Corr, itself a tributary of the Ulster Blackwater) and has a Church of Ireland church with clock tower, cemetery, and church hall; one public house, and a takeaway. There also is an astroturf football pitch in the village which is used for soccer matches.", "image": "Ballinode.jpg"}, "Strandhill": {"summary": "Strandhill or occasionally Larass (Irish: an Leathros) is a coastal town and townland in County Sligo, Ireland. As of 2016, the population was 1,753, an increase of 10% from the 2011 Census. The old name appears to be Ros Dragnige (see Killaspugbrone).", "image": "Strandhill.jpg"}, "Ballina (Tipperary)": {"summary": "Ballina (historically Bellanaha, from Irish: Béal an Átha), meaning \"Mouth of the Ford\", is a village that lies on the River Shannon in County Tipperary, Ireland. It is situated on the eastern shore of Lough Derg across from its 'twin-town' of Killaloe on the west bank of the lake. The towns are joined by Killaloe Bridge.\nThe annual Brian Boru Festival takes place in early July each year. A joint celebration between the two towns of the ancient High King of Ireland, Brian Boru, it involves many community-based activities including a hurling match between the teams from both towns.\nBallina has a primary school, Ballina National School, with the nearest secondary school, St. Anne's Community College, present in Killaloe.", "image": "Ballina (Tipperary).jpg"}, "Cahir": {"summary": "Cahir (; Irish: an Chathair / Cathair Dún Iascaigh) is a town in County Tipperary in Ireland. It is also a civil parish in the barony of Iffa and Offa West.", "image": "Cahir.jpg"}, "Cashel": {"summary": "Cashel (; Irish: Caiseal, meaning 'stone ringfort') is a town in County Tipperary in Ireland. Its population was 4,422 in the 2016 census. The town gives its name to the ecclesiastical province of Cashel. Additionally, the cathedra of the Roman Catholic Archdiocese of Cashel and Emly was originally in the town prior to the English Reformation. It is part of the parish of Cashel and Rosegreen in the same archdiocese. One of the six cathedrals of the Anglican Bishop of Cashel and Ossory, who currently resides in Kilkenny, is located in the town. It is in the civil parish of St. Patricksrock which is in the historical barony of Middle Third.", "image": "Cashel.jpg"}, "Dungarvan": {"summary": "Dungarvan (Irish: Dún Garbhán, meaning 'Garbhann's Fort') is a coastal town and harbour in County Waterford, on the south-east coast of Ireland. Prior to the merger of Waterford County Council with Waterford City Council in 2014, Dungarvan was the county town and administrative centre of County Waterford. Waterford City and County Council retains administrative offices in the town. The town's Irish name means \"Garbhann's fort\", referring to Saint Garbhann who founded a church there in the seventh century. The town lies on the N25 road (European route E30), which connects Cork, Waterford and Rosslare Europort.", "image": "Dungarvan.JPG"}, "Roscrea": {"summary": "Roscrea (Irish: Ros Cré, meaning \"Wood of Cré\") is a historical market town in County Tipperary, Ireland. In 2016 the town had a population of 5,446. The town is one of the oldest in Ireland which developed around the ancient monastery of Saint Crónán of Roscrea, parts of which remain preserved today.\nRoscrea is a designated Irish Heritage Town due to the extent of important historical buildings that are preserved in the town. Amongst the most notable buildings of interest are the 13th century Roscrea Castle and Damer House on Castle Street. Within the town are the remains of the ancient Romanesque doorway and gable-end of St Cronan's church. The Round Tower and the High cross of the ancient monastery are also located nearby. Also of interest in the town are the remains of the 15th century Franciscan Friary and Monaincha and Sean Ross Abbeys. One of the most famous books produced by the monastery is the Book of Dimma currently on display at Trinity College, Dublin", "image": "Roscrea.jpg"}, "Carrick On Suir": {"summary": "Carrick-on-Suir (Irish: Carraig na Siúire, meaning 'rock of the Suir') is a town in County Tipperary. It lies on both banks of the River Suir.The part on the north bank of the Suir lies in the civil parish of \"Carrick\", in the historical barony of Iffa and Offa East. The part on the south bank lies in the civil parish of Kilmolerin in the barony of Upperthird, County Waterford.", "image": "Carrick On Suir.jpg"}, "Fethard": {"summary": "Fethard (; Irish: Fiodh Ard, meaning 'high wood') is a small town in County Tipperary, Ireland. Dating to the Norman invasion of Ireland, the town's walls were first laid-out in the 13th century, with some sections of these defensive fortifications surviving today. \nFethard is located 16 km (9.9 mi) east of Cashel on the Clashawley River where the R692, R689 and R706 regional roads intersect. It is a civil parish in the barony of Middle Third and in the ecclesiastical parish of \"Fethard and Killusty\" in the Roman Catholic Archdiocese of Cashel and Emly. As of 2016, the town's population was 1,545.", "image": "Fethard.jpg"}, "Clonmel": {"summary": "Clonmel (Irish: Cluain Meala, meaning 'honey meadow') is the county town and largest settlement of County Tipperary, Ireland. The town is noted in Irish history for its resistance to the Cromwellian army which sacked the towns of Drogheda and Wexford. With the exception of the townland of Suir Island, most of the borough is situated in the civil parish of \"St Mary's\" which is part of the ancient barony of Iffa and Offa East.", "image": "Clonmel.jpg"}, "Canada Street": {"summary": "County Waterford (Irish: Contae Phort Láirge) is a county in Ireland. It is in the province of Munster and is part of the South-East Region. It is named after the city of Waterford. Waterford City and County Council is the local authority for the county. The population of the county at large, including the city, was 116,176 according to the 2016 census. The county is based on the historic Gaelic territory of the Déise. There is an Irish-speaking area, Gaeltacht na nDéise, in the south-west of the county.", "image": "Canada Street.png"}, "Nenagh": {"summary": "Nenagh (,  NEE-nəh; Irish: Aonach Urmhumhan or simply An tAonach) meaning “The Fair of Ormond” or simply \"The Fair\", is the county town and second largest town in County Tipperary in Ireland. Nenagh used to be a market town, and the site of the East Munster Ormond Fair.", "image": "Nenagh.jpg"}, "Tubbercurry": {"summary": "Tubbercurry or Tobercurry (Irish: Tobar an Choire, meaning 'well of the corrie') is the second-largest town in terms of both population and land area in County Sligo, Ireland. It lies at the foot of the Ox Mountains, on the N17 national primary road. The village is twinned with Viarmes in France.", "image": "Tubbercurry.JPG"}, "Collooney": {"summary": "Collooney or Coloony (Irish: Cúil Mhuine, meaning 'nook of the thicket') is a town in County Sligo, Ireland.", "image": "Collooney.jpg"}, "Cork Road": {"summary": "County Waterford (Irish: Contae Phort Láirge) is a county in Ireland. It is in the province of Munster and is part of the South-East Region. It is named after the city of Waterford. Waterford City and County Council is the local authority for the county. The population of the county at large, including the city, was 116,176 according to the 2016 census. The county is based on the historic Gaelic territory of the Déise. There is an Irish-speaking area, Gaeltacht na nDéise, in the south-west of the county.", "image": "Cork Road.png"}, "Ballytivnan": {"summary": "County Sligo ( SLY-goh, Irish: Contae Shligigh) is a county in Ireland. It is located in the Border Region and is part of the province of Connacht. Sligo is the administrative capital and largest town in the county. Sligo County Council is the local authority for the county. The population of the county was 65,535 at the 2016 census. It is noted for Benbulben Mountain, one of Ireland's most distinctive natural landmarks.", "image": "Ballytivnan.png"}, "Ferrybank": {"summary": "Ferrybank (Irish: Port an Chalaidh) is a suburb of Waterford City in Ireland. Much of Ferrybank is under the political jurisdiction of Waterford City and County council and thus an area of administration for Waterford City, on the northern bank of the River Suir, extending into County Waterford. However, some parts of Ferrybank extend into County Kilkenny and are administered by Kilkenny County Council. There is an ongoing boundary dispute between both jurisdictions, with debates and proposals ongoing for many decades.", "image": "Ferrybank.jpg"}, "Dunmore Road": {"summary": "Dunmore East (Irish: An Dún Mór Thoir) is a popular tourist and fishing village in County Waterford, Ireland. Situated on the west side of Waterford Harbour on Ireland's southeastern coast, it lies within the barony of Gaultier (Gáll Tír – \"foreigners' land\" in Irish): a reference to the influx of Viking and Norman settlers in the area.", "image": "Dunmore Road.jpg"}, "Dunmore East": {"summary": "Dunmore East (Irish: An Dún Mór Thoir) is a popular tourist and fishing village in County Waterford, Ireland. Situated on the west side of Waterford Harbour on Ireland's southeastern coast, it lies within the barony of Gaultier (Gáll Tír – \"foreigners' land\" in Irish): a reference to the influx of Viking and Norman settlers in the area.", "image": "Dunmore East.jpg"}, "Templemore": {"summary": "Templemore (Irish: An Teampall Mór, meaning 'The Big Church') is a town in County Tipperary, Ireland. It is a civil parish in the historical barony of Eliogarty. It is part of the parish of Templemore, Clonmore and Killea in the Roman Catholic Archdiocese of Cashel and Emly.The 2011 Census results show that the town's population decreased by 13.8% from 2,255 in 2006 to 1,943 in 2011.", "image": "Templemore.JPG"}, "Inner Ring Road": {"summary": "County Waterford (Irish: Contae Phort Láirge) is a county in Ireland. It is in the province of Munster and is part of the South-East Region. It is named after the city of Waterford. Waterford City and County Council is the local authority for the county. The population of the county at large, including the city, was 116,176 according to the 2016 census. The county is based on the historic Gaelic territory of the Déise. There is an Irish-speaking area, Gaeltacht na nDéise, in the south-west of the county.", "image": "Inner Ring Road.png"}, "Johns Hill": {"summary": "County Waterford (Irish: Contae Phort Láirge) is a county in Ireland. It is in the province of Munster and is part of the South-East Region. It is named after the city of Waterford. Waterford City and County Council is the local authority for the county. The population of the county at large, including the city, was 116,176 according to the 2016 census. The county is based on the historic Gaelic territory of the Déise. There is an Irish-speaking area, Gaeltacht na nDéise, in the south-west of the county.", "image": "Johns Hill.png"}, "Castle Place": {"summary": "County Waterford (Irish: Contae Phort Láirge) is a county in Ireland. It is in the province of Munster and is part of the South-East Region. It is named after the city of Waterford. Waterford City and County Council is the local authority for the county. The population of the county at large, including the city, was 116,176 according to the 2016 census. The county is based on the historic Gaelic territory of the Déise. There is an Irish-speaking area, Gaeltacht na nDéise, in the south-west of the county.", "image": "Castle Place.png"}, "Penrose Lane": {"summary": "County Waterford (Irish: Contae Phort Láirge) is a county in Ireland. It is in the province of Munster and is part of the South-East Region. It is named after the city of Waterford. Waterford City and County Council is the local authority for the county. The population of the county at large, including the city, was 116,176 according to the 2016 census. The county is based on the historic Gaelic territory of the Déise. There is an Irish-speaking area, Gaeltacht na nDéise, in the south-west of the county.", "image": "Penrose Lane.png"}, "Ballytruckle": {"summary": "County Waterford (Irish: Contae Phort Láirge) is a county in Ireland. It is in the province of Munster and is part of the South-East Region. It is named after the city of Waterford. Waterford City and County Council is the local authority for the county. The population of the county at large, including the city, was 116,176 according to the 2016 census. The county is based on the historic Gaelic territory of the Déise. There is an Irish-speaking area, Gaeltacht na nDéise, in the south-west of the county.", "image": "Ballytruckle.png"}, "Poleberry": {"summary": "County Waterford (Irish: Contae Phort Láirge) is a county in Ireland. It is in the province of Munster and is part of the South-East Region. It is named after the city of Waterford. Waterford City and County Council is the local authority for the county. The population of the county at large, including the city, was 116,176 according to the 2016 census. The county is based on the historic Gaelic territory of the Déise. There is an Irish-speaking area, Gaeltacht na nDéise, in the south-west of the county.", "image": "Poleberry.png"}, "Portlaw": {"summary": "Portlaw (Irish: Port Cládach or Port Lách) is a town in County Waterford, Ireland. It is also a parish in the Roman Catholic Diocese of Waterford and Lismore. It is situated some 19 km west-north-west of Waterford City, where the Clodiagh meets the Suir.", "image": "Portlaw.jpg"}, "Castlepollard": {"summary": "Castlepollard (Irish: Baile na gCros or Cionn Toirc) is a village  in north County Westmeath, Republic of Ireland. It lies west of Lough Lene and northeast of Lough Derravaragh and Mullingar.", "image": "Castlepollard.jpg"}, "Lismore": {"summary": "Lismore (Irish: Lios Mór, meaning 'great ringfort') is a historic town in County Waterford, in the province of Munster, Ireland.", "image": "Lismore.jpg"}, "Moate": {"summary": "Moate (; Irish: An Móta) is a town in County Westmeath, Ireland.\nThe name An Móta is derived from the term motte-and-bailey, as the Normans built an example of this type of fortification here. The earthwork is still visible behind the buildings on the main street.\nThe town later became an important marketplace and Quaker village. It has made the town much more wealthy.  There are several extant examples of Quaker houses on the main street, which itself is typical of an Irish marketplace.", "image": "Moate.jpg"}, "Thurles": {"summary": "Thurles (; Durlas Éile) is a town in County Tipperary, Ireland. It is located in the civil parish of same name in the barony of Eliogarty and in the ecclesiastical parish of Thurles. The cathedral church of the Roman Catholic Archdiocese of Cashel and Emly is located in the town.", "image": "Thurles.png"}, "Mary Street": {"summary": "County Waterford (Irish: Contae Phort Láirge) is a county in Ireland. It is in the province of Munster and is part of the South-East Region. It is named after the city of Waterford. Waterford City and County Council is the local authority for the county. The population of the county at large, including the city, was 116,176 according to the 2016 census. The county is based on the historic Gaelic territory of the Déise. There is an Irish-speaking area, Gaeltacht na nDéise, in the south-west of the county.", "image": "Mary Street.png"}, "Tramore": {"summary": "Tramore (; Irish: Trá Mhór, meaning 'great strand') is a seaside town in County Waterford, on the southeast coast of Ireland. With humble origins as a small fishing village, the area saw rapid development upon the arrival of the railway from Waterford City in 1853. Initially the town flourished as a tourist destination, attracting visitors from as far away as Dublin in summer and from closer to home all year-round. As the population grew steadily in the latter part of the 20th century, Tramore became a satellite and dormitory town of Waterford City, situated some 13 km to the north. Today the town is a popular destination for surfing and other water sports due to its large, sheltered bay and provision of accommodation and amenities.", "image": "Tramore.jpg"}, "Kilbeggan": {"summary": "Kilbeggan (Irish: Cill Bheagáin, meaning 'church of Bécán') is a town in the barony of Moycashel, County Westmeath, Ireland.", "image": "Kilbeggan.JPG"}, "Kinnegad": {"summary": "Kinnegad or Kinagad (Irish: Cionn Átha Gad, meaning \"‘the head of the ford of withes\") is a town in County Westmeath, Ireland. It is on the border with County Meath, near the junction of the M6 and the M4 motorways - two of Ireland's main east–west roads. It is roughly 60 km from the capital, Dublin.\nFrom 1996–2016, there was a considerable increase in Kinnegad's population, from 517 to 2,745 inhabitants. According to the 2016 census, approximately 79% of the town's housing stock (715 out of 907 households) was built between 1991–2010. Tesco Ireland opened a supermarket in the town in late 2010. In 2014, a hotel, which stands on the site of a former pub, \"Harry's of Kinnegad\", was opened. The Kinnegad Plaza opened in 2019.", "image": "Kinnegad.jpg"}, "Railway Square": {"summary": "County Waterford (Irish: Contae Phort Láirge) is a county in Ireland. It is in the province of Munster and is part of the South-East Region. It is named after the city of Waterford. Waterford City and County Council is the local authority for the county. The population of the county at large, including the city, was 116,176 according to the 2016 census. The county is based on the historic Gaelic territory of the Déise. There is an Irish-speaking area, Gaeltacht na nDéise, in the south-west of the county.", "image": "Railway Square.png"}, "Rosslare": {"summary": "Rosslare Strand, or simply Rosslare (Irish: Ros Láir, meaning 'the middle peninsula'), is a village and seaside resort in County Wexford, Ireland. The name Rosslare Strand is used to distinguish it from the nearby community of Rosslare Harbour, site of the Rosslare Europort.", "image": "Rosslare.jpg"}, "Kilcoole": {"summary": "Kilcoole (Irish: Cill Chomhghaill, meaning 'Church of Comhghall') is a village in County Wicklow, Ireland. It is three kilometres south of Greystones, 14 kilometres north of Wicklow, and about 28 kilometres south of Dublin. It was used as the set for the Irish television series Glenroe, which ran through the 1980s and 1990s.\nThe village has a large industrial estate to the south. An area of marshland runs along the coast from Kilcoole south to Wicklow town, called the Murragh. This area is home to many endangered species of plant and animal. The beach in Kilcoole is the summertime home of the little tern, one of the few places in Ireland where these birds nest. Within the village, is an area of flora known as the Rock which is a huge rock/hill that predates the Cambrian Period.\nKilcoole is in the Roman Catholic parish of Kilquade, and the local church, St. Anthony's Church, cost £35,000 to build in the 1960s.", "image": "Kilcoole.jpg"}, "Bray": {"summary": "Bray (Irish: Bré [bʲɾʲeː]) is a coastal town in north County Wicklow, Ireland. It is situated about 20 km (12 mi) south of Dublin city centre on the east coast. It has a population of 32,600 making it the ninth largest urban area within Ireland (at the 2016 census).Bray was a resort town, and its proximity to Dublin make it a destination for tourists and day-trippers from the capital. Bray is home to Ardmore Studios, and some light industry is located in the town, with some business and retail parks on its southern periphery. Commuter links between Bray and Dublin are provided by rail, Dublin Bus and the M11 and M50 motorways.", "image": "Bray.JPG"}, "Clonard": {"summary": "Clonard (Irish: Cluain Ioraird, meaning 'Iorard's pasture') is a small village in County Meath, Ireland.  It lies on the R148 regional road between the towns of Kinnegad and Enfield. This road was the main road between Dublin and Galway until the construction of the M4 motorway. It is still used by traffic avoiding the toll on the M4.\n\nClonard is notable for being one of the earliest Christian sites in Ireland, being linked with the first Irish bishop Palladius c. 450 and as the location of a major early medieval monastery Clonard Abbey, founded in the 6th century by St. Finnian.\nAround 1177, Hugh de Lacy, Lord of Meath, built a motte-and-bailey fortification at Clonard.\nThe village contains a Catholic church, a graveyard and a primary school.\nIt is served by Bus Éireann services to Dublin and West of Ireland.", "image": "Clonard.jpg"}, "Scotch Quay": {"summary": "County Waterford (Irish: Contae Phort Láirge) is a county in Ireland. It is in the province of Munster and is part of the South-East Region. It is named after the city of Waterford. Waterford City and County Council is the local authority for the county. The population of the county at large, including the city, was 116,176 according to the 2016 census. The county is based on the historic Gaelic territory of the Déise. There is an Irish-speaking area, Gaeltacht na nDéise, in the south-west of the county.", "image": "Scotch Quay.png"}, "Templars Hall": {"summary": "County Waterford (Irish: Contae Phort Láirge) is a county in Ireland. It is in the province of Munster and is part of the South-East Region. It is named after the city of Waterford. Waterford City and County Council is the local authority for the county. The population of the county at large, including the city, was 116,176 according to the 2016 census. The county is based on the historic Gaelic territory of the Déise. There is an Irish-speaking area, Gaeltacht na nDéise, in the south-west of the county.", "image": "Templars Hall.png"}, "Arklow": {"summary": "Arklow ( ARK-loh; from Old Norse  Arnkell-lág, meaning 'meadow of Arnkell', Irish: An tInbhear Mór, meaning 'the great estuary') is a town in County Wicklow on the east coast of Ireland, overlooked by Ballymoyle hill. It was founded by the Vikings in the ninth century. Arklow  was the site of one of the bloodiest battles of the 1798 rebellion. Its proximity to Dublin led to it becoming a commuter town with a population of 13,163 as of the 2016 census.Arklow is at the mouth of the River Avoca (formerly Avonmore), the longest river wholly within County Wicklow. The town is divided by the river, which is crossed by the Nineteen Arches Bridge, a stone arch bridge linking the southern or main part of the town with the northern part, called Ferrybank. The Nineteen Arches Bridge is the longest handmade stone bridge in Ireland, and a plaque on the south end of the bridge acknowledges this.", "image": "Arklow.jpg"}, "Mullingar": {"summary": "Mullingar ( muhl-in-GAR; Irish: An Muileann gCearr, meaning 'the incorrect mill, because it turned in a counter-clockwise fashion') is the county town of County Westmeath in Ireland. It is the 3rd most populous town in the midlands region, with a population of 20,928 in the 2016 census.The Counties of Meath and Westmeath Act 1543 proclaimed Westmeath a county, separating it from Meath. Mullingar became the administrative centre for County Westmeath. The town was originally named Maelblatha, and takes its modern name from a mill noted in the legend of Colman of Mullingar.Traditionally a market town serving the large agricultural hinterland, Mullingar remains a significant commercial location. It had a tradition of cattle-trading until 2003 when its cattle market was closed for development of a mixed commercial and residential scheme called Market Point. However, in 2014 the local County Council have allowed an annual Christmas Market to take place on Mount Street.\nMullingar has a number of neighbouring lakes, including Lough Owel, Lough Ennell and Lough Derravaragh. Lough Derravaragh is also known for its connection with the Irish legend of the Children of Lir. The town of Mullingar is linked to Lough Ennell via Lacy's Canal and the River Brosna. Another nearby waterway is the Royal Canal, which loops around Mullingar.", "image": "Mullingar.JPG"}, "Enniscorthy": {"summary": "Enniscorthy (Irish: Inis Córthaidh) is the second-largest town in County Wexford, Ireland. At the 2016 census, the population of the town and environs increased 11,381.The town is twinned with Gimont, France. The Placenames Database of Ireland sheds no light on the origins of the town's name. It may refer either to the \"Island of Corthaidh\" or the \"Island of Rocks\". The cathedral of the Roman Catholic Diocese of Ferns is located in the town.", "image": "Enniscorthy.jpg"}, "Blessington": {"summary": "Blessington, historically known as Ballycomeen (Irish: Baile Coimín, meaning 'town of Comyn', from the Irish surname Ó Coimín), is a town on the River Liffey in Wicklow, Ireland, near the border with Kildare. It is around 25 km south-west of Dublin, and is situated on the N81 road, which connects Dublin to Tullow.", "image": "Blessington.jpg"}, "Baltinglass": {"summary": "Baltinglass, historically known as Baltinglas (Irish: Bealach Conglais, meaning 'road (or way) of Conglas'), is a town in south-west County Wicklow, Ireland.  It is located on the River Slaney near the border with County Carlow and County Kildare, on the N81 road.", "image": "Baltinglass.jpg"}, "Ferns": {"summary": "Ferns (Irish: Fearna, meaning 'alder trees' short for Fearna Mór Maedhóg) is a historic town in north County Wexford, Ireland. It is 11.7 km (7.3 mi) from Enniscorthy, where the Gorey to Enniscorthy R772 road joins the R745, both regional roads. The remains of Ferns Castle are in the centre of the town.", "image": "Ferns.jpg"}, "Gorey": {"summary": "Gorey (Irish: Guaire) is a market town in north County Wexford, Ireland. It is beside the main M11 Dublin to Wexford road. The town is also connected to the railway network along the same route. Local newspapers include the Gorey Guardian and Gorey Echo.\nAs a growing commuter town to Dublin for some residents, there has been an increase in population in the early 21st century. Between 1996 and 2002, the population of the surrounding district grew by 23%, and the town itself more than doubled in population (from 3,939 to 9,822 inhabitants) in the 20 years between the 1996 and 2016 census.", "image": "Gorey.jpg"}, "Kilmuckridge": {"summary": "Kilmuckridge (Irish: Cill Mhucraise), formerly Ford or The Ford, is a village in County Wexford in Ireland, near the Irish Sea coast.\nIt is known for its beach, Morriscastle, which was listed by the Irish Times as one of the Top 5 beaches in Ireland.", "image": "Kilmuckridge.jpg"}, "New Ross": {"summary": "New Ross (Irish: Ros Mhic Thriúin, formerly Ros Mhic Treoin) is a town in southwest County Wexford, Ireland. It is located on the River Barrow, near the border with County Kilkenny, and is around 20 km (12 miles) north east of Waterford. In 2016 it had a population of 8,040 people, making it the fourth-largest town in the county.", "image": "New Ross.jpg"}, "Rathnew": {"summary": "Rathnew (Irish: Ráth Naoi, meaning 'The Ring Fort of Naoi') is a village in County Wicklow, Ireland. Located south of the capital Dublin along the M11 between Dublin and Wexford, it is close to the county town of Wicklow, which is situated 3 km (1.9 mi) to the east.", "image": "Rathnew.jpg"}, "Bunclody": {"summary": "Bunclody (Irish: Bun Clóidí, meaning 'bottom of the (river) Clody'), formerly Newtownbarry (until 1950), is a small town on the River Slaney in Wexford, Ireland.  It is located near the foot of Mount Leinster. Most of the town is in County Wexford; a small area at the north end of town is in County Carlow. Bunclody has received a number of high scores in the Tidy Towns competition. The town is known for the \"Streams of Bunclody Festival\" held during the month of July.\nBunclody was an All-Ireland Pride of Place Winner in 2018. A volunteer led tourist office is open in the town.The R746 regional road intersects the N80 in the middle of Bunclody.", "image": "Bunclody.jpg"}, "Athlone (Westmeath)": {"summary": "Athlone (; Irish: Baile Átha Luain, meaning 'The town of Luan's ford') is a town in County Westmeath, Ireland. It is located on the River Shannon near the southern shore of Lough Ree.\nIt is the second most populous town in the Midlands Region with a population of 21,349 in the 2016 census.Most of the town lies on the east bank of the river; however, by the terms of the Local Government Act of 1898, six townlands on the west bank of the Shannon, formerly in County Roscommon, were incorporated into the town, and consequently, into the county of Westmeath.The 2016 census recorded the population of the town at 21,349, a 5.9% increase from 2011. Recent growth has also occurred outside the town's boundaries.\nAthlone is near the geographical centre of Ireland, which is 8.85 kilometres (5.50 mi) north-northwest of the town, in the area of Carnagh East in County Roscommon.", "image": "Athlone (Westmeath).jpg"}, "Newtownmountkennedy": {"summary": "Newtownmountkennedy (Irish: Baile an Chinnéidigh, meaning 'Kennedy's town') is a small town in County Wicklow, Ireland. It developed within the historic townland of Ballygarny (Irish: Baile Ó gCearnaigh), although all that remains of the village is an old church and graveyard just 0.45 km (0.28 mi) outside the town. It acquired its present name in the mid-seventeenth-century, when Sir Robert Kennedy, M.P. for Kildare, made it his principal residence. It is just off the N11 road to Wexford, just south of Kilpedder and south-west of Greystones. It is about 15 km (9.3 mi) north of Wicklow town, 15 km (9.3 mi) south of Bray and approximately 35 km (22 mi) from Dublin. The R772 regional road passes through the village. This was the main Dublin-Wexford route, the N11, but the village was bypassed by the new N11 dual carriageway in 1990. This town has one of the longest place names in Ireland.\nBetween the 2011 and 2016 census, the population of the town increased by 17.6% (from 2,410 to 2,835 inhabitants), one of the highest growth rates in County Wicklow on the period. The area is a dormitory town for some workers commuting to Bray and Dublin.The headquarters of Coillte, the Irish Forestry Board, are situated in the village forest. Newtownmountkennedy is in the Roman Catholic parish of Kilquade and one of the Kilquade parish's two chapels of ease is located in the village at the junction with the Roundwood Road.", "image": "Newtownmountkennedy.jpg"}, "Mulgannon": {"summary": "County Wexford (Irish: Contae Loch Garman) is a county in Ireland. It is in the province of Leinster and is part of the South-East Region. Named after the town of Wexford, it was based on the historic Gaelic territory of Hy Kinsella (Uí Ceinnsealaigh), whose capital was Ferns. Wexford County Council is the local authority for the county. The population of the county was 149,722 at the 2016 census.", "image": "Mulgannon.png"}, "Greystones": {"summary": "Greystones (Irish: Na Clocha Liatha) is a  coastal town and seaside resort in County Wicklow, Ireland. It lies on Ireland's east coast, 3.5 km (2.2 mi) south of Bray and 24 km (15 mi) south of Dublin city centre and has a population of 18,140 (2016). The town is bordered by the Irish Sea to the east, Bray Head to the north and the Wicklow Mountains to the west. It is the 2nd biggest town in the county (after Bray).\nThe town was named after a half-mile or one-kilometre stretch of grey stones between two beaches on the seafront. The harbour area and Greystones railway station are at the northern and southern ends respectively. The North Beach, which begins at the harbour, is a stony beach, and some of its length is overlooked by the southern cliffs of Bray Head, which are subject to erosion. The South Beach is a broad sandy beach about one kilometre long. It is a Blue Flag beach and receives many visitors and tourists, mainly in the summer.\nIn 2008, Greystones was named as the world's 'most liveable community' at the LivCom Awards in China.", "image": "Greystones.jpg"}, "Delgany": {"summary": "Delgany (Irish: Deilgne, meaning 'thorny place') is a  rural  village in County Wicklow located on the R762 road which connects to the N11 road at the Glen of the Downs. It is about 25 km (16 mi) south of Dublin city centre. Despite being an older settlement, it is now part of the continuous urban area of Greystones. The area is surrounded by wooded hills (including Kindlestown Wood) and the Glen of the Downs. \nDelgany has a Church of Ireland parish church which is associated with the nearby Delgany National School. It is also in the Roman Catholic parish of Kilquade and the parish church is located in Kilquade about 4 km (2.5 mi) south. The local Catholic school is St Laurence's National School which is located on Convent Road.", "image": "Delgany.jpg"}}}